{
  "abstractText": {
    "page": 0,
    "region": {
      "x1": 53.54899978637695,
      "x2": 295.7410888671875,
      "y1": 210.4398956298828,
      "y2": 435.0480041503906
    },
    "text": "ABSTRACT HCI scholarship is increasingly concerned with the ethical impact of socio-technical systems. Current theoreticallydriven approaches that engage with ethics generally prescribe only abstract approaches by which designers might consider values in the design process. However, there is little guidance on methods that promote value discovery, which might lead to more specific examples of relevant values in specific design contexts. In this paper, we elaborate a method for value discovery, identifying how values impact the designer’s decision making. We demonstrate the use of this method, called Ethicography, in describing value discovery and use throughout the design process. We present analysis of design activity by user experience (UX) design students in two lab protocol conditions, describing specific human values that designers considered for each task, and visualizing the interplay of these values. We identify opportunities for further research, using the Ethicograph method to illustrate value discovery and translation into design solutions."
  },
  "figures": [{
    "caption": "Figure 1: Visualization of value discovery in one session through Ethicography.",
    "captionBoundary": {
      "x1": 145.8070068359375,
      "x2": 466.1800842285156,
      "y1": 357.6563720703125,
      "y2": 363.2959899902344
    },
    "figType": "Figure",
    "imageText": ["“", "“", "Value:", "Automation", "“", "“", "Automate", "some", "of", "these", "things.", "You", "know", "how", "in", "certain", "websites,", "once", "you", "start", "typing", "your", "address,", "it", "completes", "the", "street", "for", "you,", "and", "then", "based", "on", "that", "information,", "it", "completes..", "Idea", "Codes", "Pe", "Pe", "Ps", "IBSi", "Si", "Si", "Si", "Value", "Codes", "Pseudonym", "Quote", "#", "Value:", "Right", "to", "Information", "..this", "page,", "we", "can", "talk", "more", "about", "uh,", "recent", "hurricane,", "that", "let", "them", "donate", "or", "know", "that", "this", "is", "kind", "of", "emergency", "that", "we", "really", "looking", "for", "more", "donation.", "60", "65", "68", "69", "71", "1", "273", "45", "8", "9", "67", "82", "7", "9", "90", "3", "4", "7", "100", "1", "5", "93", "7", "111", "2", "5", "87", "122", "8", "963", "4", "130", "5", "864", "140", "21", "3", "7", "8", "154", "7", "160", "7", "171", "73", "4", "5", "6", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "AA", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "AA", "A", "A", "A", "A", "AA", "B", "B", "A", "ABB", "B", "BC", "C", "C", "C", "A", "C", "C", "C", "A", "A", "ACACC", "C", "C", "C"],
    "name": "1",
    "page": 4,
    "regionBoundary": {
      "x1": 53.0,
      "x2": 559.0,
      "y1": 100.0,
      "y2": 344.0
    }
  }],
  "sections": [{
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0487060546875,
        "y1": 466.0295715332031,
        "y2": 484.8689880371094
      },
      "text": "•Human-centered computing→ Empirical studies in interaction design; Empirical studies in HCI ."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 128.51052856445312,
        "y1": 451.5438537597656,
        "y2": 457.9700012207031
      },
      "text": "CCS CONCEPTS"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.798004150390625,
        "x2": 235.2740478515625,
        "y1": 515.8505249023438,
        "y2": 522.7349853515625
      },
      "text": "ethics; values; value discovery; ethicography"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.798004150390625,
        "x2": 111.39410400390625,
        "y1": 501.3648376464844,
        "y2": 507.7909851074219
      },
      "text": "KEYWORDS"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.54595947265625,
        "y1": 546.8424682617188,
        "y2": 563.9970092773438
      },
      "text": "Shruthi Sai Chivukula, Colin M. Gray, and Jason A. Brier. 2019. Analyzing Value Discovery in Design Decisions Through Ethicography."
    }, {
      "page": 0,
      "region": {
        "x1": 53.24800109863281,
        "x2": 295.0179748535156,
        "y1": 585.2767333984375,
        "y2": 712.3289794921875
      },
      "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than the author(s) must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. CHI 2019, May 4–9, 2019, Glasgow, Scotland UK © 2019 Copyright held by the owner/author(s). Publication rights licensed to ACM. ACM ISBN 978-1-4503-5970-2/19/05. . . $15.00 https://doi.org/10.1145/3290605.3300307"
    }, {
      "page": 0,
      "region": {
        "x1": 317.69500732421875,
        "x2": 559.0849609375,
        "y1": 210.67051696777344,
        "y2": 238.78399658203125
      },
      "text": "In CHI Conference on Human Factors in Computing Systems Proceedings (CHI 2019), May 4–9, 2019, Glasgow, Scotland UK. ACM, New York, NY, USA, 12 pages. https://doi.org/10.1145/3290605.3300307"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.46600341796875,
        "x2": 151.32989501953125,
        "y1": 536.4393920898438,
        "y2": 542.0789794921875
      },
      "text": "ACM Reference Format:"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.894287109375,
        "y1": 275.0585632324219,
        "y2": 377.5840148925781
      },
      "text": "The HCI community has committed to ethical design and research practices, and scholars and designers are increasingly engaged in describing what ethical considerations should safeguard these practices (e.g.,[3, 6, 9, 13] ). Scholarship from HCI and STS has engaged with the content of ethics that should be considered, encompassing both methodological contributions such as value-sensitive design (VSD) [15], values at play [10], and value levers [32], and a broader commitment to researcher engagement (e.g., [33])."
    }, {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.895751953125,
        "y1": 382.6545715332031,
        "y2": 580.822021484375
      },
      "text": "However, few of these methods or approaches provide insight into design activity by describing particular and situated value-related commitments from the designer’s perspective. Prominent methods such as VSD and value levers focus on and advocate for the application of values throughout the design process, but these methods primarily approach the foregrounding of values in design and research through either a defined set of steps (e.g., VSD), or theoretically-dense approaches such as critical design [2], which have encountered difficulty in their adoption in widespread design practice. Despite the merits of all of these approaches, these existing frameworks generally fail to address value discovery and deliberation in a situated, practice-led framing. These existing methods and approaches provide a substantial foundation for us to build methods to more richly describe the interplay of values in design conceptualization, and encourage value discovery throughout the design process."
    }, {
      "page": 0,
      "region": {
        "x1": 317.70599365234375,
        "x2": 559.8994140625,
        "y1": 585.8925170898438,
        "y2": 712.3289794921875
      },
      "text": "In this study, we explore methodological issues relating to value identification and awareness, building upon previous value-focused methods. To demonstrate the value complexity of design activity, we describe collaborative interactions among UX students in two protocol studies as they sought to solve an ethically nuanced task, building upon previous published pilot work [7]. We then analyze these interactions through a novel method that allows us to map value discovery and activation, demonstrating how design practices and values intersect over time. We use this method and analysis to frame an agenda for future value-focused work."
    }, {
      "page": 0,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 77 Page 1"
    }, {
      "page": 1,
      "region": {
        "x1": 53.54899978637695,
        "x2": 295.74212646484375,
        "y1": 95.73056030273438,
        "y2": 210.21197509765625
      },
      "text": "Our contribution in this paper is three-fold. First, we introduce a novel method for documenting value discovery and interaction, creating a precise conceptual and methodological vocabulary. Second, we provide a rich description of how designers collaboratively operationalize and interact with values in design decisions, increasing knowledge of how values are performed in design activity. Third, we illustrate and exemplify how abstract values are represented as concrete design decisions, providing a link between prior philosophical and practice-focused work on values and ethics."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.95501708984375,
        "x2": 411.0592346191406,
        "y1": 260.5728759765625,
        "y2": 266.9990234375
      },
      "text": "1 INTRODUCTION"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 53.7979736328125,
        "x2": 295.7411193847656,
        "y1": 263.1035461425781,
        "y2": 377.5840148925781
      },
      "text": "Numerous ethics and value-focused approaches have been proposed to address issues relating to designer and societal responsibility. Many of these methods have originated in various scholarly traditions adjacent to design, but few have successfully addressed the on-the-ground concerns and stresses of everyday practice. In this paper, our goal is to address values and ethics in a practice-focused way, acknowledging the inherent design complexity [36] that practitioners must engage inwhen addressing ill-structured problemswith uncertain future impacts."
    }, {
      "page": 1,
      "region": {
        "x1": 53.499141693115234,
        "x2": 295.7427673339844,
        "y1": 382.6545715332031,
        "y2": 473.2250061035156
      },
      "text": "Previous work that has relevance to ethical awareness and engagement and the present study includes: philosophical work that privileges abstractions of ethical outcomes (e.g., [19, 28]), methodological work that proposes actionable frameworks for engaging in ethics and values (e.g., [3, 14, 15, 27, 32]), and practitioner-driven work that focuses on the roles and responsibilities of designers and other collaborators (e.g., [20, 29, 38])."
    }, {
      "page": 1,
      "region": {
        "x1": 53.42964172363281,
        "x2": 295.7410583496094,
        "y1": 478.29656982421875,
        "y2": 712.3289794921875
      },
      "text": "In the context of this paper, we build upon existing valuerelated approaches, while prioritizing practitioner-oriented perspectives on the situational quality of ethics and values. For example, Nodder [29] exemplifies the complexity of pragmatist ethics, with a practitioner focus, relying on real-world examples and narration from the perspective of psychology, marketing (business), and respective design concepts to argue for valuing users’ agency. Gray et al. [20] have also described practice-led examples of dark patterns that have been shared and discussed among UX practitioners, pointing towards a situated ethical conversation that is already in place. Thus, when characterizing these practice-focused efforts, we contend that designers are always already engaging in ethical decision making, and desire additional methods and frameworks to more fully engage in this complexity. This is resonant with van Wynesberghe and Robbins’ [39] proposal for the integration of ethics into everyday design practices— an “ethicist as designer” that engages designers in ethical decision making practices that include: uncovering relevant values, scrutinizing these values, and working towards the"
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8970336914062,
        "y1": 95.73056030273438,
        "y2": 174.34600830078125
      },
      "text": "translation of values into technical content. There is also important overlap with interest in persuasive design, particularly in regard to the ethical responsibilities of persuading others. While Fogg’s [11, 12] work provides a space to consider approaches to persuasion, others such as Berdichevsky et al. [4] have challenged the ethical positioning of designing for persuasion, reconsidering the agency of users."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 181.10520935058594,
        "y1": 233.67384338378906,
        "y2": 255.0439453125
      },
      "text": "2 RELATEDWORK Engaging in Ethical Practice"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8980712890625,
        "y1": 215.28256225585938,
        "y2": 449.31500244140625
      },
      "text": "Several related methods have been proposed in the design, STS, and HCI literature that help to engage designers, researchers, and technologists in value discovery and implementation. Value-Sensitive Design (VSD) is perhaps the most comprehensively-developed framework with the longest intellectual history, and seeks to address the question of values in design practice through “a theoretically grounded approach to the design of technology that accounts for human values in a principled and comprehensive manner throughout the design process” [15]. VSD has faced notable critique with regards to its deficiencies in guiding value classification activities, appropriate selection of empirical instruments, and ordering of the design process [27]. In addition, VSD has also been criticized for not attending to indeterminate outcomes (e.g., the “positivist problem”; [1]), which may require additional approaches that address the identification of present and future consequences. Despite these known gaps, continuous interest is shown in discoveringmethods of building value-discovery and subsequent action into the design process in both CHI and design contexts (e.g., [5, 21, 23, 25])."
    }, {
      "page": 1,
      "region": {
        "x1": 317.6260070800781,
        "x2": 559.8944702148438,
        "y1": 454.38555908203125,
        "y2": 664.5079956054688
      },
      "text": "Other frameworks for ethical design exist beyond VSD, including approaches such as Values at Play [10], Value Levers [32, 34, 35], and In-Action Ethics [14]. Values at Play focuses on the practice of game development, and is intended to encourage the inclusion of ethical considerations by designers of digital games through the design lifecycle, including the discovery of project-relevant values early on in the process, the translation of said values in to concrete design decisions, and finally the verification of any final design ensuring the appropriate embodiments of the identified values. Whereas Values at Play seeks to address the entire lifecycle of values in design (similar to VSD), Value Levers focuses on the activation and implementation of insights driven by values. Shilton [32] proposes potential roles that certain activities might play in the facilitation of conversations regarding values, which can then be addressed as design criteria, building upon the existing conversation of the existence of VSD-related methods, by addressing the question of their use in practice [34]."
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.2109985351562,
        "y1": 669.5785522460938,
        "y2": 712.3289794921875
      },
      "text": "In parallel with these longer-term efforts to engage ethics in design, other scholars have extended portions of these frameworks to different ends. Benford et al. [3] have explored how VSD approaches might be constructively extended as"
    }, {
      "page": 1,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 77 Page 2"
    }, {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.74151611328125,
        "y1": 95.73056030273438,
        "y2": 258.031982421875
      },
      "text": "part of HCI’s turn to the cultural through conceptual applications such as transgression, boundaries, consent, withdrawal, data, and integrity. Frauenberger et al. [14] have also done recent work in this space, challenging static and formalized notions of ethics in HCI. Diverging from the practice focus of Shilton and colleagues, Frauenberger et al. identify mechanisms for raising ethical issues in more situated and exploratory ways within the HCI research tradition. Finally, Friedman et al. [16] have offered a list of ethically-focused human values, such as ownership, privacy, accountability, freedom from bias, trust, autonomy, usability, informed consent, and human welfare. These potential values offer an important starting point for future empirical work on the ethical nature of design practice."
    }, {
      "page": 2,
      "region": {
        "x1": 53.79764175415039,
        "x2": 295.74066162109375,
        "y1": 263.1035461425781,
        "y2": 353.67401123046875
      },
      "text": "Currently, these methods provide designers support for dealing with values in design in a process orientation, but there are noticeable gaps in support for value discovery, guidelines for understanding selection of relevant values, exploration and deconstruction of specific values, and evidence of how the values have been successfully translated into design. By taking a practice-led approach, we intend to create a new methodological space to address these barriers."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 519.137939453125,
        "y1": 200.79689025878906,
        "y2": 207.2230224609375
      },
      "text": "Value Sensitive Design and Related Methods"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.14794921875,
        "y1": 389.8085632324219,
        "y2": 599.9310302734375
      },
      "text": "To describe and analyze design activity in sufficient detail to reveal designers’ value discovery and interaction, we used a lab protocol study approach to document the discussions and design activities of student designers. Lab protocols are a common approach to studying design cognition in the psychology and design studies literature (e.g., [17]), allowing for more detailed and controlled evaluation of design activity than might be possible in a professional setting, encouraging identification of cognitive moves that may be resonant with UX practice. As a limitation to this approach, we agree that numerous factors that occur in practice due to organizational, business and product concerns may mediate ethical decision making, and we plan to address this in future work. We engaged eight groups of three students each in one of two design tasks during a one-hour protocol session, and then analyzed these data to describe participants’ explicit and implicit engagement with values. We answer the following research questions:"
    }, {
      "page": 2,
      "region": {
        "x1": 63.6510009765625,
        "x2": 295.1199951171875,
        "y1": 614.6045532226562,
        "y2": 657.35498046875
      },
      "text": "(1) What were the user values considered in participants’ design decisions, and why were they considered? (2) How did the proposed design solutions operationalize values in relation to the design task?"
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 148.04795837402344,
        "y1": 375.3228454589844,
        "y2": 381.7489929199219
      },
      "text": "3 OUR APPROACH"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.7410583496094,
        "y1": 693.4895629882812,
        "y2": 712.3289794921875
      },
      "text": "In total, we conducted eight sessions, four for each for design task, for a total of twenty-four participants. Ten of these"
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8952026367188,
        "y1": 95.73056030273438,
        "y2": 234.12200927734375
      },
      "text": "participants identified as male and fourteen identified as female, consistent with enrollment in our undergraduate and graduate UX programs. We recruited three participants for each protocol session, drawing on existing undergraduate and graduate students at our institution with a background in UX or interaction design. To participate, students must have had at least one semester of UX or interaction design education and some level of professional work experience in a UX-focused position as an employee or intern. We formed groups of that represented multiple skills or educational levels, encouraging a range of potential social and collaborative design interactions during the session."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 108.18601989746094,
        "y1": 679.0038452148438,
        "y2": 685.4299926757812
      },
      "text": "Participants"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.5867614746094,
        "x2": 559.8980102539062,
        "y1": 263.1035461425781,
        "y2": 461.2699890136719
      },
      "text": "Each lab protocol was one hour in duration, including the introduction of an authentic design task that required participants to navigate an ethically ambiguous space (5 mins); working on the design task (45 mins); and the presentation of design outcomes with follow-up questions from the researchers (10 mins). Both protocol tasks had the same structure, but varied in the specific design prompt that participants were asked to address. In the first protocol (LP1), we provided an altruistic task to shape end users’ behavior for a good cause, asking the participants to redesign a donation experience for a Houston-based charity following the aftermath of Hurricane Harvey. For the second task (LP2), we provided a more capitalist-oriented task that was less ethically nuanced, asking the participants to redesign a shopping experience for an online drugstore to manipulate end users into purchasing store brand pharmaceuticals more frequently."
    }, {
      "page": 2,
      "region": {
        "x1": 316.8290100097656,
        "x2": 559.8963012695312,
        "y1": 472.3185729980469,
        "y2": 658.531005859375
      },
      "text": "LP1: Donations for Charity. In LP1, participants were asked to maximize conversion rates for a Houston-based charity “by any means necessary,” culminating in the generation of one or more appropriate solutions. The participants were provided with wireframes of a charity website that consisted of a landing page and a donation form. Prior to each session, one of the participants was given a set of interaction design principles [30] and persuasive principles [11]. These principles primed the participant with examples of manipulation techniques, written in neutral language as: persistence, reduction, suggestion, prominence, tunneling and exclusivity. We anticipated the explicit or implicit potential use of this material in relation to the participant’s decision-making processes, and that the activation of these principles may have served as a trigger for other participants to implicitly utilize such practices themselves."
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8907470703125,
        "y1": 669.5785522460938,
        "y2": 712.3289794921875
      },
      "text": "LP2: Manipulative E-Commerce. In LP2, participants were asked to redesign the shopping experience of an online pharmacy website using language that explicitly asked the design students to manipulate or deceive the end user. They were"
    }, {
      "page": 2,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 77 Page 3"
    }, {
      "page": 3,
      "region": {
        "x1": 53.54912185668945,
        "x2": 295.7410888671875,
        "y1": 95.73056030273438,
        "y2": 234.12200927734375
      },
      "text": "asked to “manipulate users’ interactions” so that the end user buys and recommends store-brand medicines and products over other name-brand or generic competitors. The wireframes of a drugstore website’s landing page, product section page and check-out page were provided. In this study, all participants were provided with the priming material mentioned above along with task sheets (which included the full protocol design task and wireframes) while they were addressing the design task. We made the principles more visible and available to all participants, since the priming of only one participant in LP1 did not seem to impact the design activities in a substantial way."
    }, {
      "page": 3,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7403259277344,
        "y1": 239.19259643554688,
        "y2": 377.5840148925781
      },
      "text": "In both protocol tasks, participants were encouraged to alter or replace any of the elements on the wireframes provided to them to reach the stated goal. As participants worked on the design task, they were asked to generate one or more appropriate solutions using typical UX representations (e.g., sketches, wireframes, user task flows). They were provided with design materials such as whiteboard markers, sketching tools, and paper. At the conclusion of the design portion of the protocol, participants were asked to present their solutions to the researchers, explaining their decisions and describing how they addressed competing stakeholder and user values."
    }, {
      "page": 3,
      "region": {
        "x1": 53.54907989501953,
        "x2": 295.7386779785156,
        "y1": 388.632568359375,
        "y2": 527.0239868164062
      },
      "text": "Data Collection. While engaging in the design task, the participants were asked to think out loud [8] as they collaborated, with prompts from researchers if the participants were silent for more than 30 seconds. All sessions were audio and video recordedwith two cameras, allowing for analysis of materials on the table, as well as facial expressions and gestures of the participants. The audio of the session was transcribed and cleaned to allow for detailed analysis of speech acts, paralinguistic qualities, and design artifacts, with researcher memos added to the transcriptions based on field notes from each session. The sketches created by the participants were collected and scanned to document their solutions."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 409.58477783203125,
        "y1": 248.6178741455078,
        "y2": 255.04400634765625
      },
      "text": "Lab Protocol Design"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 53.31999969482422,
        "x2": 295.73382568359375,
        "y1": 556.0045776367188,
        "y2": 658.531005859375
      },
      "text": "Weused an interaction analysis approach [24] to identify connections between speech acts, artifacts, and paralinguistic qualities. Initial sequence analyses of these interactions facilitated our awareness of how teams collaborated, the methods they used, and the types of design solutions they produced. However, interaction analysis did not allow us to directly identify how participants engaged values in their design work. To address this gap, we propose a method to combine these two methodological approaches called Ethicography."
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0499572753906,
        "y1": 669.5785522460938,
        "y2": 712.3289794921875
      },
      "text": "Ethicography, a Method of Value Discovery. We built this method upon critical reconstruction techniques [22] and linkography (e.g., [18]) to identify where values were first identified in the transcripts, and how these values impacted"
    }, {
      "page": 3,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.8961791992188,
        "y1": 95.73056030273438,
        "y2": 258.031982421875
      },
      "text": "later design decisions. Critical meaning reconstruction [22] allows the researcher to identify howmeaning is constructed on both foregrounded and backgrounded levels, simultaneously engaging subjective, objective, and normative commitments inscribed into the speech or design acts. Linkography [18] provides a means of visualizing the iterative nature of design activity and decision-making, describing how design decisions are built upon knowledge that is continuously being foregrounded and backgrounded by the design team. This method helped us in the identification of occurrences of value-laden decisions over time across a design process, visualizing the emergence of design decisions that have an ethical valence, which then facilitated further analysis of value discovery and the impact of values on design outcomes."
    }, {
      "page": 3,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.898193359375,
        "y1": 275.0585632324219,
        "y2": 712.3289794921875
      },
      "text": "Ethicograph Analysis. In this section we explain the steps to create an ethicograph illustrated in Figure1. First, we unitized the speech acts and analyzed the communication structure of the dialogues of the participants. Second, we inductively identified and applied a “value code” to each speech act in the transcript. We define a value code as the likely intent of the speech act that would represent the participant’s attitude towards one or more values. These attitudes are differentiated through color codes (second layer in Figure 1) as being more value-centered or manipulative, based on meaning reconstruction and the decision making context. In this paper, we focus only on describing the values that the segment exemplifies. To do this, we performed a bottom-up thematic analysis, attributing particular value codes that we identified to specific values from the literature. The values were adapted a priori from Friedman [16], including types such as: ownership, privacy, accountability,freedom from bias, trust, autonomy, usability, informed consent, and human welfare. We attempted to identify the value that emerged as most salient in the conversation, while recognizing that there is always “play of values” [21] that may be documented on the part of the designer. Third, we attributed an idea code to the speech act (top-most layer in Figure 1), building on common design activities described in previous design cognition studies, identifying the relationship of the design decision to a problem, solution or decision rationale. These codes are marked as the layers over the links created among the speech acts of the participants, and were iteratively determined by performing meaning reconstruction on key segments to identify how implicit values might inform explicit design decisions. These links aided us in evaluating the relationships between the idea codes and value codes to identify connections between value interaction and design activities. From the ethicographs created for each session, the value codes layer aided us in operationalizing and interacting with values relationships implicit in all design decisions, increasing our knowledge of how values are performed in design"
    }, {
      "page": 3,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 77 Page 4"
    }, {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.2399597167969,
        "y1": 384.6065673828125,
        "y2": 439.3110046386719
      },
      "text": "activity. Analysis of the relationships of values to each other or over time are possible using the ethicograph method, but are outside of the scope of this paper. Figure 1 illustrates one session through an ethicograph and specific examples of speech acts to represent how these layers are formed."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 115.63835144042969,
        "y1": 541.5188598632812,
        "y2": 547.9450073242188
      },
      "text": "Data Analysis"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 53.54907989501953,
        "x2": 295.7367858886719,
        "y1": 473.2945556640625,
        "y2": 599.72998046875
      },
      "text": "In this section, we will describe the results from our analysis of each protocol separately. Each subsection of protocol results is organized by the values that participants implicitly or explicitly used to structure their work, and we rely upon the chain of decision-making documented in our ethicograph analysis to describe the interplay of multiple values and how they are inscribed in the design solutions. Each design task foregrounded different potential values, and so not all of the values proposed by Friedman [16] emerged equally (or at all) in each protocol task. A synthesis of findings across both protocol tasks is provided in the discussion section."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 111.46385192871094,
        "y1": 458.8088684082031,
        "y2": 465.2350158691406
      },
      "text": "4 RESULTS"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 53.31999969482422,
        "x2": 295.1516418457031,
        "y1": 633.7135620117188,
        "y2": 712.3289794921875
      },
      "text": "While solving the given task to increase the conversion rate by “any means necessary,” we identified the following user values that were either explicitly or implicitly considered by the designers: right to information, usability, security, flexibility, automation, optimization, trust, and aesthetics. The critical reconstructive analysis made possible through the ethicography method allowed us to identify these values,"
    }, {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8991088867188,
        "y1": 384.6065673828125,
        "y2": 427.3559875488281
      },
      "text": "and assess their impact on the design situation. The following subsections will explain how different protocol teams concretized and operationalized these values in relation to specific design solutions."
    }, {
      "page": 4,
      "region": {
        "x1": 317.1579895019531,
        "x2": 559.8980102539062,
        "y1": 442.4305725097656,
        "y2": 652.552978515625
      },
      "text": "Right to Information. Participants in multiple teams identified that there was lack of information on the existing page, and re-design was required to present the information on the website that could attract donors and maximize the conversion rate. As a result, this user value was considered the most essential by participants in maximizing the conversion rate. This value was translated by the participants into various aspects of the final solutions, including: information graphics, statistics, descriptive text, user stories, and images. Participants in groups 1,2 & 4 reflected this value in ‘progress bars’ to show a real-time increase with the amount a donor donates, reaffirming their act of charity in a social manner. Participants in group 4 wanted to specifically include information on the site that described how the amount donated was used by the foundation to implement changes in “real-life.” This example shows how one value (right to information) was used to impact or provide an opportunity for another user value (trust) while making design decisions."
    }, {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.890625,
        "y1": 657.62353515625,
        "y2": 712.3289794921875
      },
      "text": "Another common form of information that participants manipulated was visual imagery. Participants frequently discussed how images could “toy” or play with user’s emotions [20], thereby encouraging users to donate to the charity. Participants in Groups 1 and 2 also used images to humanize the"
    }, {
      "page": 4,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 77 Page 5"
    }, {
      "page": 5,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.7410888671875,
        "y1": 95.73056030273438,
        "y2": 329.76300048828125
      },
      "text": "charity, presenting stories of destruction and emphasizing the need to increase donations to fulfill the organization’s mission. In parallel, participants in Group 2 also generated a solution that presented stories from the victims to engage the donors and emotionally convince them to donate to the charity. Participants in Group 4 similarly used “real user stories” as testimonials on the website to indirectly present the genuineness need of the organization, thus laying the groundwork for donations. “User stories” were used in different ways to shape the user’s experience, either placed before the donation took place to encourage users to donate, or as a substantiation once the donation had already occurred. These examples demonstrate the desire of the majority of participants to treat information as an “incentive” that could help to build the trust of the donor, thus resulting in an increased conversion rate. Other solutions that were vaguely discussed included the use of additional descriptive text on the website that present more details about the organization and the need for donations, including a more upfront presentation of news and events."
    }, {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.74102783203125,
        "y1": 334.8345642089844,
        "y2": 592.7769775390625
      },
      "text": "Design activities shaped by this value generally resulted in positive, user-centered outcomes, although several of these design solutions also expressed a darker form of persuasion or gentle manipulation for users to donate to the charity. For example, a participant in Group 1 mentioned how the progress bar can alert the user to the state of emergency, thereby guilting users to donate more money. This group set the stage for this “guilting” behavior on the landing page to persuade users to donate more money by providing information about the average amount donated. They traded-off the ethics of presenting correct information with inflating the average donation, faking the amount to attract a higher average donation. Participants in Group 2 created a similar progress bar solution, but their stated intention was only to provide real-world information about the impact of the charity on the Houston area. However, this group decided to position the progress bar at the bottom of the website, with one participant mentioning ”because I think that could like if they’ve already met their goal, people would be like, oh, I’m not going to donate now.” This design decision could thereby trick users in donating even if the organization had already reached their goal."
    }, {
      "page": 5,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.7410888671875,
        "y1": 609.8025512695312,
        "y2": 712.3289794921875
      },
      "text": "Usability. The value of usability refers to creating a system that encourages users to successfully complete specific tasks. This value is recognized as a foundational principle of usercentered interaction in HCI. In our context, this value was reflected in the design decisions surrounding issues of visibility, accessibility, ease of use (automation), user control, aesthetics and efficiency. The major problem identified by all the groups was the poor visibility of the “donate” link on the existing landing page. All participants proposed a"
    }, {
      "page": 5,
      "region": {
        "x1": 316.8290100097656,
        "x2": 559.8947143554688,
        "y1": 95.73056030273438,
        "y2": 269.98797607421875
      },
      "text": "similar solution to address this issue, designing a more visible button to highlight the “call for action,” as this was the most essential function to reach the donation goal. Group 2 participants positioned the button on the top navigation bar for easy accessibility at all times, while Groups 1 and 2 were wary of mentioning the “donate” button too many times on the website, as this could be construed as too needy, potentially interrupting other parts of the user experience. Group 1 discarded an initial idea of using persuasive terminology (e.g., “make an impact”) for the button, but decided to keep it direct for the donor with a single button that said “donate.” Additionally, participants were concerned about how to properly balance the values of right to information along with usability, creating links to easily access all the information regarding donations, news, and events."
    }, {
      "page": 5,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.894775390625,
        "y1": 275.0585632324219,
        "y2": 580.822021484375
      },
      "text": "On the donation form, all the participants identified the length and complexity of the form, which created a perception that it would take a lot of time to fill in the requested details. Group 1 considered re-designing the donation form specifically to maximize donations, unlike the other groups who considered re-designing the donation form only to make it more usable and aesthetically pleasing. One value prominently seen in the solutions related to this problem was automation: filling in data from other sources to increase ease of use. This was mentioned to be a standard principle of good form design, and is essential to creating usable form experiences. One of the designers said: “ Another thing that, as UX people, we may or may not discuss, [. . . ] code behind the form actually [. . . ] auto save[s] [. . . ] all of your information. Once you start typing your name, it can actually auto fill all of this information, but it only does that if you use standard code.” Considering this value, participants mentioned that it would save the user’s time. When a participant in Group 1 mentioned this value, they knew that the form experience could only be made so efficient, but that the user could be made to feel it is shorter: “[. . . ] the shorter it seems to the people, like okay, I could get through this process faster. The more likely they are to actually complete the task. If they, you know, they perceive that the task is going to take longer, which it’s not, it’s still going to take the same amount of time, but they think that scrolling down further.”"
    }, {
      "page": 5,
      "region": {
        "x1": 317.6059875488281,
        "x2": 559.8980102539062,
        "y1": 585.8925170898438,
        "y2": 712.3289794921875
      },
      "text": "Other design decisions relating to usability included the provision of breadcrumb navigation for the website to encourage greater user control, redesign of the information architecture, using a one-page approach with greater visual consistency, and making the “help” button more accessible by moving it from the footer. Groups 1 and 4 briefly discussed the heuristics of the navigation bar and form-like graphical elements on the landing page, but discontinued the discussion to prioritize the generation of more expansive solutions. Additionally, aesthetics is mostly considered while creating the designs. The designers of group 3 used this as their main"
    }, {
      "page": 5,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 77 Page 6"
    }, {
      "page": 6,
      "region": {
        "x1": 53.54899978637695,
        "x2": 295.7410888671875,
        "y1": 95.73056030273438,
        "y2": 162.3909912109375
      },
      "text": "value to re-design the existing features of the website. Their main intention was to build trust on the website with aesthetically pleasing website. All the designers did mention on getting minimalist design features from their inspirations of current websites and worked towards having a consistent visual language."
    }, {
      "page": 6,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7411193847656,
        "y1": 179.41659545898438,
        "y2": 449.3149719238281
      },
      "text": "Flexibility. The value of flexibility indicates the ability of users to go about a task in multiple ways. Participants in Group 1 group identified no freedom of choice for the donors in selecting donation amounts and payment methods. So the designers incorporated flexible entry of donation amounts by giving an empty box with hint text. On the other hand, participants in Group 3 had a similar solution, providing a fixed minimum amount that was set by the designers, but still allowing the donor to have control over the amount above the minimum. A Group 1 participant also mentioned the use of a concept of “cranking” to encouraged increased amounts of donation, but this idea was not considered by the group, as participants felt that it would overly control the user’s decisions. Other participants in Group 1 provided users with a flexible choice of payment methods, such as PayPal and Venmo, encouraging donors to donate by increasing payment options. This increased set of options was also seen as a potential solution to reduce the form size and remove form fields. For example, if a user chose PayPal, they would not need to provide billing information that PayPal would already have on file. This design decision clearly underscores how one value supported another to improve the user experience and support specific design decisions."
    }, {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.74102783203125,
        "y1": 466.340576171875,
        "y2": 712.3289794921875
      },
      "text": "Security. While providing the multiple modes of payments, another main user value considered by participants was security. One participant described this concern, noting: “[. . . ] some people don’t want their credit cards to be on file, so there’s, you know, privacy concern also, because the thing is uh, organizations like PayPal, Venmo, whatever, they actually provide you with certain kind of uh fraud protections, so if all of this does end up being a whole fake thing.” The user value of considering users’ privacy and the security of the system occurred only with Group 1, perhaps unsurprising, given the focus on outcomes (increasing donation conversion) rather than the resilience of the system. We do note an interplay of values in Group 1, however, that links usability, flexibility, and security. The remaining groups chose to focus on the usability and aesthetic qualities of the donation form over security or privacy, mentioning that the “form should be as per present templates” that users experience from all the e-commerce websites. This redirection may also reveal a hidden assumption that using design patterns from other contexts ensures privacy or security, obviating the team of the need attending to these values directly."
    }, {
      "page": 6,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8934326171875,
        "y1": 95.73056030273438,
        "y2": 258.031982421875
      },
      "text": "Optimization. The value of optimization deals with the presentation of information from a technical perspective. Only Group 1 addressed design decisions that were shaped by this value, focusing on issues relating to video streaming on the website such as data-cap restrictions or technical implementation for users. To resolve this tension, the group replaced the video with an image collage. Most of the groups used this solution of presenting visual references and images, but in the case of these other groups, it related more to the value of right to information than optimization. This example demonstrates how different values can be used by a design team, that ultimately translate into the same design outcome; the individual designer and her judgment are thus responsible for generatively linking values to potential solutions."
    }, {
      "page": 6,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.8981323242188,
        "y1": 275.516845703125,
        "y2": 488.16900634765625
      },
      "text": "LP2: “This is What We Get Paid To Do” In LP2, designers were asked to “manipulate users” to increase the sales of the store brand on a drugstore website. While addressing this design task, participants identified a wide range of different solutions for the landing page, product detail page, and checkout page. The most commonly discussed human values that were inscribed into these solutions included: right to information, human welfare, usability, and ownership. As compared to the first protocol task, the application of user-focused values was much less frequent, as the task given was to trick users in a direct, rather than veiled manner. We anticipated, based on the results of LP1, that the participants would be less likely to engage user-focused values in their decision making to generate solutions, instead relying on dark patterns or persuasive techniques that reduced the agency of the user. The following subsections will explore how the different teams operationalized, and in many cases, subverted values in their design solutions."
    }, {
      "page": 6,
      "region": {
        "x1": 317.5870056152344,
        "x2": 562.6929931640625,
        "y1": 502.2065734863281,
        "y2": 712.3289794921875
      },
      "text": "Right to Information. The majority of participants identified that store brand product informationwas notwell-represented on the landing page and product detail page. They targeted this problem by exposing more information about the store brand to customers by providing solutions such as comparison of product prices, equal coverage of all brands on the web page, mentioning the amount saved by buying the store brand product,quick descriptions of store brand products and presenting offers and advertisements. Groups 1 and 2 represented the right to information value by giving visibility to all the brands on one page through visual artifacts or brand promotions. Group 1 participants anticipated that this visibility would increase the familiarity and popularity of the brands to the customers, decreasing reliance on the brand details. Group 2 participants used prominence from the list of persuasive principles to highlight the store brand specifically upfront in all the sections of the website. They tried to incorporate information about the store brand, with"
    }, {
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 77 Page 7"
    }, {
      "page": 7,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.73870849609375,
        "y1": 95.73056030273438,
        "y2": 281.9429931640625
      },
      "text": "one participant questioning: ““. . .maybe there should be [a store brand] in more than just this [health] category.” This idea of providing information was limited to the store brand and tweaked to “. . . remove promotion of other [brand-name] products.” Participants in this group tried to separate the information about the store brand on the landing page of the website by making it difficult to access information of other brands. This example demonstrates how the same value was leveraged as a form of trade off to reach the goal of increasing sales. The group made a decision to not present “actual competitors to [the store brand], in any product line,” explicitly noting that “[store brands] should not be included in the feature deals”. Group 3 incorporated a similar feature, presenting the deals in the form of coupons that could only be used for the store brand, with text that claimed: “[store brand] health products will help you save money every day.”"
    }, {
      "page": 7,
      "region": {
        "x1": 53.429779052734375,
        "x2": 295.7410888671875,
        "y1": 287.0135803222656,
        "y2": 437.3599853515625
      },
      "text": "While these solutions were intended to indirectly divert the customers towards store brand products, Group 3 participants also used this value to alter the way information was presented, encouraging users to read it more quickly with a clearer description. They suggested that this information should provide clear, short and bullet point descriptions, demonstrating why a certain product was better than a competing product. This design decision is connected to the human value of ownership, which puts the decision making in the hands of the customer. Group 4 designers provided information in the form of recommendations about what other customers buy highlighting the store brand along with other brands to indirectly nudge the users towards store brand."
    }, {
      "page": 7,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7410583496094,
        "y1": 442.4305725097656,
        "y2": 652.552978515625
      },
      "text": "Group 1 participants used information to create comparisons among the brands to emphasize on the amount of money saved by purchasing the store brand compared to other brands. This was used as a trigger for the customers to make their decisions with this information on which product to buy. Alongside this comparison, they attached offers and advertisements to the store brand, increasing visibility as shown in the above examples. Similarly, Group 3 participants generated this solution with a different style of presenting the information in the last step of the task flow. They created a wire-frame to use a pop-up at the checkout page to provide an option saying ”It looks like you bought this [. . . ] did you know that you can save 20 dollars by switching these to [store brand] products?”. This example relies upon the values of right to information and human welfare (discussed in the next section), demonstrating how the value of usability was traded off to present the information upfront while also purposefully obstructing the flow of the user."
    }, {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.053955078125,
        "y1": 693.4895629882812,
        "y2": 712.3289794921875
      },
      "text": "HumanWelfare. This value addresses concerns that deal with the physical, material, or psychological welfare of the users"
    }, {
      "page": 7,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.89794921875,
        "y1": 95.73056030273438,
        "y2": 413.45001220703125
      },
      "text": "on the website. For the given task, material and psychological welfare was considered as a major factor as participants worked to support their economic interests and the emotional states of users. This value was primarily used in course-correcting their design decisions, ensuring that they were not “annoying” the user with too much information, or making the interface “sketchy” or making it too hard to buy products. For example, participants in Group 1 were concerned about how much it was appropriate to advertise a brand, and how to know when they had gone too far. They were aware that the user should not be annoyed with the site: “As a person,you just go there [website], I think that would be like, “Oh, [the store brand] is pushing their brand on me and stuff.” This value was observed in support of “right to information” in numerous cases, but was primarily violated through the emotional experience that the revised materials evoked. For example, Group 2 participants discussed how to present promotions of the store brand by using an user story of an healthy elderly person to have a “striking advertisement” to build a “strong connection.” Group 2 participants also tried to use the “exclusivity” persuasive principle on the checkout page by implementing a visual of a clock ticking, assuring themselves: “It will give [the user] some pressure.” Group 3 had a similar solution to present sales for limited time to urge the users to buy specific products, but with some remorse; one participant mentioned “I feel so dirty,” but “We get paid the big bucks for this.”"
    }, {
      "page": 7,
      "region": {
        "x1": 316.8290100097656,
        "x2": 559.8992309570312,
        "y1": 418.52056884765625,
        "y2": 580.822021484375
      },
      "text": "The participants in Groups 1 and 2 supported the value of “Right to Information” in conjunction with user welfare by targeting users’ economic status. Solutions based on this value included explicitly visualizing savings and providing “cheap” store brand options on the check-out page and in feature deals. Group 1 participants also identified a solution that provided an artificial projection of sales of certain products, but later discarded this concept, worried that it could annoy users and that they “[didn’t] want to manipulate.” Group 2 and 3 participants generated solutions to make it more difficult to buy the products of the competitor brands of store brand, but they reconsidered this solution when they realized that users might be annoyed, and they “[didn’t] really want to hurt them”."
    }, {
      "page": 7,
      "region": {
        "x1": 317.70599365234375,
        "x2": 559.8934326171875,
        "y1": 597.8475341796875,
        "y2": 712.3289794921875
      },
      "text": "Usability. Participants engagedwith this value as they sought to provide consistency across multiple pages, design interactions that felt “natural,” create filters to navigate through a range of choices, and identify ways to provide less-cluttered interfaces. Group 1 participants provided filters for easy sorting of items on the website based on the brand, while Groups 3 and 4 generated a solution that gave priority to store brand items, pinning them to the top of the list to increase the visibility of the brand name in the filters option list. Participants in Group 2 also increased the visibility of the store"
    }, {
      "page": 7,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 77 Page 8"
    }, {
      "page": 8,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7410888671875,
        "y1": 95.73056030273438,
        "y2": 198.25701904296875
      },
      "text": "brand on the landing page, with the goal that: “subconsciously your eyes are just drawn right away. Like, hierarchy definitely shows . . . people always want to select the biggest thing on the page . . . something’s really small, kind of looks like it’s lower quality or, like, just not the best product for the user.” Similarly, Group 4 participants generated ideas that positioned the store brand at “the center of website, and other products at corner of the website,” violating the principle of consistency with persuasive intent."
    }, {
      "page": 8,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.73822021484375,
        "y1": 203.32754516601562,
        "y2": 401.4939880371094
      },
      "text": "Multiple strategies were used to balance usability and the need to create a persuasive experience, which often identified tensions between these values. A member of Group 1 mentioned that they should be “trying to make the process of checkout more ‘natural’,” while Group 2 participants used reduction and tunneling effects to make it difficult to buy off brand products. Participants in Group 2 achieved their goal by making it easy to buy store brand products through oneclick checkout, while introducing a longer task flow with a login process if the user wished to buy brand name products. This group anticipated making users wanting to create an account to buy one product on the website would lead them to buy the store brand which was much easier to achieve. This is another example that demonstrates how a value can be leveraged to support the goals of multiple stakeholders, even as it also introduces conflicts among values that impact these stakeholders."
    }, {
      "page": 8,
      "region": {
        "x1": 53.49909973144531,
        "x2": 295.7369384765625,
        "y1": 414.0375671386719,
        "y2": 624.1589965820312
      },
      "text": "Ownership. This value is connected to the values of right to information and human welfare, representing the right of the user to possess an object. This value appeared through tensions between presenting information to manipulate users and making it appear as if the user has ownership to make their own decisions. For instance, participants in Group 1 noted how annoying it could be for users to continuously be advertised to: “It’s like, pushing it on to them rather than letting them decide, uh, if they want to purchase [the store] brand.” This type of value introduction often resulted in participants’ awareness of a design tension, such as the use of ownership as a lever to encourage other functionality that allowed users to make their own decisions, within certain bounds. Group 2 participants suggested a solution which would provide personalized suggestions and prioritized results based on their history, thus providing a sense of ownership when they purchased store brands, and provided longer term incentives for that choice."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 225.2114715576172,
        "y1": 619.2278442382812,
        "y2": 625.6539916992188
      },
      "text": "LP1: Manipulation for a “Good Cause”"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.740966796875,
        "y1": 655.0928344726562,
        "y2": 712.3289794921875
      },
      "text": "Persuasive Intentions in Ethical Engagement Through our analysis of participant interactions in these lab protocol sessions, we have identified the value interplay between user-centered design principles that prioritizes the end user, and persuasive principles that prioritizes the"
    }, {
      "page": 8,
      "region": {
        "x1": 317.70599365234375,
        "x2": 559.8980712890625,
        "y1": 95.73056030273438,
        "y2": 246.0770263671875
      },
      "text": "shareholder. While these tensions are well known and recognized in other contexts of design, the specific moments of interplay—including participants’ recognition of the foregrounded design tensions—provides a new lens into the value-laden processes of design activity. Values were inconsistently engaged by participants, and depending on the task or stage of the design process, participants either obliquely referenced values (particularly those resonant with usercentered design), or foregrounded only the persuasive design task. Perhaps unsurprisingly, the decisions that resulted were often not ethically focused, with participants frequently using the interplay of values to identify opportunities to deepen persuasion rather than user agency [7]."
    }, {
      "page": 8,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8958740234375,
        "y1": 251.14755249023438,
        "y2": 425.4049987792969
      },
      "text": "The design tasks used to structure each protocol were authentic, reflecting common approaches to addressing persuasion in for-profit and non-profit contexts. Thus, it was particularly interesting that there were many instances in which design decisions were leveraged with intentions only to persuade the users towards stakeholder goals. Many of the students that served as participants had value-related training in their design curriculum, which also prompts the question of whether designers—even with the best of intentions— might be turned “evil” through the co-opting of persuasive patterns. This type of subversion is already present in UX practitioners engagement with dark patterns (e.g., [20]), but the value interplay present in these protocols is broader, reflecting problem framing, constraints, balancing of multiple stakeholder needs, and the ethical duty of designers."
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8978271484375,
        "y1": 430.4755554199219,
        "y2": 580.822021484375
      },
      "text": "The foregrounding of values in these design tasks provides opportunities to become more aware of how value discovery occurs, the level of awareness of these values by participants during design activity, and a post-hoc reflection on the values that have been inscribed into the solution. While these issues should ideally be taken up in design and UX education, we also propose the need for additional methods that allow designers to actively discover and engage with values throughout the design process. Findings from the use of the Ethicograph method may prove useful in informing methods that encourage these kinds of awareness, allowing designers to understand how the operationalization of different values may also expose implicate manipulative or “dark” intentions."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 226.90516662597656,
        "y1": 640.1488647460938,
        "y2": 646.5750122070312
      },
      "text": "5 DISCUSSION AND IMPLICATIONS"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.8926391601562,
        "y1": 609.8025512695312,
        "y2": 712.3289794921875
      },
      "text": "Through a cross-case analysis of both protocol tasks, we have seen differences in the conversations of the designers about their value considerations in relation to users and shareholders/stakeholders. In LP1, participants were provided with a non-profit context that involved users who donate and stakeholders that represented a foundation. In this situation, participants had to balance the needs of this one stakeholder and the end users of the site, with the ultimate goal of societal good. In LP2, the design task required the participants"
    }, {
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 77 Page 9"
    }, {
      "page": 9,
      "region": {
        "x1": 53.54899978637695,
        "x2": 295.7410583496094,
        "y1": 95.73056030273438,
        "y2": 222.1669921875
      },
      "text": "to take a position between users and multiple stakeholders, with economic gain disproportionately skewed towards the drugstore shareholders. These two tasks reveal some of the stakeholder values that can productively be assessed in a pragmatist framing [26], and the balancing of multiple competing—and ultimately, irreconcilable—constraints that have real impact on end user experiences and the broader society. This requires designers to take a position in relation to multiple stakeholders, assessing the values that are at play, and identifying the resonance of the designer’s personal values and design character with the design situation."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 535.1983032226562,
        "y1": 595.3168334960938,
        "y2": 601.7429809570312
      },
      "text": "Evaluating Positionality and Stakeholder Values"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 53.31999969482422,
        "x2": 295.7410888671875,
        "y1": 263.1035461425781,
        "y2": 413.45001220703125
      },
      "text": "Different values emerged as useful in each design task depending on a multitude of contextual and situational variables. These cases—in conjunction with the reconstruction that ethicography facilitates—allows deep insight into the value-dense design complexity that pervades design activity. While we have provided descriptions of only two common design tasks in this paper, we need more situated accounts of tasks and design decisions in emerging and increasingly complex design situations. This indicates a shift from traditional systems of professional ethics, which often fixate on consequentialist, deontological, or virtue ethics, towards a pragmatist ethics that values both the designer and her character and the unique complexity of the design situation."
    }, {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.73870849609375,
        "y1": 418.52056884765625,
        "y2": 628.6430053710938
      },
      "text": "What might a system of pragmatist ethics look like, and how might we provide sufficient guidance to designers as they envision potential futures? The results indicated in this study reveal the constant need for value discovery and monitoring throughout the design process. The most frequently used values in one design task were not necessarily salient in the other, and even when similar values were applied, different design solutions were identified by different teams.While existing methods or frameworks such as value-sensitive design do attempt to engage with values, their support of activities such as value discovery and awareness are often contingent on designers’ own reflective ability, rather than a deconstruction of past and present behaviors. The process of engaging with ethicography—revealing generative links between design actions (e.g., idea codes) and manipulation of values (e.g., value codes)—indicates a potential area for methodological expansion, which provides an ideal opportunity for supporting design practitioners in future work."
    }, {
      "page": 9,
      "region": {
        "x1": 53.79764175415039,
        "x2": 295.7406921386719,
        "y1": 633.7135620117188,
        "y2": 712.3289794921875
      },
      "text": "There is also a powerful uptake for design and HCI researchers who engage with ethics and values as one component of design character and responsibility [28]. Rather than proposing ethics as handcuffs or prescriptions, turning towards a pragmatist mode of ethical engagement increases opportunities for designer reflection, engagement with nearand long-term consequences of work, and an enhanced sense"
    }, {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8908081054688,
        "y1": 95.73056030273438,
        "y2": 162.3909912109375
      },
      "text": "of the interconnectedness of values. While this requires repositioning the guarantee of ethically sound work from a code of ethics to the designer herself [19, 28], this also opens up opportunities for an ethical approach driven by situational and personal characteristics such as care [31, 37] rather than only broad and abstract social and economic consequences."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 260.0719909667969,
        "y1": 236.66188049316406,
        "y2": 255.04400634765625
      },
      "text": "Expanding Situated Knowledge of Pragmatist Ethics-in-Use"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.8980102539062,
        "y1": 191.37258911132812,
        "y2": 497.135986328125
      },
      "text": "Our findings regarding the role of values in the practice of UX design suggests multiple areas of future work. First, the Ethicograph method provides a robust means of assessing both value interplay and value relationships over time, which may serve as a useful mechanism for the future study of ethics and values in lab, educational, and practice contexts. While the lab protocol method does not allow for detailed study of numerous factors (e.g., organizational, personal) that impact value discovery and use, naturalistic studies may be productively used to build upon our findings. Expanding this mode of analysis, and using these findings to inform design methods that engage with the pragmatist tradition may support a more ethically-aware design practice. Second, the manipulative design solutions offered by participants underscores the need for improvements in UX and HCI pedagogy to inculcate an ethical character in students that prepares them for the situational and ethical complexity of their future practice. While engineering and technology fields have some ethical components already in place, more work is needed to develop curricula and methods that focus on the development of a robust design character. Finally, more work is needed to bridge lab protocols, educational design practices, existing VSD methods, and authentic practice settings. The study of more varied contexts and design tasks will continue to build a taxonomy of values, and further engage the ethical complexity of emerging technologies."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 407.3131103515625,
        "y1": 176.88685607910156,
        "y2": 183.31298828125
      },
      "text": "6 FUTUREWORK"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.8994140625,
        "y1": 526.1165161132812,
        "y2": 616.68701171875
      },
      "text": "In this paper, we have provided a detailed account of how design students engage with values in collaborative design activity, using a novel method of analysis to reveal value interplay in relation to the development of design solutions. We have sought to built upon existing modes of ethical engagement, describing relationships between philosophical and practice-focused work on values and ethics, and proposing a path towards pragmatist ethics."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 399.6416320800781,
        "y1": 511.630859375,
        "y2": 518.0570068359375
      },
      "text": "7 CONCLUSION"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.89794921875,
        "y1": 645.6685180664062,
        "y2": 712.3289794921875
      },
      "text": "The authors would like to thank undergraduate researcher Rhea Manocha for her assistance in data collection and early analysis. The authors would also like to thank the anonymous referees for their valuable comments and helpful suggestions. This work is funded in part by the National Science Foundation under Grant No. 1657310."
    }, {
      "page": 9,
      "region": {
        "x1": 54.0,
        "x2": 558.001953125,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 77 Page 10"
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 425.7048645019531,
        "y1": 631.182861328125,
        "y2": 637.6090087890625
      },
      "text": "ACKNOWLEDGMENTS"
    }
  }, {
    "paragraphs": [{
      "page": 10,
      "region": {
        "x1": 57.50400161743164,
        "x2": 294.0440368652344,
        "y1": 110.05974578857422,
        "y2": 115.5670166015625
      },
      "text": "[1] Anders Albrechtslund. 2007. Ethics and technology design. Ethics and"
    }, {
      "page": 10,
      "region": {
        "x1": 53.797996520996094,
        "x2": 295.38775634765625,
        "y1": 120.02172088623047,
        "y2": 711.4439697265625
      },
      "text": "Information Technology 9, 1 (2007), 63–72. https://doi.org/10.1007/ s10676-006-9129-8 [2] Shaowen Bardzell, Jeffrey Bardzell, Jodi Forlizzi, John Zimmerman, and John Antanitis. 2012. Critical design and critical theory. In Proceedings of the Designing Interactive Systems Conference on - DIS ’12. 288–297. https://doi.org/10.1145/2317956.2318001 [3] Steve Benford, Matt Adams, Ju Row Farr, Nick Tandavanitj, Kirsty Jennings, Chris Greenhalgh, Bob Anderson, Rachel Jacobs, Mike Golembewski, Marina Jirotka, Bernd Carsten Stahl, Job Timmermans, and Gabriella Giannachi. 2015. The Ethical Implications of HCI’s Turn to the Cultural. ACM Transactions on Computer-Human Interaction 22, 5 (2015), 1–37. https://doi.org/10.1145/2775107 [4] Daniel Berdichevsky and Erik Neuenschwander. 1999. Toward an ethics of persuasive technology. Commun. ACM 42, 5 (1999), 51–58. https://doi.org/10.1145/301353.301410 [5] Alan Borning and Michael Muller. 2012. Next steps for value sensitive design. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12. 1125–1134. https://doi.org/10. 1145/2207676.2208560 [6] Barry Brown, Alexandra Weilenmann, Donald McMillan, and Airi Lampinen. 2016. Five Provocations for Ethical HCI Research. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16. ACM Press, New York, New York, USA, 852–863. https://doi.org/10.1145/2858036.2858313 [7] Shruthi Sai Chivukula, Jason Brier, and Colin M Gray. 2018. Dark Intentions or Persuasion?: UX Designers’ Activation of Stakeholder and User Values. In DIS ’18 Companion Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (DIS ’18 Companion). ACM Press, New York, New York, USA, 87–91. https://doi.org/10.1145/3197391.3205417 [8] K Anders Ericsson and Herbert A Simon. 1993. Protocol Analysis: Verbal Reports as Data. MIT Press. [9] Casey Fiesler, Jeff Hancock, Amy Bruckman, Michael Muller, Cosmin Munteanu, and Melissa Densmore. 2018. Research Ethics for HCI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, New York, New York, USA, 1–5. https://doi.org/10.1145/3170427.3186321 [10] Mary Flanagan and Helen Nissanbaum. 2014. Values at play in digital games. https://doi.org/10.1177/1461444816631742 [11] BJ Fogg. 2003. Persuasive Technology: Using Computers to Change What We Think and Do. 1–282 pages. https://doi.org/10.1016/ B978-1-55860-643-2.X5000-8 arXiv:9780201398298 [12] BJ Fogg. 2009. A behavior model for persuasive design. In Proceedings of the 4th International Conference on Persuasive Technology - Persuasive ’09. ACM Press, New York, New York, USA, 1. https://doi.org/10.1145/ 1541948.1541999 [13] Christopher Frauenberger, Amy S. Bruckman, Cosmin Munteanu, Melissa Densmore, and Jenny Waycott. 2017. Research Ethics in HCI. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’17. ACM Press, New York, New York, USA, 1295–1299. https://doi.org/10.1145/3027063.3051135 [14] Christopher Frauenberger, Marjo Rauhala, and Geraldine Fitzpatrick. 2016. In-Action Ethics. Interacting with Computers 29, 2 (2016), 220–236. https://doi.org/10.1093/iwc/iww024 [15] Batya Friedman, Peter Kahn, and Alan Borning. 2002. Value sensitive design: Theory and methods. University of Washington technical report December (2002). http://citeseerx.ist.psu.edu/viewdoc/download?doi= 10.1.1.11.8020&rep=rep1&type=pdf [16] Batya Friedman, Peter H Kahn Jr, and Peter H. Kahn, Jr. 2003. Human Values, Ethics, and Design. In The Human-Computer Interaction"
    }, {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.5454711914062,
        "y1": 97.10771942138672,
        "y2": 710.3359985351562
      },
      "text": "Handbook, Julie A Jacko and Andrew Sears (Eds.). Lawrence Erlbaum Associates, Mahwah, NJ, 1177–1201. [17] John S Gero and Thomas Mc Neill. 2004. An Approach to the Analysis of Design Protocols 1. Technical Report. http://citeseerx.ist.psu.edu/ viewdoc/download?doi=10.1.1.476.5922{&}rep=rep1{&}type=pdf [18] Gabriela Goldschmidt. 2016. Linkographic Evidence for Concurrent Divergent and Convergent Thinking in Creative Design. Creativity Research Journal (2016). https://doi.org/10.1080/10400419.2016.1162497 [19] Colin M. Gray and Elizabeth Boling. 2016. Inscribing ethics and values in designs for learning: a problematic. Educational Technology Research and Development 64, 5 (2016), 969–1001. https: //doi.org/10.1007/s11423-016-9478-x [20] Colin M. Gray, Yubo Kou, Bryan Battles, Joseph Hoggatt, and Austin L. Toombs. 2018. The Dark (Patterns) Side of UX Design. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, New York, New York, USA, 1–14. https://doi. org/10.1145/3173574.3174108 [21] Colin M Gray, Austin L Toombs, Ann Light, and John Vines. 2018. Editorial: Ethics, Values, andDesigner Responsibility. Proceedings of the Design Research Society 1 (2018). https://par.nsf.gov/biblio/10064084 [22] Colin M. Gray, Austin L. Toombs, and Christian McKay. 2016. Meaning Reconstruction As an Approach to Analyze Critical Dimensions of HCI Research. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’16). ACM, New York, NY, USA, 328–340. https://doi.org/10.1145/2851581.2892571 [23] Naomi Jacobs and Alina Huldtgren. in press. Why value sensitive design needs ethical commitments. Ethics and Information Technology (in press). https://doi.org/10.1007/s10676-018-9467-3 [24] Brigitte Jordan and Austin Henderson. 1995. Interaction Analysis: Foundations and Practice. The Journal of the Learning Sciences 4, 1 (1995), 39–103. https://doi.org/10.1207/s15327809jls0401_2 [25] Jes A. Koepfler, Luke Stark, Paul Dourish, Phoebe Sengers, and Katie Shilton. 2014. Values & design in HCI education (workshop). In CHI’14 Extended Abstracts on Human Factors in Computing Systems. ACM, 127–130. https://doi.org/10.1145/2559206.2559231 [26] Hugh LaFollette. 2000. Pragmatic ethics. In Blackwell guide to ethical theory, Hugh LaFollette (Ed.). Blackwell Pub., 400–419. [27] Christopher A. Le Dantec, Erika S. Poole, and Susan P. Wyche. 2009. Values as lived experience: Evolving value sensitive design in support of value discovery. In Proceedings of the 27th international conference on Human factors in computing systems (CHI ’09). ACM, ACM Press, New York, NY, 1141–1150. https://doi.org/10.1145/1518701.1518875 [28] Harold G Nelson and Erik Stolterman. 2012. The Design Way. MIT Press, Cambridge, MA. https://doi.org/10.1017/S0038713400054014 arXiv:arXiv:1011.1669v3 [29] Chris Nodder. 2013. Evil by Design: Interaction design to lead us into temptation. John Wiley & Sons, Inc., Indianapolis, IN. 303 pages. [30] Donald A Norman. 2013. The Design of Everyday Things. https: //doi.org/10.1002/hfm.20127 arXiv:arXiv:1011.1669v3 [31] Marina Pantazidou and Indira Nair. 1999. Ethic of care: Guiding principles for engineering teaching and practice. Journal of Engineering Education 88, 2 (1999), 205–212. https://doi.org/10.1002/j.2168-9830. 1999.tb00436.x [32] Katie Shilton. 2012. Values Levers: Building Ethics Into Design. Science, Technology & Human Values 38, 3 (2012), 374–397. https://doi.org/10. 1177/0162243912436985 [33] Katie Shilton. 2018. Values and Ethics in Human-Computer Interaction. Foundations and Trends in Human–Computer Interaction 12, 2 (2018), 107–171. https://doi.org/10.1561/1100000073 [34] Katie Shilton and Sara Anderson. 2016. Blended, not bossy: Ethics roles, responsibilities and expertise in design. Interacting with Computers 29, 1 (2016), 71–79. https://doi.org/10.1093/iwc/iww002"
    }, {
      "page": 10,
      "region": {
        "x1": 54.0,
        "x2": 558.001953125,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 77 Page 11"
    }, {
      "page": 11,
      "region": {
        "x1": 53.797996520996094,
        "x2": 295.3877258300781,
        "y1": 97.10771942138672,
        "y2": 192.27899169921875
      },
      "text": "[35] Katie Shilton, Jes A. Koepfler, and Kenneth R. Fleischmann. 2014. How to see values in social computing: methods for studying values dimensions. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 426–435. https://doi.org/10.1145/2531602.2531625 [36] Erik Stolterman. 2008. The nature of design practice and implications for interaction design research. International Journal of Design 2, 1 (2008), 55–65. https://doi.org/10.1016/j.phymed.2007.09.005 [37] Austin L. Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The proper care and feeding of hackerspaces: care ethics and cultures of"
    }, {
      "page": 11,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.5430297851562,
        "y1": 97.10771942138672,
        "y2": 182.31597900390625
      },
      "text": "making. In CHI ’15. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, ACM Press, New York, NY, 2093–2102. https://doi.org/10.1145/2702123.2702522 [38] Aimee van Wynsberghe. 2013. Designing Robots for Care: Care Centered Value-Sensitive Design. Science and Engineering Ethics 19, 2 (2013), 407–433. https://doi.org/10.1007/s11948-011-9343-6 [39] Aimee van Wynsberghe and Scott Robbins. 2014. Ethicist as designer: a pragmatic approach to ethics in the lab. Sci Eng Ethics 20, 4 (2014), 947–961. https://doi.org/10.1007/s11948-013-9498-4"
    }, {
      "page": 11,
      "region": {
        "x1": 54.0,
        "x2": 558.0020141601562,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 77 Page 12"
    }],
    "title": {
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 116.56490325927734,
        "y1": 96.18885803222656,
        "y2": 102.614990234375
      },
      "text": "REFERENCES"
    }
  }]
}