{
  "abstractText": {
    "page": 0,
    "region": {
      "x1": 53.54899978637695,
      "x2": 295.73321533203125,
      "y1": 246.23306274414062,
      "y2": 470.84100341796875
    },
    "text": "ABSTRACT Online grocery delivery services present new opportunities to address food disparities, especially in underserved areas. However, such services have not been systematically evaluated. This study evaluates such services’ potential to provide healthy-food access and infuence healthy-food purchases among individuals living in transportation-scarce and low-resource areas. We conducted a pilot experiment with 20 participants consisting of a randomly assigned group’s 1-month use of an online grocery delivery service, and a control group’s 1-month collection of grocery receipts, and a set of semi-structured interviews. We found that online grocery delivery services (a) serve as a feasible model to healthy-food access if they are afordable and amenable to multiple payment forms and (b) could lead to healthier selections. We contribute policy recommendations to bolster afordability of healthy-food access and design opportunities to promote healthy foods to support the adoption and use of these services among low-resource and transportation-scarce groups."
  },
  "figures": [{
    "caption": "Table 1: Participant Group (S=Shipt, C=Control) and demographics; Percentage of green/amber/red foods per total and total dollars spent on food last month; (–) information not provided; (*) participant unavailable for interview. The green/amber/red percentages for some participants do not add up to exactly 100% due to rounding.",
    "captionBoundary": {
      "x1": 53.47161865234375,
      "x2": 559.9103393554688,
      "y1": 392.64080810546875,
      "y2": 422.8175048828125
    },
    "figType": "Table",
    "imageText": ["Average", "0.88,", "2.11", "$15,600", "25%", "29%", "46%", "$177.25", "C3:", "Rosemary", "Non-Shipt", "1,", "3", "–", "38%", "42%", "19%", "$358.68", "C4*:", "Ms.", "T", "Non-Shipt", "–", "–", "–", "–", "–", "–", "C5:", "Andy", "Non-Shipt", "5,", "7", "$20,000", "29%", "35%", "35%", "$93.85", "C6:", "Keisha", "Non-Shipt", "2,", "2", "$30,000", "32%", "37%", "31%", "$196.11", "C9:", "Samuel", "Non-Shipt", "0,", "0", "$20,000", "–", "–", "–", "–", "C14:", "Chadwick", "Non-Shipt", "0,", "3", "$14,000", "30%", "28%", "42%", "$197.52", "C15:", "Talib", "Non-Shipt", "0,", "1", "$9,600", "21%", "22%", "57%", "$184.18", "C16:", "Rashid", "Non-Shipt", "0,", "0", "–", "0%", "8%", "92%", "$33.16", "C18:", "Shelby", "Non-Shipt", "0,", "0", "–", "–", "–", "–", "–", "C19:", "Caleb", "Non-Shipt", "0,", "3", "$0", "–", "–", "–", "–", "Average", "0.44,", "0.67", "$25,442", "54%", "23%", "22%", "$45.04", "S1:", "LoveBug", "Shipt", "1,", "2", "$20,000", "40%", "39%", "20%", "$71.71", "S2:", "Ms.", "J", "Shipt", "0,", "0", "$30,000", "84%", "0%", "16%", "$35.81", "S7:", "Nemyko", "Shipt", "0,", "0", "–", "17%", "6%", "77%", "$33.22", "S8:", "Rudy", "Shipt", "0,", "0", "$35,600", "52%", "33%", "15%", "$18.87", "S10:", "Rachel", "Shipt", "0,", "1", "$19,000", "69%", "10%", "21%", "$33.39", "S11:", "Linda", "Shipt", "3,", "3", "$45,000", "11%", "42%", "48%", "$52.71", "S12:", "Mike", "Shipt", "0,", "0", "$20,000", "84%", "16%", "0%", "$52.05", "S13*:", "Meca", "Shipt", "–", "–", "70%", "22%", "8%", "$59.74", "S17:", "Desiree", "Shipt", "0,", "0", "$8,500", "53%", "34%", "13%", "$43.82", "S20:", "Robert", "Shipt", "0,", "0", "–", "62%", "31%", "7%", "$49.04", "Number", "of", "Children", "2017", "Income", "Green", "Percentage", "Amber", "Percentage", "Red", "Percentage", "Total", "$", "Spent", "on", "Food", "ID:", "Pseudonym", "Group", "Dependents", "&"],
    "name": "1",
    "page": 4,
    "regionBoundary": {
      "x1": 61.0,
      "x2": 551.0,
      "y1": 95.6058578491211,
      "y2": 385.9559020996094
    }
  }],
  "sections": [{
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.04608154296875,
        "y1": 502.7203674316406,
        "y2": 521.1910400390625
      },
      "text": "• Human-centered computing → Empirical studies in HCI; User studies;"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 128.5075225830078,
        "y1": 487.8661193847656,
        "y2": 494.2919921875
      },
      "text": "CCS CONCEPTS"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.798004150390625,
        "x2": 248.2778778076172,
        "y1": 553.0712890625,
        "y2": 559.5868530273438
      },
      "text": "Food disparities, health, online grocery delivery"
    }, {
      "page": 0,
      "region": {
        "x1": 53.24806213378906,
        "x2": 295.0209655761719,
        "y1": 584.3075561523438,
        "y2": 711.0642700195312
      },
      "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for proft or commercial advantage and that copies bear this notice and the full citation on the frst page. Copyrights for components of this work owned by others than the author(s) must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specifc permission and/or a fee. Request permissions from permissions@acm.org. CHI 2019, May 4–9, 2019, Glasgow, Scotland UK © 2019 Copyright held by the owner/author(s). Publication rights licensed to ACM. ACM ISBN 978-1-4503-5970-2/19/05. . . $15.00 https://doi.org/10.1145/3290605.3300879"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.798004150390625,
        "x2": 111.39179229736328,
        "y1": 538.217041015625,
        "y2": 544.6429443359375
      },
      "text": "KEYWORDS"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.7140502929688,
        "y1": 257.75396728515625,
        "y2": 318.4129943847656
      },
      "text": "Tawanna R. Dillahunt, Sylvia Simioni, and Xuecong Xu. 2019. Online Grocery Delivery Services: An Opportunity to Address Food Disparities in Transportation-scarce Areas. In CHI Conference on Human Factors in Computing Systems Proceedings (CHI 2019), May 4– 9, 2019, Glasgow, Scotland UK. ACM, New York, NY, USA, Article 4, 15 pages. https://doi.org/10.1145/3290605.3300879"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.62298583984375,
        "x2": 415.4913330078125,
        "y1": 247.01913452148438,
        "y2": 252.65899658203125
      },
      "text": "ACM Reference Format:"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.70599365234375,
        "x2": 559.8871459960938,
        "y1": 357.84246826171875,
        "y2": 531.72998046875
      },
      "text": "Online shopping is pervasive and it is predicted that grocery markets will be the next major retail sector to be disrupted by ecommerce [17]. Recent predictions suggest that consumers could spend up to $100 billion annually by 2022 or 2024 on online grocery shopping alone [44]. More than half of Millennials and Generation X’ers and over approximately 40% of Baby Boomers and the Greatest Generation have purchased consumer packaged goods online [44]. Nevertheless, users of online grocery shopping services are typically highly educated [1, 3, 57], afuent [1, 3, 57, 59], and technically adept [60]. While online grocery shopping can create numerous societal opportunities such as improved equity [4], it is unknown how benefcial these services are or could be among users who are traditionally underrepresented in such services."
    }, {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8859252929688,
        "y1": 537.16943359375,
        "y2": 627.3709716796875
      },
      "text": "Individuals who live in transportation-scarce and lowincome areas face difculties in maintaining a healthy diet given their lack of fnancial resources and the lack of supermarkets in urban areas [9, 24]. These areas are often referred to as “food deserts” because residents have limited access to afordable and healthy food [15]. In the U.S., disparities in access to supermarkets disproportionately afect low-income and racial/ethnic minority communities [51]."
    }, {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8866577148438,
        "y1": 632.8114624023438,
        "y2": 711.0579833984375
      },
      "text": "Although local government and supermarket partnerships have collaborated to address this issue by bringing supermarkets into underserved areas, whether this leads to healthier eating has been unclear. While some studies note modest improvements in nutrition and diet [64, 65], others fnd that the addition of new supermarkets may not lead to changes in dietary habits but do note an increase in awareness of"
    }, {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.13739013671875,
        "y1": 96.09944915771484,
        "y2": 150.43597412109375
      },
      "text": "food access [14]. Because online grocery delivery services provide access to a wider variety of food and do so digitally, technical interventions may be necessary to bridge the gap between perceptions of food access and healthy-food intake [14]."
    }, {
      "page": 1,
      "region": {
        "x1": 53.54899978637695,
        "x2": 295.7301330566406,
        "y1": 155.87545776367188,
        "y2": 389.53900146484375
      },
      "text": "First, these services provide consumers with access so that consumers can shop at grocery stores in the same city and receive their orders on the same day. Second, these services provide consumers with an interface that suggests items to purchase, shows items on sale, and allows consumers to search for food digitally. Websites could infuence decisions and be tailored to increase positive behaviors [30, 31, 41, 42, 47] and human-computer interaction (HCI) is well-aligned to respond to healthy-food practices in design [10]. Finally, past research notes that transportation models are not often geared towards social determinants of health such as employment, healthy food, and healthcare access [20]. While some specialized transportation models are available in specifc locations, they have not been systematically evaluated and require further investigation [20]. These investigations could help to address issues related to food deserts and the corresponding disparities that exist among marginalized populations [20]. Given the opportunity for HCI to contribute to this space, we sought to answer the following research questions:"
    }, {
      "page": 1,
      "region": {
        "x1": 69.2699203491211,
        "x2": 295.73040771484375,
        "y1": 392.2787170410156,
        "y2": 506.9580078125
      },
      "text": "• RQ1: Does the online grocery-delivery model serve as a feasible model to provide healthy-food access to lowincome and transportation-scarce individuals? Why or why not? • RQ2: Does an online grocery-delivery service lead to healthier-food choices? Why or why not? • RQ3: What opportunities exist for online grocery delivery service design to support healthy choices among individuals living in low-income and transportationscarce environments?"
    }, {
      "page": 1,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7301330566406,
        "y1": 514.5173950195312,
        "y2": 664.4949951171875
      },
      "text": "To answer the frst and third research questions, we conducted a pilot study consisting of a controlled feld experiment followed by semi-structured interviews. We randomly assigned 10 out of 20 individuals to use Shipt for 1 month and interviewed them about their experience. Shipt is an online grocery delivery service that provides a log, or digital receipt of food purchases. To answer the second research question, we asked our control-group participants to provide us with their last month’s worth of grocery receipts and compared the healthiness of the two groups. All participants were recruited from low-resource and transportation scarce areas because many of them lack access to grocery stores [61] and fresh fruits and vegetables [27, 37, 52, 53]."
    }, {
      "page": 1,
      "region": {
        "x1": 53.43000030517578,
        "x2": 294.05029296875,
        "y1": 669.9344482421875,
        "y2": 712.3159790039062
      },
      "text": "We found that the online grocery delivery service supports access to healthier food choices because of its partnership with supermarkets that ofer such items. We also found that by allowing for fexible payment methods and extending"
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.8892211914062,
        "y1": 96.09944915771484,
        "y2": 246.0770263671875
      },
      "text": "these partnerships to local markets, online grocery delivery services could mitigate issues of afordability and promote community. Our results also suggest that participants from the online grocery shopping group made healthier selections. We frst look at factors that enable low-income and transportation-scare individuals to beneft from the online grocery-delivery model. Then, building from past work, we discuss factors that could further promote the selection of healthy foods. This study builds on a growing thread of research to understand opportunities for technology to address the needs of underserved communities, particularly as it relates to transportation [19, 20, 29] and healthy-food access [48, 55]."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 411.0555114746094,
        "y1": 342.9881286621094,
        "y2": 349.41400146484375
      },
      "text": "1 INTRODUCTION"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.6059875488281,
        "x2": 559.8870849609375,
        "y1": 275.4274597167969,
        "y2": 377.5840148925781
      },
      "text": "A survey of the research in retail and distribution management, economics, and HCI suggest the need for more consumer insights in online-grocery delivery, particularly from those who are not traditionally represented in such platforms. It is also unclear what efect, if any, such services have on healthy-food consumption. While existing HCI research and interventions explore how technology can encourage healthy eating, new and existing innovations in technology present a key opportunity to address these issues."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 411.9521484375,
        "y1": 260.5726013183594,
        "y2": 266.99847412109375
      },
      "text": "2 RELATED WORK"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.8905639648438,
        "y1": 418.88946533203125,
        "y2": 509.09100341796875
      },
      "text": "The majority of the research conducted around home delivery services focuses on the perspective of the provider (i.e.,the entity selling the good or service) [22]. Consumer research primarily focuses on who the consumers are and their behaviors, or the overall quality of the home delivery service [22]. This research rarely investigates how the availability of online grocery delivery impacts consumer shopping habits or what people actually purchase."
    }, {
      "page": 1,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8870849609375,
        "y1": 514.5304565429688,
        "y2": 712.3289794921875
      },
      "text": "Early consumer-related research explored who used these services and found that age and education were signifcant determinants of interest in using grocery shopping services [25]. For example, people older than 50 years (compared to 18 to 29 year olds) and those with less education were less likely to use such services [25]. Another study, a preliminary survey of consumer response to online food channels, found that those who were better educated and had somewhat higher incomes were more likely to shop online [40]. These consumers were more likely to do so primarily for convenience [40]. However, 61% of Millennials, 55% of Generation Xers, 41% of Baby Boomers and 39% of the Greatest Generation have recently made consumer packaged good purchases online. Therefore, age might no longer be an inhibitor to online shopping [44]. Yet those who typically used applications of the sharing economy have been found to have higher education [1, 3, 57], higher incomes [1, 3, 57, 59],"
    }, {
      "page": 2,
      "region": {
        "x1": 53.54899978637695,
        "x2": 295.7316589355469,
        "y1": 96.09944915771484,
        "y2": 138.48101806640625
      },
      "text": "and had higher levels of profciency with technology [60]. Understanding the use of these technology-enhanced services among underrepresented users is an area that requires further investigation [26]. Our work aims to fll this gap."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 549.63525390625,
        "y1": 392.07958984375,
        "y2": 410.4605712890625
      },
      "text": "Underrepresented Use of Online Grocery Shopping and the Sharing Economy"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7322082519531,
        "y1": 172.61245727539062,
        "y2": 370.4110107421875
      },
      "text": "Although there is a lack of consensus for the formal defnition of “food deserts”, the term refers to an urban or suburban area with limited number of grocery stores [50] [24, p.372] and residents’ limited access to afordable and healthy food [15]. There are no explicit measurements to identify food deserts, which contributes to individuals debating their existence [15, 16]. However, low-income individuals living in urban areas often face difculties in maintaining a healthy diet given their lack of fnancial resources and the lack of supermarkets in their area [9, 24]. Those with limited access to transportation face further challenges [61] because they are limited in food options [53] and often have easier access or may resort to walking to convenience stores and fast-food restaurants [20] that are within closer distance. Understanding viable transportation models in transportation-scarce and underserved areas requires further exploration [20], to which we contribute in this work."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 241.36387634277344,
        "y1": 157.75863647460938,
        "y2": 164.18450927734375
      },
      "text": "Food Deserts and Transportation Scarcity"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.31999969482422,
        "x2": 295.7275085449219,
        "y1": 416.49847412109375,
        "y2": 566.4760131835938
      },
      "text": "Existing HCI research, particularly using sensing and crowdsourcing interventions, explores how technology can encourage healthy eating [10–12, 23, 36, 45, 55]. Building on this existing research is research that examines how culture and sociotechnical context infuence the nutrition selection of individuals with low-socioeconomic backgrounds [34, 48]. While one option for eliminating food deserts is to provide urban areas with supermarkets, research by Cummins et al. [14] found that this does not alter dietary habits or obesity, but that it does increase awareness of food access . The article cited the need for interventions to help consumers bridge the gap between perception and healthy food intake, which this work addresses."
    }, {
      "page": 2,
      "region": {
        "x1": 53.79798889160156,
        "x2": 295.7324523925781,
        "y1": 571.9154663085938,
        "y2": 709.93798828125
      },
      "text": "Based on the literature, we see an opportunity for emerging technology to enhance transportation access among underserved communities. Recent research has signaled some benefts from these interventions. For example, Dillahunt et al. found that riders of real-time ridesharing services benefted from social exchanges with their drivers [19]; a follow-up study to this research confrmed that riders and drivers also benefted from cultural and social exchanges in transportation-scarce areas of Detroit [29]. While these studies explored real-time ridesharing services, little research, if any, explores the potential for grocery-delivery solutions in transportation-scarce and low-income contexts."
    }, {
      "page": 2,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8849487304688,
        "y1": 96.09944915771484,
        "y2": 305.8529968261719
      },
      "text": "A variety of grocery delivery services (e.g., AmazonFresh, Instacart, Shipt) exist to improve healthy-food access [13]. There is an opportunity to understand the ways in which these grocery delivery services serve as an emerging transportation model and ofset the limited access to healthy foods within transportation-scarce and low-resource communities [20]. While research suggests that providing access to healthy food might not be sufcient to change behavior, past work in HCI and behavioral economics suggests that websites could infuence decisions and be tailored to increase positive behaviors [30, 31, 41, 42, 47]. We see an opportunity for HCI to respond to healthy-food practices in designing [10] and evaluating the feasibility of such services among transportation-scarce and low-socioeconomic environments. This research provides an understanding of how individuals who live in such environments shop using an online grocery service and whether opportunities exist on associated websites to encourage healthy-food purchases."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.49974060058594,
        "x2": 229.21011352539062,
        "y1": 389.6886291503906,
        "y2": 408.0696105957031
      },
      "text": "Opportunities for HCI Interventions in Transportation and Food Access"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.88916015625,
        "y1": 335.2034606933594,
        "y2": 437.3599853515625
      },
      "text": "We conducted a pilot study consisting of a controlled feld experiment. To conduct this experiment, we onboarded a randomized selection of participants to Shipt, held semistructured interviews, and conducted a demographic survey with all participants. We conducted a pre-pilot and fnalized our methods in June. We conducted our pilot study between July and August 2018, in an urban area in southeastern Michigan. We obtained participant consent per institutional review board requirements to complete all aspects of this study."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.95562744140625,
        "x2": 382.6826477050781,
        "y1": 320.34857177734375,
        "y2": 326.7744445800781
      },
      "text": "3 METHODS"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8886108398438,
        "y1": 466.70947265625,
        "y2": 652.552978515625
      },
      "text": "To participate in our study, all participants needed to (1) have limited access to transportation; (2) live in the urban area of Southeastern Michigan; and (3) feel comfortable making purchases online. To aid in our recruiting, we drew from prior work suggesting the use of trusted organizations to recruit in low-resource contexts [19]. Therefore, we established connections with local workforce development programs to aid in our recruitment. We circulated our advertisements, which sought individuals who experienced transportation-related challenges in the area, via workforce development mailing lists, public library bulletin boards, community centers, and at bus stops. We also used snowball sampling because some participants volunteered to distribute our fyers through their networks. Finally, we contacted participants from previous studies who ft our study’s profle and posted advertisements via Craigslist."
    }, {
      "page": 2,
      "region": {
        "x1": 317.58880615234375,
        "x2": 559.74072265625,
        "y1": 657.992431640625,
        "y2": 712.328369140625
      },
      "text": "Prior to meeting participants, two researchers called to verbally confrm that participants met the three requirements. Because we were not conducting a pre/post study, we needed a control group to compare purchases. A research randomizer was used to randomly assign numbers 1 through 20 to either"
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.7345886230469,
        "y1": 96.09944915771484,
        "y2": 210.21197509765625
      },
      "text": "the Shipt group or the non-Shipt group. These numbers were then used as participant numbers based on the order that the participants were frst contacted. We successfully recruited 20 participants to our study. Shipt group participants were onboarded to use the online grocery delivery application, Shipt for 1 month. We instructed the remaining individuals to save their grocery receipts for 1 month. We then collected receipts from the non-Shipt group to compare food purchases with the orders from the Shipt participants."
    }, {
      "page": 3,
      "region": {
        "x1": 53.42698669433594,
        "x2": 295.5746154785156,
        "y1": 215.65145874023438,
        "y2": 389.53900146484375
      },
      "text": "Per Table 1, the majority of our participants were women (N=11). The majority of our Shipt participants were women (N=8) whereas the majority of our non-Shipt participants were men (N=7) The average age of our participants was 49 (SD=13.43). The average age of our Shipt group was slightly lower (M=45.44, SD=14.59) whereas that of our control group was slightly higher (M=53, SD=11.61). The average income of those who reported their income was $20,900 (SD=$12,025). On average, participants had two people in their households (SD=1.4). Two participants had completed a bachelor’s degree and the remaining participants (N=8) had less than a college degree. Three participants reported having a disability. A large majority of our participants were of African American descent (N=18) and the remaining two participants were Caucasian."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 427.50384521484375,
        "y1": 451.8555603027344,
        "y2": 458.28143310546875
      },
      "text": "Participant Recruitment"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.73272705078125,
        "y1": 426.8594665527344,
        "y2": 708.343994140625
      },
      "text": "Shipt is a Target-owned Internet-based grocery delivery service that allows users to place orders on items sold by participating retailers such as Meijer and Target. The service ofers same-day delivery and allows customers to purchase orders through a smartphone application and website. The current desktop interface afords individuals the ability to navigate items by search and flter results by category on the left-hand sidebar. They can also directly click on an image result, which is a stock picture of the item accompanied by cost and weight information, quantity, and an add-to-cart button. At the moment, there is no way to zoom into the image or view it at a 360-degree angle to simulate the real-life experience of grocery shopping. Shipt requires a valid email address and credit card to register and use the service. To assess the viability of such an intervention for lowresource individuals in transportation-scarce regions, we chose Shipt because of its availability in southeastern Michigan. Shipt also had the most afordable membership fee compared to similar services such as Instacart and AmazonFresh. Past research identifed cost as a facilitator to emerging transportation technologies in underserved communities [20] so we decided upon this cheaper option. We also drew from past literature detailing obstacles found when onboarding individuals from low-resource areas [19]. To simplify the"
    }, {
      "page": 3,
      "region": {
        "x1": 317.58917236328125,
        "x2": 559.8903198242188,
        "y1": 96.09944915771484,
        "y2": 210.21197509765625
      },
      "text": "onboarding process, we contacted Shipt to create ten placeholder accounts in advance before providing participant information. We did this for two reasons. First, we did not require participants to have access to credit cards and we were able to pre-load the accounts with a $50 credit. We also paid for a 1-month membership, which was $14.00. This served as compensation for those who were in the Shipt group. Non-Shipt members received $64.00 or the equivalent of the credit and cost of membership fee in cash after they completed their exit interviews."
    }, {
      "page": 3,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8866577148438,
        "y1": 215.65145874023438,
        "y2": 341.718994140625
      },
      "text": "Upon onboarding participants to Shipt, we provided them with an overview of the service that included instructions on how to log in with usernames and passwords, which were assigned by the researchers in order to be able to observe order history and food selection. Upon frst login, we assisted each participant in selecting a participating supermarket. To gain a realistic perspective of participants’ full shopping experience, we did not limit them to food purchases. If participants wished to continue using Shipt upon the conclusion of the study, we advised them to set up a new account under their own contact information."
    }, {
      "page": 3,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.8875732421875,
        "y1": 356.2145690917969,
        "y2": 712.3291015625
      },
      "text": "Semi-structured Interviews We conducted our interviews at the end of the pilot experiment in public spaces including libraries, cofee shops, community centers and were near participants’ places of residence to mitigate their travel. On average, the interviews lasted 35 minutes (min = 9, max=59). While we were able to qualitatively address all research questions with our Shipt participant interviews, we also needed to interview nonShipt participants to validate our results. We interviewed Shipt participants to understand their experience using the application and service, to understand which products they purchased and why, and to understand any products that were not purchased and why. We asked Shipt group participants, for instance, \"Can you describe how you chose the items to buy while shopping on Shipt?\" to gain a sense of how they used the service and to uncover application issues relating to usability. We also posed the questions, \"How do you select your food when you buy it at the grocery store?\" and \"Compared to your regular grocery shopping in store, did either method encourage you to choose food items that were healthier?\" to explore how the online grocery delivery service might difer from the ofine experience and behaviors and to qualitatively address RQ2. We asked our non-Shipt participants questions to learn about their purchase patterns: “Do you keep a written or mental shopping list beforehand?”; “What is your priority in selecting food?”; and “Could you show me the grocery receipts that you collected over the last 30 days?” For those participants who submitted their receipts, this yielded further information about the types of purchases made (perishable or"
    }, {
      "page": 4,
      "region": {
        "x1": 53.31964111328125,
        "x2": 559.8871459960938,
        "y1": 436.8304748535156,
        "y2": 710.3389892578125
      },
      "text": "non-perishable) and where, which allowed us to probe why the feasibility of the services (RQ1). Twelve of the 18 (67%) they went to specifc stores. Moreover, we asked non-Shipt participants who completed surveys had access to a credit participants about the transportation methods they used to card or bank card (Shipt, N=7; non-Shipt, N=5). reach grocery stores in order to understand any constraints. We probed all participants about their experiences with public transit, community carpooling, Uber/Lyft, and driving, to explore any additional challenges or concerns associated Data Analysis with each one. These questions were to draw out any addi- Our data consisted of feld notes taken during the recruittional concerns related to transportation, which could further ment process, interview transcripts, our Shipt participants’ provide insight into how online grocery delivery applications online shopping history, our non-Shipt participants’ grocery could or could not accommodate participant concerns (RQ3). receipts, and demographic surveys. We used feld notes taken We compensated participants $25.00 for their time to conduct during the recruitment process to collect insights on barrian interview. ers to using technology among low-resource populations as done in prior work [19]. All interviews were audio-recorded Demographic Survey and professionally transcribed and these interviews served Participants also took a 5 to 10 minute survey to provide as the basis of our analyses. To understand the feasibility information about their demographics, transportation behav- of and opportunities for online grocery-delivery services to iors, and level of comfort using technology and searching provide healthy-food access in this context (RQ1 and RQ3), for information online. The survey collected responses on we analyzed the transcripts from our semi-structured interparticipants’ year of birth, living arrangements, employment views. Understanding whether these services led to healthier status, education level, and the number of people living in food choices (RQ2) required analyzing items purchased via the household. We also examined specifc factors such as fa- Shipt and outside of Shipt during the study month. miliarity with technology and access to bank cards to assess"
    }, {
      "page": 5,
      "region": {
        "x1": 52.672000885009766,
        "x2": 559.88037109375,
        "y1": 96.09944915771484,
        "y2": 712.3289794921875
      },
      "text": "Because of the exploratory nature of our study, we used structural coding. Structural coding is a question-based coding technique that allows researchers to quickly access relevant data from a larger data set [43]. It is most suitable for analyzing interview transcripts and allowed us to quickly answer our three research questions [54]. We coded segments of our transcripts as answers to each research question, which we then collected and categorized, and discuss here in our fndings. To fully understand participant responses to our frst research question, we also used provisional coding. We used a set of a priori codes based on past literature and our feld notes to understand: (1) the types of transportation barriers participants faced when accessing food. Provisional codes were primarily derived from Dillahunt and Veinot [20] and included, “cost or afordability,” “individual capabilities,” “trust in technology,” “match between transportation mode and physical needs,” and “service reliability and quality.” All team members met at the end of each coding phase to resolve conficts and to discuss new codes. Understanding participants’ transportation barriers allowed us to identify how the online grocery delivery service model could address these issues and to compare our fndings to prior HCI literature [20]. To fully address why online grocery-delivery services lead or do not lead to healthier food choices, we used open coding to categorize Shipt participant responses when probing about their food purchases [54]. Finally, to quantitatively understand whether the online grocery-delivery service led to healthier food choices (RQ2), we itemized all food items purchased and the price of each items for each participant, keeping the Shipt and non-Shipt groups separate. We then assessed the health level of all food items purchased. While we used Shipt accounts to collect the name and price of items purchased via Shipt, we used the control group’s grocery receipts collected during the study and provided to us for this information. To compare the health levels of the food items, we categorized each of the food items into “green,” “amber,” or “red” using the green/amber/red index provided in the Healthy Choices Food and Drink Classifcation Guide [2]. This Australiangovernment approved typology [2, 35] has consistently come out as one of the top \"front-of-pack\" (FOP) labeling schemes in both consumer preference and its utility in supporting consumers in identifying healthier choices [21]. For example, to categorize a box of Reese’s Pufs Breakfast Cereal, we identifed the “breakfast cereal” category in the classifcation guide. Under this category, products that contained less than 2 grams of fat and less than 20 grams of sugar are classifed as \"green\". Otherwise, they were classifed as “amber”. Based on the nutrition facts label of Reese’s Pufs, there are 35 grams of sugar per 100 grams of cereal. Therefore, we classifed this item as “amber”. The \"red\" category refers to a set of food categories that are high in saturated fat and added sugar and salt while lacking in fber and other nutrients. Some examples of \"red\" items include fried foods and processed ready-to-eat meals that contain more than 5 grams of saturated fat, more than 450 mg of sodium and less than 3 grams of fber per 100 grams of food. Each ranking was assigned a numeric value (green = 1; amber = 2; red = 3). To account for varying numbers of household, items purchased per visit, and receipts collected in total, we created a health metric to represent the percentage of each participant’s spending on items labeled \"green,\" \"amber,\" and \"red\" respectively. We then calculated the average percentage for both the Shipt and non-Shipt groups for comparison. Given the level of participant deviation from our study procedure, we did not evaluate the signifcance between these two groups."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 77.69828033447266,
        "y1": 412.0046691894531,
        "y2": 418.4305419921875
      },
      "text": "Shipt"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.8871459960938,
        "y1": 304.1194763183594,
        "y2": 406.2760009765625
      },
      "text": "We begin by discussing unanticipated circumstances revealed from our pilot and insights about the level of digital literacy of our participants. To contextualize why the online grocery-store model serves or does not serve as a feasible model to provide healthy-food access (RQ1), we provide an understanding of the transportation barriers our participants faced. We then use our results to answer our frst two research questions. We address our fnal research question in our discussion."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 375.6184997558594,
        "y1": 289.2655944824219,
        "y2": 295.69146728515625
      },
      "text": "4 RESULTS"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.8867797851562,
        "y1": 440.4084777832031,
        "y2": 709.93798828125
      },
      "text": "We raise unanticipated circumstances and issues that can exist when conducting research among low-resource individuals, or those with limited income, education, and access to transportation. Most of our population described themselves as Black/African-American, a marginalized and historically underserved population [58]. First, we were only able to interview nine Shipt and nine non-Shipt participants (see Table 1). One non-Shipt participant, Ms. T (C4), became hospitalized during the study. Another participant, Meca (S13), was a no-show and later unreachable, though we had access to her Shipt purchases. Second, an interview with a Shipt participant, Robert (S20), who acknowledged having a lot of health problems, was cut short after he expressed frustration. Third, while our Shipt participants used the service, not all of them used the service for the full duration of the study because of the afordability of the service and payment restrictions, which we discuss later. Finally, only 6 of our 10 non-Shipt participants provided receipts. The average monthly total of each participant’s monthly receipts was only $177.25 when the average weekly cost of groceries is $151, according to a 2012 Gallup poll [39]. It is unlikely that the receipts received represent all grocery purchases made over the last month and it is possible that"
    }, {
      "page": 6,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.1394958496094,
        "y1": 96.09944915771484,
        "y2": 186.301025390625
      },
      "text": "our participants purchased food at restaurants. However, our study design did not allow for taking this into account. We acknowledge the small sample size of our pilot and that the participant deviation further lower the power of our study. However, these violations are worth noting and can be used to conduct power analyses for future studies. Therefore, we present descriptive statistics of purchases made in Table 1 and rely heavily on our qualitative insights for context."
    }, {
      "page": 6,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.7279052734375,
        "y1": 191.74148559570312,
        "y2": 341.718994140625
      },
      "text": "Per our survey results, participants were relatively comfortable with technology. Thirteen participants stated they somewhat or strongly agreed they felt comfortable using computers. This was split evenly between the Shipt and non-Shipt groups. Fifteen participants said they somewhat or strongly agreed they felt comfortable using their smartphone to check email and social media, which was also split evenly among the Shipt and non-Shipt groups. From our observations, the majority (N=8) of our Shipt participants used their mobile phones to interact with the service. Robert (S20) requested assistance adding items and checking out and was the only participant to seek this level of assistance from us directly."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 451.1550598144531,
        "y1": 425.5536193847656,
        "y2": 431.9794921875
      },
      "text": "Unanticipated Circumstances"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.319610595703125,
        "x2": 295.73260498046875,
        "y1": 374.93646240234375,
        "y2": 608.5999755859375
      },
      "text": "Our results confrmed our ability to reach participants with transportation barriers. More than half of our participants (N=12) had, despite ability, no access to a car to drive for the last 6 months. More than half (N=7) of these participants had general concerns about transportation safety. One of our participants did not have a driver’s license, three participants had their license suspended, and two had physical disabilities. We found that transportation barriers subjected at least three participants to shopping at stores that did not ofer full-stock items. Most of our participants reported using a combination of public transportation, ridesharing, and carpooling with family for daily activities. Public transportation also limited the number of items that participants could carry at once. Some cited safety concerns and relied on Uber or Lyft to run necessary errands, despite the high cost. At least two participants (S17, C19) reported receiving government or medical insurance-subsidized services for transportation to medical appointments or groceries. However, both participants described issues related to service reliability and overall quality of these services:"
    }, {
      "page": 6,
      "region": {
        "x1": 78.20700073242188,
        "x2": 272.21551513671875,
        "y1": 620.1934204101562,
        "y2": 710.39501953125
      },
      "text": "Well, I get rides from [company name held for anonymity] through the insurance company. And I gotta tell you, the transportation is awful... [A] lot of times they’re very late. I’ve had experiences where the drivers are extremely rude. The cars are extremely dirty. One girl picked me up in a car that was duct-taped. And she was driving and it sounded like the engine was gonna fall"
    }, {
      "page": 6,
      "region": {
        "x1": 342.364013671875,
        "x2": 535.4788818359375,
        "y1": 96.1010971069336,
        "y2": 162.3909912109375
      },
      "text": "out. And these are people that get contracts with Medicaid. How do they get contracts through the state or whatever? I don’t understand because it’s terrible, the condition of the car, the driver, everything. It’s a terrible experience. – Desiree, S17"
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 161.01553344726562,
        "y1": 360.080078125,
        "y2": 366.5059509277344
      },
      "text": "Transportation Barriers"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.8870849609375,
        "y1": 192.83547973632812,
        "y2": 414.54400634765625
      },
      "text": "We primarily used our interview results to answer whether the online grocery delivery model was feasible to provide healthy-food access to low-income and transportation-scarce individuals. Our results show that Shipt participants overwhelmingly had a positive experience using the service; all participants said that they would use the service again. Our interview results revealed that Shipt participants who found the service most benefcial included those with credit cards and those who were socially isolated. Desiree (S17), the only Shipt participant to report a disability, especially found the service benefcial. We frst look at factors that enabled our Shipt participants to beneft from the online grocery-delivery model: convenience and accessibility, as well as service reliability and quality. The factors that could hinder the feasibility of the use of the service over time are incompatibility of payment methods and afordability. Other factors, mentioned among few participants, include limited social interactions, technology concerns, and loyalty to local stores and in-person grocery shopping."
    }, {
      "page": 6,
      "region": {
        "x1": 317.5892028808594,
        "x2": 559.8867797851562,
        "y1": 427.05548095703125,
        "y2": 577.0330200195312
      },
      "text": "Convenience and Accessibility. All of our Shipt participants described the service as convenient. Shipt participants noted they received their items quickly and could schedule their delivery within the workday to save them time. In addition to receiving items at their residences, at least two participants noted that they made more frequent purchases with the site. This was not an option with limited transportation. Specifcally, participants felt comfortable purchasing fresh produce more frequently and did not feel constrained to buy items with a longer shelf life. Only one participant, Rachel (S10), expressed frustration at not being able to purchase a specifc brand of ice-cream and tarragon because the partnered store did not carry them at the time of purchase."
    }, {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8865966796875,
        "y1": 582.4724731445312,
        "y2": 636.8090209960938
      },
      "text": "Ms. J (S2) noted the ability to check out items online without losing her place in the checkout line to buy forgotten items. Nemyko (S7) added that she could also use the same discount perks online as she had used ofine. LoveBug (S1) noted the beauty of having items arrive at her door."
    }, {
      "page": 6,
      "region": {
        "x1": 317.656005859375,
        "x2": 558.2049560546875,
        "y1": 642.2484741210938,
        "y2": 672.6749877929688
      },
      "text": "By design, the Shipt service eliminated the need to travel (S1, S2, and S17) and was especially benefcial for Desiree (S17), who reported a disability:"
    }, {
      "page": 6,
      "region": {
        "x1": 342.364013671875,
        "x2": 534.888427734375,
        "y1": 681.3554077148438,
        "y2": 711.781982421875
      },
      "text": "I’m having a real hard time going up the stairs right now. And so [the Shipt shopper] brought everything up to the door and they were friendly,"
    }, {
      "page": 7,
      "region": {
        "x1": 78.20700073242188,
        "x2": 269.6379699707031,
        "y1": 96.09944915771484,
        "y2": 114.57000732421875
      },
      "text": "efcient, and they were really fast. It was a great experience."
    }, {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0503234863281,
        "y1": 124.4354476928711,
        "y2": 142.906005859375
      },
      "text": "At least fve participants (S1, S2, S7, S8, S11) described the convenience of being able to shop from anywhere:"
    }, {
      "page": 7,
      "region": {
        "x1": 78.20697021484375,
        "x2": 269.6379699707031,
        "y1": 152.77145385742188,
        "y2": 231.01800537109375
      },
      "text": "I found it to be very convenient. You can be anywhere. You can be at work. You can be at school. You can be just sitting here at the cofee shop, like you’re sitting right now. You might not be home for a few hours, so you can base your time on when you think you’re going to be home. – Ms. J, S2"
    }, {
      "page": 7,
      "region": {
        "x1": 53.54899978637695,
        "x2": 295.73223876953125,
        "y1": 240.88345336914062,
        "y2": 354.9960021972656
      },
      "text": "Finally, at least two Shipt participants felt that the service provided access to standardized chain stores that were otherwise unavailable due to transportation barriers. According to LoveBug (S1), “I enjoyed being able to have access to get the [Meijer] groceries... That was really important to me. ... I really, really liked that.” Our non-Shipt participants did not interact with the service, yet it is worth noting that Samuel (C9) commented on how having to track his food purchases for the purpose of the study made him more health-conscious."
    }, {
      "page": 7,
      "region": {
        "x1": 53.31608581542969,
        "x2": 295.73016357421875,
        "y1": 368.6354675292969,
        "y2": 518.613037109375
      },
      "text": "Service Reliability and Qality. Our interview data revealed that seven (N=7) out of the nine (N=9) Shipt participants interviewed would recommend the service to friends and family. The Shipt participants we interviewed spoke highly of their shoppers. Four described their shoppers as cordial, communicative, and respectful (S7, S8, S10, S12) and LoveBug (S1) commented on her shopper’s close attention to detail. While participants described a general preference for seeing, touching, and selecting certain food items, our results suggest that this did not impact their actual selections online. When asked whether she bought the same items using Shipt as she had shopped for in person, Rachel (S10) replied afrmatively. According to another participant:"
    }, {
      "page": 7,
      "region": {
        "x1": 78.20700073242188,
        "x2": 270.73248291015625,
        "y1": 528.4784545898438,
        "y2": 570.8590087890625
      },
      "text": "Only thing I did not like about Shipt is, I’d say, as far as, like, produce, you really don’t get to see the produce that they’re picking... – Mike, S12"
    }, {
      "page": 7,
      "region": {
        "x1": 53.79798889160156,
        "x2": 294.29730224609375,
        "y1": 580.7244262695312,
        "y2": 658.9710083007812
      },
      "text": "Yet, this did not stop Mike (S12) from purchasing bananas and red potatoes. All Shipt participants were satisfed with the purchases that had been made on their behalf; no one noted being dissatisfed with the quality of the items they received. Despite showing some reluctance to having others shop on their behalf, Shipt participants seemed to give their shoppers the beneft of the doubt:"
    }, {
      "page": 7,
      "region": {
        "x1": 78.20700073242188,
        "x2": 269.8918762207031,
        "y1": 668.83642578125,
        "y2": 711.218017578125
      },
      "text": "No, they can’t replace that, not being able to see it for yourself. You know, I believe they will pick the best, you know, the person that’s picking the groceries and stuf, pick the best for you, but"
    }, {
      "page": 7,
      "region": {
        "x1": 341.26800537109375,
        "x2": 535.3294067382812,
        "y1": 96.0971908569336,
        "y2": 114.57000732421875
      },
      "text": "you know, it’s not like you’re picking it yourself. – LoveBug, S1"
    }, {
      "page": 7,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8828125,
        "y1": 123.16243743896484,
        "y2": 177.4990234375
      },
      "text": "Results from our control group suggest that participants were especially cautious about freshness and careful about selecting their own items due to substandard meat and produce ofered by neighborhood grocery stores (as opposed to chain supermarkets)."
    }, {
      "page": 7,
      "region": {
        "x1": 342.364013671875,
        "x2": 535.4811401367188,
        "y1": 186.09146118164062,
        "y2": 216.51702880859375
      },
      "text": "I don’t buy grocery store products [from neighborhood grocery stores] as far as meat. The quality, it’s always freezer-burned... – Andy, C5"
    }, {
      "page": 7,
      "region": {
        "x1": 317.656005859375,
        "x2": 558.2000122070312,
        "y1": 225.10946655273438,
        "y2": 243.58001708984375
      },
      "text": "In fact, this was stated to be a pervasive issue by Keisha (C6), another participant from our control group:"
    }, {
      "page": 7,
      "region": {
        "x1": 342.364013671875,
        "x2": 534.8895263671875,
        "y1": 252.17147827148438,
        "y2": 306.50799560546875
      },
      "text": "[I]t’s hard shopping at the markets in my area. A lot of stuf is kind of outdated. You have to watch out for dates, the freshness, the cleanliness of the markets. A lot of them aren’t up to code. – Keisha, C6"
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8867797851562,
        "y1": 315.1004638671875,
        "y2": 357.4809875488281
      },
      "text": "To work around the substandard quality of items at neighborhood and corner stores, Keisha and other non-Shipt participants shopped at multiple markets and sometimes had to travel farther."
    }, {
      "page": 7,
      "region": {
        "x1": 342.364013671875,
        "x2": 533.986328125,
        "y1": 366.0734558105469,
        "y2": 408.4549865722656
      },
      "text": "I love to go out shopping at the Walmart and stuf, the markets that are further out because they seem to have a better selection and fresher food. They’re up to code. – Keisha, C6"
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7332763671875,
        "y1": 417.0464782714844,
        "y2": 471.38299560546875
      },
      "text": "Overall, our results suggest that our Shipt participants had a positive experience with the service and they were satisfed with their shoppers and quality of their deliveries. Our non-Shipt participants were inconvenienced because of the perceived subpar quality of local markets."
    }, {
      "page": 7,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8878173828125,
        "y1": 483.8104553222656,
        "y2": 609.8770141601562
      },
      "text": "Incompatible Payment Methods and Afordability. The Electronic Benefts Transfer (EBT) card is used to authorize the transfer of federal benefts to Supplemental Nutrition Assistance Program (SNAP) recipients. SNAP ofers “nutrition assistance to millions of eligible low-income individuals and families” [46]. Although we did not explicitly ask participants about their SNAP eligibility, Desiree (S17), expressed wanting to use her EBT/SNAP payments for her Shipt purchases. Shipt, however, only accepted credit cards for payment. When asked about how Desiree felt about the payment methods, she responded:"
    }, {
      "page": 7,
      "region": {
        "x1": 342.364013671875,
        "x2": 535.4743041992188,
        "y1": 618.4694213867188,
        "y2": 648.89501953125
      },
      "text": "Well, it’s frustrating. It’s not fair ... [With] food stamps, we’re still purchasing something... – Desiree (S17)"
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.4486083984375,
        "y1": 657.4874267578125,
        "y2": 711.823974609375
      },
      "text": "She later added that she would defnitely use the Shipt service if it accepted EBT as a form of payment. Of the six non-Shipt participants who submitted their receipts, each participant submitted at least some receipts that indicated payment via EBT."
    }, {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.73016357421875,
        "y1": 96.09944915771484,
        "y2": 198.25701904296875
      },
      "text": "Because most of our participants had low incomes and many from our non-Shipt group were EBT recipients, we raise afordability as an issue that could prevent sustained use of the service over time. At least three of our Shipt participants described the prices as being more expensive than at their local stores (S8, S9, S10). Rachel (S10) had the perception that Shipt may have added premium fees to some items and that these items were more expensive than in-store purchases:"
    }, {
      "page": 8,
      "region": {
        "x1": 78.20698547363281,
        "x2": 270.7272033691406,
        "y1": 208.42044067382812,
        "y2": 358.39801025390625
      },
      "text": "I’ve never really shopped at Target or Meijer for my food. I wasn’t familiar with the brands that they carry. Normally, it’s Kroger and Aldi for me. I like Aldi because they carry a lot of brands that you can’t fnd anywhere else. And because their prices are lower, too. I also found, too, that the prices are not comparable to some of the other stores. Some things are a little bit higher. Granted, I believe that it’s because you’re shopping online, so you’re paying a premium for the service. I don’t know whether or not those are the same prices in the stores, because I don’t go to those stores. – Rachel, S10"
    }, {
      "page": 8,
      "region": {
        "x1": 53.31999969482422,
        "x2": 295.58221435546875,
        "y1": 368.56146240234375,
        "y2": 590.27001953125
      },
      "text": "Two Shipt participants (S2, S17) mentioned, unprompted, that the Shipt membership was afordable. Nevertheless, their participation included a free 1-month membership and a $50 Shipt credit. Therefore, to get a better sense of afordability, we followed up with all participants a month after the study was over to see whether they were still using the service. After substantial efort, we were able to reach six (N=6; S1, S2, S7, S8, S11, S17) of the nine Shipt participants interviewed. We found that none of these participants continued using the service for several reasons: they did not have the money to shop; there were only two stores ofered via Shipt and not enough items on sale; and Shipt did not accept EBT. Two participants (S2, S11) stated that they did not have time to use the service. As we explain later, Linda (S11) expressed technology concerns related to identity theft in her interview. However, the lack of time contradicted Ms. J’s (S2) experience with Shipt’s ability to save her time. Finally, one participant indicated they did not continue to use the service for personal reasons and we did not probe further in this case."
    }, {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.72442626953125,
        "y1": 604.1944580078125,
        "y2": 682.4409790039062
      },
      "text": "Limited Social Interactions. The use of online grocerydelivery services inherently removes the social experience of shopping in stores. However, only one participant raised this as a side efect. Rachel, our most senior participant, noted that grocery shopping for her was an opportunity to move or be physically active and that online shopping removed this beneft:"
    }, {
      "page": 8,
      "region": {
        "x1": 77.83799743652344,
        "x2": 269.6387939453125,
        "y1": 692.6044311523438,
        "y2": 711.0750122070312
      },
      "text": "I think a lot of it goes back to my condition...we want to do stuf for ourself... There may come a"
    }, {
      "page": 8,
      "region": {
        "x1": 342.364013671875,
        "x2": 534.8884887695312,
        "y1": 96.09944915771484,
        "y2": 186.301025390625
      },
      "text": "time when my daughter may have to take care of me, or I may have to shop online, but that’s down the road for me. If I don’t have to do that now, and I can get out there, and I can do my own, I’m gonna do my own. I’m not gonna sit here online, in front of a TV, or a computer, and do that when I know that I can get out. – Rachel, S10"
    }, {
      "page": 8,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.2952880859375,
        "y1": 197.11044311523438,
        "y2": 215.58099365234375
      },
      "text": "Rachel also described shopping as a social experience and was especially averse to alienation with this type of service:"
    }, {
      "page": 8,
      "region": {
        "x1": 342.36395263671875,
        "x2": 535.4788208007812,
        "y1": 226.38949584960938,
        "y2": 388.322998046875
      },
      "text": "When we were kids, shopping was an experience or an outing. It was an event. I remember getting dressed up to go downtown. It was not just ... it was, the whole experience of it was amazing. Kids now lose out on so much because, you know, you get together with your sisters or your friends and you go shopping and you have an experience. You go shopping. You sit down, you try on things. You get their opinion. Then you go have lunch. You sit down and you talk and you have more of an experience and more of a connection and a bonding. That’s what is missing when you do online shopping. – Rachel, S10"
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8871459960938,
        "y1": 402.8604736328125,
        "y2": 588.7039794921875
      },
      "text": "Limited Technology Concerns. We found that technology concerns could be divided into limited digital literacy and overall distrust of technology. As stated, Robert (S20) requested our direct assistance in adding items to his cart and checking out; LoveBug (S1)’s granddaughter made purchases on her behalf though LoveBug herself not note any discomfort with technology use. We were unable to note specifc information relating to technology concerns among our nonShipt participants. Rachel (S10) noted difculties navigating the Shipt interface on her computer; this took additional time and made the experience more frustrating for her. Finally, Linda (S11), concerned with identity theft, recounted the story of how she had to prove her identity to her bank. This did not prevent her, however, from potentially using the service in the future because, she stated, \"I might consider it if I’m, like, extremely busy.\""
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8859252929688,
        "y1": 603.242431640625,
        "y2": 645.6229858398438
      },
      "text": "Loyalty to Local Stores and In-Person Shopping. Our fndings suggest that our participants might have been loyal to some of the stores in their community. Rosemary shopped at trusted specialty markets for meat:"
    }, {
      "page": 8,
      "region": {
        "x1": 342.364013671875,
        "x2": 534.8883666992188,
        "y1": 656.4324340820312,
        "y2": 710.7680053710938
      },
      "text": "... I got all my family transferred on to shop [at Mini-Mart, a specialty meat market] because it’s the best meat, the taste is totally diferent from any store. The quality is 100% fresh. – Rosemary, C3"
    }, {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.72979736328125,
        "y1": 96.09944915771484,
        "y2": 138.48101806640625
      },
      "text": "We also found that participants preferred to select certain items in the store for themselves. This led to their stated reluctance to purchase certain foods such as meat and produce online:"
    }, {
      "page": 9,
      "region": {
        "x1": 77.83838653564453,
        "x2": 271.3188781738281,
        "y1": 151.07748413085938,
        "y2": 241.27911376953125
      },
      "text": "I didn’t like the fact that somebody else is touching my stuf before I got it. I didn’t want them to. Even though the concept of people in the grocery store putting the produce into the section, you know that it’s being handled. But then my groceries are in somebody else’s car. They’re in somebody else’s hands. I wasn’t comfortable with that at all. – Rachel, S10"
    }, {
      "page": 9,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.1424865722656,
        "y1": 253.87649536132812,
        "y2": 332.12298583984375
      },
      "text": "Rachel knew that her groceries were being handled across multiple environments; however, this did not prevent her from shopping in local grocery stores, or via Shipt. Again, while we acknowledge this as a concern among participants, we note it as a perceived concern that did not afect their choices. For instance, this did not stop Rachel from buying ground turkey, fresh tarragon and cucumber."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 317.9556579589844,
        "x2": 515.9922485351562,
        "y1": 177.98245239257812,
        "y2": 184.4083251953125
      },
      "text": "RQ1: Feasibility of Online Grocery Delivery"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 53.45000076293945,
        "x2": 295.72613525390625,
        "y1": 366.2964782714844,
        "y2": 480.40899658203125
      },
      "text": "As we mentioned earlier, six out of the nine participants interviewed from our control group provided us with receipts. The receipt data shows that these participants combined shopped at a combined total of 20 diferent stores for their groceries. We labeled these stores as limited-stock (e.g., dollar store, pharmacy, or local convenience store), full-stock (Aldi, Walmart, or local supermarket), and specialty (e.g., local slaughterhouses and farmers’ markets). We labeled ten (N=10, 50%) of the stores as full-stock grocery stores; six (N=6, 30%) as limited stock; and four (N=4, 20%) as specialty."
    }, {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.04669189453125,
        "y1": 485.8484802246094,
        "y2": 504.3190002441406
      },
      "text": "Nemyko recalled the benefts of having online access to full-scale supermarkets:"
    }, {
      "page": 9,
      "region": {
        "x1": 78.20698547363281,
        "x2": 272.75250244140625,
        "y1": 516.9164428710938,
        "y2": 559.2969970703125
      },
      "text": "Nemyko: [I]t was pretty nice, you know, and it was convenient and the quality of the food looked a lot diferent from me going in the [neighborhood] store and buying it."
    }, {
      "page": 9,
      "region": {
        "x1": 78.20700073242188,
        "x2": 186.79930114746094,
        "y1": 576.6917114257812,
        "y2": 583.207275390625
      },
      "text": "Interviewer: Okay, how so?"
    }, {
      "page": 9,
      "region": {
        "x1": 77.90799713134766,
        "x2": 271.164306640625,
        "y1": 600.6024169921875,
        "y2": 654.93896484375
      },
      "text": "Nemyko: The cheese looked like it was real fresh versus being all beat up and lookin’ all crazy. The pineapple lasts a long time and I’m guessing they did this from Target, ’cause I use Target and Meijer [in the service]. – Nemyko, S7"
    }, {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.04803466796875,
        "y1": 667.5354614257812,
        "y2": 709.9169921875
      },
      "text": "Because of our study limitations, we did not conduct a statistical comparison of our results; however, the descriptive statistics from Table 1 suggests that those in the Shipt group purchased a higher percentage of healthier, or green, items"
    }, {
      "page": 9,
      "region": {
        "x1": 317.58917236328125,
        "x2": 559.8919067382812,
        "y1": 96.09944915771484,
        "y2": 269.98797607421875
      },
      "text": "than red items (54% versus 22%) via Shipt, whereas our nonShipt participants purchased more unhealthy, or red items than green (46% versus 25%). Although our qualitative data suggests that Shipt supported access to healthier food choices because of its partnership with supermarkets, users did not note making healthier choices or say that the Shipt design infuenced their inclinations toward making healthier selections. Two Shipt participants (S1, S2) explicitly noted no change in their shopping behaviors. When asked whether LoveBug (S1) thought her choice of food items was healthier than when she shopped in person, she replied, \"No, it’s the same.\" However, Rudy (S8) noted a reduced inclination to make impulsive purchases when using the service. Below are two excerpts from her interview:"
    }, {
      "page": 9,
      "region": {
        "x1": 341.26800537109375,
        "x2": 535.327880859375,
        "y1": 283.2724609375,
        "y2": 385.42999267578125
      },
      "text": "When I go and do my grocery shopping, if there’s a line I may be tempted to get a candy bar or the theater boxes of candy. And I didn’t have to deal with that. I always make impulse purchases when I go to the store, when I go to Target. ... If I shop online, I’m gonna get exactly—for the most part, I’m gonna get exactly what I want. And I don’t have to worry about getting other things... – Rudy, S8"
    }, {
      "page": 9,
      "region": {
        "x1": 317.487548828125,
        "x2": 559.8866577148438,
        "y1": 398.7144775390625,
        "y2": 476.96099853515625
      },
      "text": "We believe based on our results that there may be opportunities to provide nutritional information in comprehensible labels [21] for each product on the Shipt website. There is also an opportunity to help participants determine the freshness of items, such as produce, to infuence healthier selections. We provide supporting results and further insights in our Discussion."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 252.06370544433594,
        "y1": 351.4404602050781,
        "y2": 357.8663330078125
      },
      "text": "RQ2: Propensity to Select Healthier Choices"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 317.47698974609375,
        "x2": 574.5272216796875,
        "y1": 511.7904968261719,
        "y2": 709.5889892578125
      },
      "text": "We address our frst two research questions by summarizing our results. We then discuss insights to broader policy implications to improve the feasibility of online grocery delivery services within low-income and transportation-scarce regions. We conclude by contributing design implications for how online-grocery service interfaces can address participant barriers to using such services. To answer our fnal research question, we leverage past HCI literature to support our implications and further extend the literature. In summary, transportation models used among onlinegrocery delivery services, like Shipt, serve as a feasible model to provide healthy-food access to low-income and transportationscarce individuals (RQ1). Participants had an overwhelmingly positive response and all agreed that they would use the service again. The majority of our participants agreed that such services provided a convenient and accessible solution to their limited access to health foods and spoke highly of"
    }, {
      "page": 10,
      "region": {
        "x1": 53.31999969482422,
        "x2": 295.7253112792969,
        "y1": 96.09944915771484,
        "y2": 246.0770263671875
      },
      "text": "their overall experience. From a consumer perspective, shoppers satisfactorily met customer service expectations. This is despite participants’ stated preference to shop in-person for certain items themselves. Yet we did identify drawbacks of the service and found that none of the participants was using the service after 1 month. Participants mentioned reasons related to afordability such as cost, the lack of sales, and the fact that the service did not accept EBT. In addition, other participants thought that items were more expensive online. While the inability to inspect items in person was noted as a barrier, it did not appear to have stopped participants from purchasing their normal items. In addition, only two participants noted technology concerns."
    }, {
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.7296142578125,
        "y1": 251.51644897460938,
        "y2": 329.76300048828125
      },
      "text": "The analysis of our interviews revealed that our Shipt participants did not notice a change in their shopping behaviors but they appeared to have purchased a higher percentage of healthy items than those in our control group. We discuss policy and design implications to improve upon the feasibility of such services and the potential for them to encourage healthier food options (RQ3)."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 393.00323486328125,
        "y1": 496.9360046386719,
        "y2": 503.36187744140625
      },
      "text": "5 DISCUSSION"
    }
  }, {
    "paragraphs": [{
      "page": 10,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7301330566406,
        "y1": 378.241455078125,
        "y2": 468.4429931640625
      },
      "text": "Unsurprisingly, in the U.S., vehicle ownership alone translates into one of the best predictors of upward social mobility [6–8]. However, the U.S. has reduced [33] and proposed further reduction in transportation funding [18]. This will translate into further disparities in health (as well as income, education, and employment) for millions of U.S. citizens who live without their own transportation [63], many of them with low income [62]."
    }, {
      "page": 10,
      "region": {
        "x1": 53.54899978637695,
        "x2": 295.724365234375,
        "y1": 473.8834533691406,
        "y2": 635.8159790039062
      },
      "text": "We contribute empirical results that suggest that an afordable online grocery delivery model could serve as a feasible solution to improving healthy-food access to low-income and transportation-scarce individuals. Similar to past HCI research [20], we found the lack of afordability of such services and infexible payment methods to be barriers among our target population. Some technological limitations exist, but not many. Interestingly, we found store and brand loyalty as well as community to play a role in participants’ selections and choice to continue using the service. Therefore, to mitigate issues of afordability and to promote community, we propose the following policy implications: (1) enable fexible payments and subsidies and (2) facilitate compatibility with local vendors."
    }, {
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.7290954589844,
        "y1": 654.4064331054688,
        "y2": 708.7420043945312
      },
      "text": "Enable flexible payments and subsidies. Based on the receipts we received, most of our non-Shipt participants used EBT as a form of payment. Only one Shipt participant noted receiving SNAP benefts, and she stated that she would continue to use the online grocery delivery service if it accepted"
    }, {
      "page": 10,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.8839111328125,
        "y1": 96.10189056396484,
        "y2": 210.21197509765625
      },
      "text": "EBT. Given that nearly 33% of SNAP participants are in households with older adults or people with disabilities [5] and that these populations often have more limited access to transportation, online-grocery delivery services are missing a critical opportunity to reduce health disparities. In addition, the credit-card only policy excludes “unbanked” populations, many of which are poor and have low incomes [38]. Therefore, future policies should work to require the acceptance of multiple payment methods such as EBT and cash as noted in prior work [19]."
    }, {
      "page": 10,
      "region": {
        "x1": 317.70599365234375,
        "x2": 559.88720703125,
        "y1": 215.65145874023438,
        "y2": 449.31500244140625
      },
      "text": "We found that some of our non-Shipt participants experienced transportation barriers related to service reliability and quality, which is consistent with past research [20]. These participants received transportation support from their insurance companies; however, participants described these services as having low quality and being unreliable. In contrast, our Shipt participants described their shoppers as providing high quality and being reliable. However, we found that only two of our Shipt participants felt that the membership fees for the service were afordable. To mitigate barriers to entry to such services and to promote service quality and reliability, we envision an opportunity for insurance companies or the federal government (as a part of SNAP/EBT benefts) to provide subsidies to use such services. These subsidies could incentivize online grocery delivery services to accept multiple payment forms. Insurance companies could also incentivize SNAP/EBT recipients by sharing a log of purchases as a way to promote healthier options as we discuss later. Future research is needed to fully understand these trade-ofs."
    }, {
      "page": 10,
      "region": {
        "x1": 317.95166015625,
        "x2": 559.8837280273438,
        "y1": 480.657470703125,
        "y2": 570.8590087890625
      },
      "text": "Facilitate compatibility with local vendors. In a systematic review of studies that focused on food desert and food access research in the U.S., Walker et al. [61] found that increasing access to healthy foods does not necessarily increase consumption. They found that residents who were provided access to a new grocery store did not switch to the new store because of loyalty and familiarity with their current store and afordability (i.e., the new store was more expensive)."
    }, {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.88720703125,
        "y1": 576.2984008789062,
        "y2": 702.365966796875
      },
      "text": "Similarly, we found that participants from both the Shipt and control groups were loyal to certain brands and certain local markets, often the only afordable option in the neighborhood. We also found that participants shopped multiple grocery stores based on where participants could fnd the best quality of certain items. Therefore, to ensure that larger grocery outlets do not put smaller ones at risk, policy implications may need to incentivize partnerships with local markets. Given the conditions that our participants faced, if local markets are at risk of losing business to online grocery store delivery services, and our participants are not able to"
    }, {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.7234802246094,
        "y1": 96.09944915771484,
        "y2": 126.5260009765625
      },
      "text": "make use of the local grocery stores, those with limited access to healthy food might risk losing their existing access to groceries."
    }],
    "title": {
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 288.0286865234375,
        "y1": 351.4316711425781,
        "y2": 369.8126525878906
      },
      "text": "Policy Recommendations to Bolster Afordability of Healthy-Food Access"
    }
  }, {
    "paragraphs": [{
      "page": 11,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7314147949219,
        "y1": 170.22146606445312,
        "y2": 415.84100341796875
      },
      "text": "Our results show that our participants using online grocery delivery services had access to healthy food and appeared to purchase healthier foods overall. Surprisingly and most promising is that contrary to prior literature that reported that making healthy food more accessible might not lead to healthier selection [14], our results suggest that in the case of online delivery, it could. What is unclear is whether it was the fact that healthier food was accessible, or that the online intervention played a role in raising awareness of healthy foods with the actual purchase of healthy food [14]. Based on our interview results with both Shipt and non-Shipt participants and the prior HCI literature, we address our fnal research question by presenting two opportunities to enhance the design of online grocery delivery models to potentially lead to healthier food purchases. The frst opportunity is to promote healthy recipes based on (1) past participant purchases, (2) past community purchases or nearby shoppers, and (3) store items on sale. We specifcally recommend raising awareness about the healthiest-purchased items to the online shopping community. The second opportunity is to make food quality more salient."
    }, {
      "page": 11,
      "region": {
        "x1": 53.42698669433594,
        "x2": 295.7345886230469,
        "y1": 429.6484680175781,
        "y2": 711.1329956054688
      },
      "text": "Promote healthy recipes. Past HCI research in health has promoted the use of sensing and crowdsourcing technologies as a way to encourage healthy eating [11, 12, 36, 45, 55]. Online grocery delivery services automatically track customer purchases and maintain a history of such purchases. This eliminates the need for complex tracking methods used for monitoring and sensing that has been proposed in this earlier work and easier to integrate the research exploring how user interface changes can impact people’s choices [31, 32]. As one of our participants noted, she was less likely to make last-minute candy purchases at the time of checkout when shopping online. In the same way grocery store owners use techniques to nudge these behaviors, designers of online grocery store delivery could encourage healthier behaviors as well. For example, suggesting recipes based on past purchases could further encourage both healthier purchases and healthier behaviors. It is important to point out that the majority of our participants were of African-American descent and from lowsocioeconomic areas. According to James, conceptions of health by this population show that eating healthy may mean giving up one’s cultural heritage and conforming to the dominant culture [28]. Past HCI research has nonetheless examined how culture and sociotechnical context infuence the"
    }, {
      "page": 11,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8870849609375,
        "y1": 96.1018295288086,
        "y2": 425.4049987792969
      },
      "text": "nutrition selection of individuals with low-socioeconomic backgrounds [34, 48]. For example, one of our participants noted that online grocery delivery services could take away from individuals’ ability to be social. On the other hand, many of our participants faced social isolation as a result of having limited transportation access. To accommodate both sides, we propose that the intervention make salient the top healthy items purchased in a community as well as making recipes available based on these purchases salient. This could be easily done given our metric for assessing healthy foods using the “green,” “amber,” or “red” taxonomy. Another option is to leverage the United States Department of Agriculture’s (USDA) ChooseMyPlate guidelines for healthy eating 1. This is consistent with Siek et al.’s [56] suggestion to provide users with meaningful and actionable advice. Further, research from Parker and Grinter found that health systems should account for collectivisim, “a cultural value often ascribed to the African American population” [49, p.185]. Therefore, we suggest an option to promote healthy recipes, and thus healthy-food selection and behaviors not only based on an individual’s past purchases, but on the community’s. Finally, because we recruited participants from low-income areas, service afordability might be problematic. Therefore, we suggest providing recommendations for healthy foods based on store items that are on sale or making digital coupon codes available for shoppers. We believe that such practices could also address participant concerns that the items online were more expensive than in person."
    }, {
      "page": 11,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8812866210938,
        "y1": 437.6594543457031,
        "y2": 711.9100341796875
      },
      "text": "Make food quality salient. Although Shipt participants appreciated the service, there was some reluctance to purchase foods like meat and produce because these items could easily spoil. To address this concern, online grocery services could ofer a free trial for produce to ensure the quality of items that customers would receive. Some grocery delivery websites like FreshDirect 2 use “expert” (i.e. produce managers) star rating systems. Participants wanted to choose and feel the items for themselves, which could be partly mitigated by live streaming or talking directly with the shopper or expert. These sites could also include more information such as the nutritional facts label and expiry dates. This issue is somewhat unique to online grocery-shopping; however, we believe, like noted in past research [29], the existing rating system within the service might ensure that high-quality foods are selected. No customers mentioned communicating with their shoppers before placing their order; however, future research should investigate the communication between the two stakeholders as well as the efectiveness of rating systems as a way to ensure high-quality items have been selected. 1https://www.choosemyplate.gov/ 2http://www.freshdirect.com"
    }],
    "title": {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 285.69744873046875,
        "y1": 143.41262817382812,
        "y2": 161.79364013671875
      },
      "text": "Design Opportunities to Support Healthier Choices in Online Grocery Service Delivery"
    }
  }, {
    "paragraphs": [{
      "page": 12,
      "region": {
        "x1": 53.31999969482422,
        "x2": 295.73016357421875,
        "y1": 111.0434799194336,
        "y2": 284.9320068359375
      },
      "text": "We acknowledge that a longer-term study that provides additional fnancial supplements and recruits more participants could give us a better understanding of participant purchase behavior. This would allow for a sufcient comparison between groups. In hindsight, we acknowledge that more objective and subjective data collected in the forms of receipts and interview questions about shopping behavior from the previous month, as well as an investigation of children’s role in the participants’ household, could have also provided a more accurate interpretation of our results. This is data we will collect in any future iterations of this study. Nevertheless, our descriptive statistics, qualitative data results, and past research fndings build our confdence that such services increase access to healthy foods and could lead to healthier food purchases."
    }],
    "title": {
      "page": 12,
      "region": {
        "x1": 53.79800033569336,
        "x2": 132.45272827148438,
        "y1": 96.18911743164062,
        "y2": 102.614990234375
      },
      "text": "6 LIMITATIONS"
    }
  }, {
    "paragraphs": [{
      "page": 12,
      "region": {
        "x1": 53.31999969482422,
        "x2": 305.4983825683594,
        "y1": 314.08245849609375,
        "y2": 559.7009887695312
      },
      "text": "We conducted a 1-month pilot study that consisted of a controlled feld experiment with 20 individuals from transportationscarce and low-income areas in southeastern Michigan to understand the feasibility of an online grocery delivery service to provide access to healthy foods. We also sought to understand whether these services could lead to healthier food choices and the opportunities for them to do so. We found that the service not only provided participants with access to healthy food but that our Shipt group purchased a higher percentage of healthy grocery items overall. We contribute policy implications involving fexible payments and subsidies and compatibility with local vendors to support such services in providing healthy-food access to individuals with limited access to transportation and healthy foods. We contribute design opportunities to promote healthy recipes during sales and in a community-oriented way, and to make nutritional information more salient to encourage healthier food choices. Our work provides implications for how the CHI community can design online grocery-store delivery services to better meet the needs of individuals who may live in “food deserts”."
    }, {
      "page": 12,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.7301330566406,
        "y1": 565.1404418945312,
        "y2": 631.4320068359375
      },
      "text": "Going forward, we would like to understand whether our design implications infuence healthier food selections. If this proves successful, we would like to conduct a longitudinal study to examine whether these interventions lead to sustained healthier food selection over time. Finally, we focused on the consumer side of online grocery delivery."
    }],
    "title": {
      "page": 12,
      "region": {
        "x1": 53.79800033569336,
        "x2": 236.7511749267578,
        "y1": 299.22833251953125,
        "y2": 305.6542053222656
      },
      "text": "7 CONCLUSION AND FUTURE WORK"
    }
  }, {
    "paragraphs": [{
      "page": 12,
      "region": {
        "x1": 53.31999969482422,
        "x2": 295.5777282714844,
        "y1": 660.5824584960938,
        "y2": 713.5889892578125
      },
      "text": "We thank Jacob Berman for his initial investigations on this project, Joey Hsiao and Josh Errickson from the UM CSCAR for statistical consultation, and other members of the Social Innovations Group who provided us with early feedback. This work was supported by the NSF award CMMI 1636876."
    }],
    "title": {
      "page": 12,
      "region": {
        "x1": 53.79800033569336,
        "x2": 182.544677734375,
        "y1": 645.728271484375,
        "y2": 652.1541748046875
      },
      "text": "8 ACKNOWLEDGEMENTS"
    }
  }, {
    "paragraphs": [{
      "page": 12,
      "region": {
        "x1": 321.6610107421875,
        "x2": 558.9947509765625,
        "y1": 110.35456848144531,
        "y2": 115.5670166015625
      },
      "text": "[1] 2012. National Study Quantifes the “Sharing Economy” Move-"
    }, {
      "page": 12,
      "region": {
        "x1": 317.9550476074219,
        "x2": 559.5504150390625,
        "y1": 120.31721496582031,
        "y2": 683.4366455078125
      },
      "text": "ment. Technical Report. Mithun Campbell. Retrieved on Jan. 3, 2018 from http://www.prnewswire.com/news-releases/national-studyquantifes-the-sharing-economy-movement-138949069.html. [2] 2014. Healthy choices food and drink classifcation guide. Victoria State Government (12 Sep 2014). https: //www2.health.vic.gov.au/getfle/?scitemid=%7B68647AE7A36C-4533-8FE2-DEDD1C6BECA9%7D&title=Healthy%20choices% 20food%20and%20drink%20classifcation%20guide [3] 2015. The Sharing Economy. Technical Report. PWC United States. Retrieved on Aug. 13, 2017 from https: //www.pwc.com/us/en/technology/publications/assets/pwcconsumer-intelligence-series-the-sharing-economy.pdf. [4] FARZAD ALEMI. 2018. What Makes Travelers Use Ridehailing? Exploring the Latent Constructs behind the Adoption and Frequency of Use of Ridehailing Services, and Their Impacts on the Use of Other Travel Modes. Ph.D. Dissertation. UNIVERSITY OF CALIFORNIA DAVIS. [5] Policy Basics. 2018. The Supplemental Nutrition Assistance Program (SNAP). Retrieved Sept. 9, 2018 from https://www.cbpp.org/research/ policy-basics-the-supplemental-nutrition-assistance-program-snap [6] Mikayla Bouchard. 2015. Transportation Emerges as Crucial to Escaping Poverty. http://www.nytimes.com/2015/05/07/upshot/ transportation-emerges-as-crucial-to-escaping-poverty.html. The New York Times (7 May 2015). Accessed:2016-04-23. [7] Raj Chetty, Nathaniel Hendren, and Lawrence F Katz. 2015. The Efects of Exposure to Better Neighborhoods on Children: New Evidence from the Moving to Opportunity Experiment. American Economic Review 106, August (2015), 90. https://doi.org/10.3386/w21156 [8] Raj Chetty, Nathaniel. Hendren, Patrick Kline, and Emmanuel Saez. 2014. Where is the land of Opportunity? The Geography of Intergenerational Mobility in the United States. The Quarterly Journal of Economics 129, 4 (September 2014), 1553–1623. https://doi.org/ 10.1093/qje/qju022 [9] Chanjin Chung and Samuel L Myers Jr. 1999. Do the poor pay more for food? An analysis of grocery store availability and food price disparities. Journal of consumer afairs 33, 2 (1999), 276–296. [10] Rob Comber, Jettie Hoonhout, Aart van Halteren, Paula Moynihan, and Patrick Olivier. 2013. Food Practices As Situated Action: Exploring and Designing for Everyday Food Practices with Households. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13). ACM, New York, NY, USA, 2457–2466. https://doi.org/10.1145/2470654.2481340 [11] Rob Comber, Jack Weeden, Jennifer Hoare, Stephen Lindsay, Gemma Teal, Alastair Macdonald, Lisa Methven, Paula Moynihan, and Patrick Olivier. 2012. Supporting visual assessment of food and nutrient intake in a clinical care setting. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 919–922. [12] Kay Connelly, Katie A Siek, Beenish Chaudry, Josette Jones, Kim Astroth, and Janet L Welch. 2012. An ofine mobile nutrition monitoring intervention for varying-literacy patients receiving hemodialysis: a pilot study examining usage and usability. Journal of the American Medical Informatics Association 19, 5 (2012), 705–712. [13] Catherine Crook. [n. d.]. The 8 Best Grocery Delivery Services to Try in 2018. verywellft ([n. d.]). https://www.verywellft.com/bestgrocery-delivery-services-4159966 [14] Steven Cummins, Ellen Flint, and Stephen A Matthews. 2014. New neighborhood grocery store increased awareness of food access but did not alter dietary habits or obesity. Health afairs 33, 2 (2014), 283–291."
    }, {
      "page": 13,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.3905029296875,
        "y1": 97.40254211425781,
        "y2": 700.3740234375
      },
      "text": "[15] Steven Cummins and Sally Macintyre. 2002. “Food deserts”- evidence and assumption in health policy making. BMJ: British Medical Journal 325, 7361 (2002), 436. [16] Steven CJ Cummins. 2003. The local food environment and health: some refections from the United Kingdom. American journal of public health 93, 4 (2003), 521–521. [17] Pamela N. Danziger. 2018. Online Grocery Sales To Reach $100 Billion In 2025; Amazon Is Current And Future Leader. https://www.forbes.com/sites/pamdanziger/2018/01/18/onlinegrocery-sales-to-reach-100-billion-in-2025-amazon-set-to-bemarket-share-leader/ [18] Stacy Dean. 2017. President’s budget would shift substantial costs to states and cut food assistance for millions. Center on Budget and Policy Priorities (2017). [19] Tawanna R Dillahunt, Vaishnav Kameswaran, Linfeng Li, and Tanya Rosenblat. 2017. Uncovering the values and constraints of real-time ridesharing for low-resource populations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2757– 2769. [20] Tawanna R. Dillahunt and Tifany R. Veinot. 2018. Getting There: Barriers and Facilitators to Transportation Access in Underserved Communities. ACM Transactions on Computer-Human Interaction (TOCHI) (2018), to appear. [21] Elizabeth K Dunford, Jennifer M Poti, Dagan Xavier, Jacqui L Webster, and Lindsey Smith Taillie. 2017. Color-Coded Front-of-Pack Nutrition LabelsâĂŤAn Option for US Packaged Foods? Nutrients 9, 5 (2017), 480. [22] Maliheh Ghajargar, Giovanni Zenezini, and Teodoro Montanaro. 2016. Home delivery services: innovations and emerging needs. IFACPapersOnLine 49, 12 (2016), 1371–1376. [23] Marie Glasemann, Anne Marie Kanstrup, and Thomas Ryberg. 2010. Making chocolate-covered broccoli: designing a mobile learning game about food for young people with diabetes. In Proceedings of the 8th ACM conference on Designing Interactive Systems. ACM, 262–271. [24] Deja Hendrickson, Chery Smith, and Nicole Eikenberry. 2006. Fruit and vegetable access in four low-income food deserts communities in Minnesota. Agriculture and Human Values 23, 3 (2006), 371–383. [25] Jennifer Hiser and Rodolfo M Nayga. [n. d.]. An exploratory analysis of familiarity and willingness to use online food shopping services in a local area of Texas. Journal of Food Distribution Research 30 ([n. d.]), 78–90. [26] Joey Chiao-Yin Hsiao, Carol Moser, Sarita Schoenebeck, and Tawanna R. Dillahunt. 2018. The Role of Demographics, Trust, Computer Self-efcacy, and Ease of Use in the Sharing Economy. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies (COMPASS ’18). ACM, New York, NY, USA, Article 37, 11 pages. https://doi.org/10.1145/3209811.3209816 [27] Betty T Izumi, Shannon N Zenk, Amy J Schulz, Graciela B Mentz, and Christine Wilson. 2011. Associations between neighborhood availability and individual consumption of dark-green and orange vegetables among ethnically diverse adults in Detroit. Journal of the American Dietetic Association 111, 2 (2011), 274–279. [28] Delores James. 2004. Factors infuencing food choices, dietary intake, and nutrition-related attitudes among African Americans: application of a culturally sensitive model. Ethnicity and Health 9, 4 (2004), 349– 367. [29] Vaishnav Kameswaran, Lindsey Cameron, and Tawanna R. Dillahunt. 2018. Support for Social and Cultural Capital Development in Realtime Ridesharing Services. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). ACM, New York, NY, USA, Article 342, 12 pages. https://doi.org/10.1145/3173574.3173916"
    }, {
      "page": 13,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.1435546875,
        "y1": 97.40254211425781,
        "y2": 212.20428466796875
      },
      "text": "[30] Min Kyung Lee, Tawanna Dillahunt, Bryan Pendleton, Robert Kraut, and Sara Kiesler. 2009. Tailoring websites to increase contributions to online communities. In CHI’09 Extended Abstracts on Human Factors in Computing Systems. ACM, 4003–4008. [31] Min Kyung Lee, Sara Kiesler, and Jodi Forlizzi. 2011. Mining behavioral economics to design persuasive technology for healthy choices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 325–334. [32] Thomas C Leonard. 2008. Richard H. Thaler, Cass R. Sunstein, Nudge: Improving decisions about health, wealth, and happiness. [33] Alec MacGillis. 2016. The Third Rail. Places Journal (2016). [34] Julie Maitland, Matthew Chalmers, and Katie A Siek. 2009. Persuasion"
    }, {
      "page": 13,
      "region": {
        "x1": 317.94708251953125,
        "x2": 559.5474853515625,
        "y1": 216.9545440673828,
        "y2": 710.3359985351562
      },
      "text": "not required Improving our understanding of the sociotechnical context of dietary behavioural change. In Pervasive computing technologies for Healthcare, 2009. PervasiveHealth 2009. 3rd International conference on. IEEE, 1–8. [35] Sally Malam, Sue Clegg, Sarah Kirwan, Stephen McGinigal, Monique Raats, Richard Shepherd, Julie Barnett, Victoria Senior, Charo Hodgkins, and Moira Dean. 2009. Comprehension and use of UK nutrition signpost labelling schemes. (2009). [36] Jennifer Mankof, Gary Hsieh, Ho Chak Hung, Sharon Lee, and Elizabeth Nitao. 2002. Using low-cost sensing to support nutritional awareness. In International conference on ubiquitous computing. Springer, 371–378. [37] Katie S Martin, Debarchana Ghosh, Martha Page, Michele Wolf, Kate McMinimee, and Mengyao Zhang. 2014. What role do local grocery stores play in urban food environments? A case study of HartfordConnecticut. PloS one 9, 4 (2014), e94033. [38] Alan McIntyre. 2017. Banks Need to Focus on a New Customer: The Unbanked. https://www.forbes.com/sites/alanmcintyre/2017/ 05/10/banks-need-to-focus-on-a-new-customer-the-unbanked/ #4056d07b59c8 [39] Elizabeth Mendes. 2012. Americans Spend $151 a Week on Food; the High-Income, $180. (August 2012). https://news.gallup.com/poll/ 156416/americans-spend-151-week-food-high-income-180.aspx [40] Michelle A Morganosky and Brenda J Cude. 2000. Consumer response to online grocery shopping. International Journal of Retail & Distribution Management 28, 1 (2000), 17–26. [41] Carol Moser. 2018. Impulse Buying: Interventions to Support Selfcontrol with E-commerce. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA ’18). ACM, New York, NY, USA, Article DC14, 4 pages. https://doi.org/10.1145/ 3170427.3173026 [42] Carol Moser, Chanda Phelan, Paul Resnick, Sarita Y. Schoenebeck, and Katharina Reinecke. 2017. No Such Thing As Too Much Chocolate: Evidence Against Choice Overload in E-Commerce. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17). ACM, New York, NY, USA, 4358–4369. https://doi.org/10.1145/ 3025453.3025778 [43] Emily Namey. 2008. Data reduction techniques for large qualitative data sets. Handbook for team-based qualitative research 2, 1 (2008), 137–161. [44] Nielsen and FMI. 2018. Second Year Findings of FMI and Nielsen Digitally Engaged Food Shopper Study is Released and Identifes Six Digital Imperatives for Omnichannel Success. (Jan 2018). https://www.fmi.org/newsroom/latest-news/view/2018/01/29/fmiand-nielsen-report-70-of-consumers-will-be-grocery-shoppingonline-by-2024 [45] Jon Noronha, Eric Hysen, Haoqi Zhang, and Krzysztof Z Gajos. 2011. Platemate: crowdsourcing nutritional analysis from food photographs. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 1–12."
    }, {
      "page": 14,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.39056396484375,
        "y1": 97.40254211425781,
        "y2": 451.3080139160156
      },
      "text": "[46] United States Department of Agriculture Food and Nutrition Service. 2018. Supplemental Nutrition Assistance Program (SNAP). Retrieved Sept. 3, 2018 from https://www.fns.usda.gov/snap/supplementalnutrition-assistance-program-snap [47] Rita Orji and Karyn Mofatt. 2018. Persuasive technology for health and wellness: State-of-the-art and emerging trends. Health informatics journal 24, 1 (2018), 66–91. [48] Andrea Parker, Vasudhara Kantroo, Hee Rin Lee, Miguel Osornio, Mansi Sharma, and Rebecca Grinter. 2012. Health promotion as activism: building community capacity to efect social change. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 99–108. [49] Andrea G Parker and Rebecca E Grinter. 2014. Collectivistic health promotion tools: Accounting for the relationship between culture, food and nutrition. International Journal of Human-Computer Studies 72, 2 (2014), 185–206. [50] Courtney A Pinard, C Byker Shanks, SM Harden, and AL Yaroch. 2016. An integrative literature review of small food store research across urban and rural communities in the US. Preventive medicine reports 3 (2016), 324–332. [51] Lisa M Powell, Sandy Slater, Donka Mirtcheva, Yanjun Bao, and Frank J Chaloupka. 2007. Food store availability and neighborhood characteristics in the United States. Preventive medicine 44, 3 (2007), 189–195. [52] Paul L Robinson, Fred Dominguez, Senait Teklehaimanot, Martin Lee, Arleen Brown, and Michael Goodchild. 2013. Does distance decay modelling of supermarket accessibility predict fruit and vegetable intake by individuals in a large metropolitan area? Journal of health care for the poor and underserved 24, 1 0 (2013), 172. [53] Donald Rose and Rickelle Richards. 2004. Food store access and household fruit and vegetable use among participants in the US Food Stamp Program. Public health nutrition 7, 8 (2004), 1081–1088. [54] Johnny Saldaña. 2012. The Coding Manual for Qualitative Researchers (2 ed.). Thousand Oaks, CA: Sage. [55] Katie A Siek, Kay H Connelly, Yvonne Rogers, Paul Rohwer, Desiree Lambert, and Janet L Welch. 2006. When do we eat? An evaluation of food items input into an electronic food monitoring application. In"
    }, {
      "page": 14,
      "region": {
        "x1": 317.9550476074219,
        "x2": 558.202880859375,
        "y1": 97.40254211425781,
        "y2": 112.5780029296875
      },
      "text": "Pervasive Health Conference and Workshops, 2006. IEEE, 1–10. [56] Katie A Siek, Jefrey S LaMarche, and Julie Maitland. 2009. Bridging"
    }, {
      "page": 14,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.431396484375,
        "y1": 117.32752990722656,
        "y2": 449.427001953125
      },
      "text": "the information gap: collaborative technology design with low-income at-risk families to engender healthy behaviors. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7. ACM, 89–96. [57] Aaron Smith. 2016. Shared, Collaborative and On Demand: The New Digital Economy. Retrieved on Aug 1, 2017 from http: //www.pewinternet.org/2016/05/19/the-new-digital-economy/. [58] Sandra Susan Smith. 2007. Lone pursuit: Distrust and defensive individualism among the black poor. Russell Sage Foundation. [59] Jacob Thebault-Spieker, Loren Terveen, and Brent Hecht. 2017. Toward a Geographic Understanding of the Sharing Economy: Systemic Biases in UberX and TaskRabbit. ACM Trans. Comput.-Hum. Interact. 24, 3, Article 21 (April 2017), 40 pages. https://doi.org/10.1145/3058499 [60] Pieter van de Glind. 2013. The consumer potential of Collaborative Consumption: Identifying the motives of Dutch Collaborative Consumers & Measuring the consumer potential of Collaborative Consumption within the municipality of Amsterdam. Master’s thesis. http://dspace.library.uu.nl/handle/1874/280661 [61] Renee E Walker, Christopher R Keane, and Jessica G Burke. 2010. Disparities and access to healthy food in the United States: A review of food deserts literature. Health & place 16, 5 (2010), 876–884. [62] Richard Wallace, Paul Hughes-Cromwick, Hillary Mull, and Snehamay Khasnabis. 2005. Access to health care and nonemergency medical transportation: two missing links. Transportation Research Record: journal of the transportation research board 1924 (2005), 76–84. [63] GB White. 2015. Stranded: How America’s failing public transportation increases inequality. The Atlantic. [64] Neil Wrigley, Daniel Warm, and Barrie Margetts. 2003. Deprivation, diet, and food-retail access: Findings from the Leeds ’food deserts’ study. Environment and Planning A 35, 1 (2003), 151–188. [65] Neil Wrigley, Daniel Warm, Barrie Margetts, and Michelle Lowe. 2004. The Leeds \"food deserts\" intervention study: what the focus groups reveal. International Journal of Retail & Distribution Management 32, 2 (2004), 123–136."
    }],
    "title": {
      "page": 12,
      "region": {
        "x1": 317.9549865722656,
        "x2": 380.7193603515625,
        "y1": 96.18911743164062,
        "y2": 102.614990234375
      },
      "text": "REFERENCES"
    }
  }]
}