{
  "abstractText": {
    "page": 0,
    "region": {
      "x1": 53.54899978637695,
      "x2": 295.7409973144531,
      "y1": 181.75697326660156,
      "y2": 406.364013671875
    },
    "text": "ABSTRACT HCI scholars have become increasingly interested in describing the complex nature of UX practice. In parallel, HCI and STS scholars have sought to describe the ethical and valueladen relationship between designers and design outcomes. However, little research describes the ethical engagement of UX practitioners as a form of design complexity, including the multiple mediating factors that impact ethical awareness and decision-making. In this paper, we use a practice-led approach to describe ethical complexity, presenting three varied cases of UX practitioners based on in situ observations and interviews. In each case, we describe salient factors relating to ethical mediation, including organizational practices, self-driven ethical principles, and unique characteristics of specific projects the practitioner is engaged in. Using the concept of mediation from activity theory, we provide a rich account of practitioners’ ethical decision making. We propose future work on ethical awareness and design education based on the concept of ethical mediation."
  },
  "figures": [{
    "caption": "Figure 1: The relationship of the designer to knowledge and work practices via ethical mediators.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 295.8390808105469,
      "y1": 315.90826416015625,
      "y2": 334.1299743652344
    },
    "figType": "Figure",
    "imageText": ["Represent", "in", "Inscribe", "StrengthenE", "xt", "en", "d", "Co", "ns", "tra", "Shape", "Designer", "(A)", "Individual’s", "Practices", "Applied", "Ethics", "(C)", "(B)", "Organizational", "Practices"],
    "name": "1",
    "page": 8,
    "regionBoundary": {
      "x1": 67.0,
      "x2": 280.0,
      "y1": 96.0,
      "y2": 299.0
    }
  }, {
    "caption": "Table 1: Participant demographics and data collection details.",
    "captionBoundary": {
      "x1": 181.5780029296875,
      "x2": 430.1156005859375,
      "y1": 212.25338745117188,
      "y2": 217.89300537109375
    },
    "figType": "Table",
    "imageText": ["9.5", "hours", "in", "3", "sessions", "+", "90", "mins", "of", "Interview", "User", "Experience", "Designer", "Network", "Enterprise", "for", "Customer", "Experience", "Martha", "(9)", "BS", "in", "Computational", "Media", "Design", "Lead/Manager", "10", "hours", "in", "3", "sessions", "+", "90", "mins", "of", "Interview", "Agency", "or", "Consultancy", "James", "(11)", "MS", "in", "Interaction", "Design", "7", "hours", "in", "2", "sessions", "+", "60", "mins", "of", "Interview", "Business", "Strategist", "and", "Interaction", "Designer", "John", "(6)", "MS", "in", "Interdisciplinary", "ESE,", "PhD", "(current)", "Agency", "or", "Consultancy", "Education", "Industry", "Type", "Role", "Observation", "&", "Interview", "Details", "Name", "(Years", "of", "Experience)"],
    "name": "1",
    "page": 3,
    "regionBoundary": {
      "x1": 53.0,
      "x2": 559.0,
      "y1": 92.0,
      "y2": 210.0
    }
  }],
  "sections": [{
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.79798889160156,
        "x2": 294.0487060546875,
        "y1": 435.87359619140625,
        "y2": 466.6679992675781
      },
      "text": "•Human-centered computing→ Empirical studies in interaction design; Empirical studies in HCI ; • Social and professional topics→ Codes of ethics."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 128.51052856445312,
        "y1": 421.38787841796875,
        "y2": 427.81402587890625
      },
      "text": "CCS CONCEPTS"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.79798126220703,
        "x2": 292.0233154296875,
        "y1": 496.1775817871094,
        "y2": 503.06201171875
      },
      "text": "UX design; practice-led research; applied ethics; mediation"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.79798126220703,
        "x2": 111.39408111572266,
        "y1": 481.6918640136719,
        "y2": 488.1180114746094
      },
      "text": "KEYWORDS"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.6168212890625,
        "y1": 524.0775146484375,
        "y2": 574.1080322265625
      },
      "text": "Colin M. Gray and Shruthi Sai Chivukula. 2019. Ethical Mediation in UX Practice. In CHI Conference on Human Factors in Computing Systems Proceedings (CHI 2019), May 4–9, 2019, Glasgow, Scotland UK. ACM, New York, NY, USA, 11 pages. https://doi.org/10.1145/ 3290605.3300408"
    }, {
      "page": 0,
      "region": {
        "x1": 53.24800109863281,
        "x2": 295.0179748535156,
        "y1": 585.2767333984375,
        "y2": 712.3289794921875
      },
      "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than the author(s) must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. CHI 2019, May 4–9, 2019, Glasgow, Scotland UK © 2019 Copyright held by the owner/author(s). Publication rights licensed to ACM. ACM ISBN 978-1-4503-5970-2/19/05. . . $15.00 https://doi.org/10.1145/3290605.3300408"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.46697998046875,
        "x2": 151.33087158203125,
        "y1": 513.6744384765625,
        "y2": 519.3140258789062
      },
      "text": "ACM Reference Format:"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.898193359375,
        "y1": 196.24258422851562,
        "y2": 657.4229736328125
      },
      "text": "HCI scholars have become increasingly interested in describing the complex nature of UX practice, influenced by a “turn to design” in the 1990s [28] and a “turn to practice” in the 2010s [29]. As part of these “turns”—in conjunction with third-paradigm assumptions about the nature of HCI practice [24]—attention has turned from a focus primarily on theory-building to an understanding of the subjective-yetprofessional knowledge that designers rely upon to support their practice [46]. In parallel with this increased interest in studying design practice on its own terms, HCI and STS scholars have also sought to describe the ethical and valueladen relationship between designers and design outcomes (e.g., [1, 18, 41, 43]), and the role of design knowledge in informing ethically-centered practice [20, 49]. However, despite decades of interest by design and technology scholars regarding the importance of engaging in ethical practice (e.g., [1, 13, 18, 33, 38, 39]), little research describes the ethical engagement of design practitioners on the ground and on its own terms. Practice-led research efforts, exemplified by the work of Goodman et al. [19], Zhang & Wakkary [53], and others have revealed aspects of the complexity that define design practice [46], but the pragmatic and situational role of ethics is still underdetermined and undertheorized in the design and HCI literature. In particular, we position ethics as an important mediator of design complexity, representing the tradeoffs inherent in the social, organizational, technological, and personal milieu of the designer, subsuming the multiple mediating factors that impact or shape ethical awareness and decision-making. In this study, we provide a practice-led, in situ account of UX designers’ practices from an ethics perspective, increasing knowledge about how practitioners engage in “everyday ethics” as an important component of their work. Through a set of three diverse cases, we describe the everyday work practices of UX designers, shaped by multiple mediating factors that constrain, shape, or direct the ethical impact of design decisions. Through a discussion of these mediators, we build the groundwork for an ecology of pragmatist ethics in UX design practice."
    }, {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8946533203125,
        "y1": 662.4935302734375,
        "y2": 705.2440185546875
      },
      "text": "The contributions of this paper are two-fold: First, we document cases that describe the emergence or suppression of ethical decision making in UX practice, detailing the interactions and positionality of the designer within each case. This"
    }, {
      "page": 0,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 178 Page 1"
    }, {
      "page": 1,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.73828125,
        "y1": 95.73056030273438,
        "y2": 174.34600830078125
      },
      "text": "provides new knowledge about how ethical awareness and decision-making emerge without guiding methods or frameworks. Second, we describe ethical decision-making through the lens of mediation, identifying how organizational, personal, and ethical frameworks impact design practices. This provides further guidance in exploring the role of pragmatist ethics in managing design complexity."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.95501708984375,
        "x2": 411.0592346191406,
        "y1": 181.75685119628906,
        "y2": 188.1829833984375
      },
      "text": "1 INTRODUCTION"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.741455078125,
        "y1": 227.23757934570312,
        "y2": 712.3289794921875
      },
      "text": "Over the past decade, there has been increased awareness of the importance of ethics in design and technology education (e.g., [13, 18, 20, 26, 32, 47]). However, this awareness has not generally led to increased ability on the part of practitioners to work or act in an ethically-aware manner, despite numerous existing methods and frameworks. In parallel with this interest in the ethics of design practices, the HCI community has worked to engage more fully in the ethics of researchers and research practices (e.g., [7, 34, 51]). Many of these efforts to describe ethical practices in a range of research and design contexts rely upon common framings of ethics from philosophy, including perspectives such as consequentialist, duty, virtue, and care (e.g., [2, 20, 48]). We do not explicitly use any of these perspectives a priori in grounding this study, and instead seek to identify and describe ethical considerations described by practitioners on their own terms. In HCI and design education, calls for attention to the role of values and ethics have been continuous [10, 18, 33], yet has largely been left unaddressed in formal educational practice, particularly as compared to more scientific disciplines such as science [49] and engineering [38, 47]. With the importance of ethics in practice now well established (e.g., [1, 17, 37]), it is vital that we describe the relationships among actors, organizations, and societal responsibility in robust ways. Prior work has largely identified frameworks for interacting with ethics and values (e.g., value-sensitive design [4, 16, 30], values at play [14]). However, these frameworks have not substantively impacted the mainstream of UX practice, because HCI and UX practitioners often engage in their work and with the world in general from a predominantly pragmatic ethical perspective, which does not account for the use of structured methods or frameworks. In addition, there is also a conflict between ethical standpoint, with some fields such as engineering and education operating primarily from a consequentialist perspective (e.g., [31, 38]), while other scholars have recognized the limitations of this perspective in a design context (e.g., [8, 20]), where the main goal it to produce intentional change. Other perspectives on ethical engagement, such as Shilton’s “value levers” [41] provides a designer-centric means of exploring and acting upon emergent ethical concerns, placing the emphasis more"
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.2109985351562,
        "y1": 95.73056030273438,
        "y2": 114.57000732421875
      },
      "text": "closely on the designer and her agency rather than on a specific methodology for design engagement."
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8984375,
        "y1": 119.64157104492188,
        "y2": 473.2250061035156
      },
      "text": "Despite the increasing expectations for professionals to be strongly aware of the ethical roles they play through practice, driven by the ubiquity of technologies in worldwide-use and increase in goods being used in differing global contexts, there is little in situ research that provides a rich account of how ethics and values are addressed in professional design practice. There are rare examples of this type of in situ research, primarily in the STS literature. Shilton [42] identified the emergence of values in infrastructure design, using reflection on values as a means of engaging technologists in the ethical dimensions of their praxis. Steen [45] analyzed ICT application development practices through the lens of pragmatist ethics, identifying locations within the “black box” of design where ethical concerns can be addressed in a reflexive manner. Finally, vanWynesberghe and Robbins [49] proposed a heightened role for ethicists in supporting scientific work—the “ethicist as designer”—leading to a method for uncovering, scrutinizing, and translating values through the design process. Verbeek [50] also provides philosophical insight into the ethical dimensions of technological artifacts, describing the concept of technological mediation, whereby designed artifacts and society interact inways that inherently involve ethical considerations. This post-phenomenological understanding of ethical interaction is foundational to our own investigation of ethics in a practice-led framing. In this study, we seek to provide an account of ethical considerations in UX practice, building upon these previous empirical and philosophical efforts to more fully describe the rich contexts in which ethical concerns emerge and reflexively shape design processes."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 157.18408203125,
        "y1": 197.80787658691406,
        "y2": 219.177978515625
      },
      "text": "2 RELATEDWORK Ethics in all disciplines"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.892578125,
        "y1": 514.1615600585938,
        "y2": 712.3289794921875
      },
      "text": "We situate our work as part of a larger “turn to practice” in HCI scholarship [28, 29], attending to not only the epistemological commitments of design in its third paradigm [11], but also the need to bridge practitioner and researcher knowledge through dissemination pathways [22]. Our goal is to reveal and describe contextual and situated factors that contribute to design complexity [46], particularly focusing on the role that designers play in foregrounding and addressing ethical concerns. Prior work in a practice-led framing inform the present study. In particular, we build upon the work of Goodman [19] and Zhang and Wakkary [53] in describing the complex landscape of practice that is shaped by organizational factors and personal expertise. We also recognize that designers, broadly speaking, have the capacity to engage in substantive conversations around ethical concerns, using concepts such as dark patterns in discussions on social media [6, 12]. Finally, we draw on the work of Gray,"
    }, {
      "page": 1,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 178 Page 2"
    }, {
      "page": 2,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.74090576171875,
        "y1": 95.73056030273438,
        "y2": 198.25701904296875
      },
      "text": "Gross, and Toombs [23] in recognizing that design competence and performance are not static, but rather exist in a dynamic interplay of foregrounded and explicit awareness by individual and organizational actors. In the present study, we blend these insights to describe more fully how UX practitioners engage in the design complexity of their work, and motivate this work through ethical or value-related commitments that shape—and are shaped by—organizational and personal factors."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 390.1669006347656,
        "y1": 499.67584228515625,
        "y2": 506.10198974609375
      },
      "text": "Turn to Practice"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.30816650390625,
        "y1": 227.23757934570312,
        "y2": 509.09100341796875
      },
      "text": "In this paper, we build upon prior work on activity theory in general (e.g., [3, 25, 35, 36]), and particularly on the notion of mediation. As Nardi [36] states: “activity theory proposes a strong notion of mediation—all human experience is shaped by the tools and sign systems we use.” Activity theory more broadly contends that we cannot view actors or technological artifacts in isolation, but rather we must always understand interactions as simultaneously involving mediating actions from multiple sources that shape, constrain, or extend action possibilities. In this paper, we also draw on the work of Kou and Nardi [27], who describe the value of using the language of complex mediation to analyze patterns of interaction over time that involve both human and technological actors. While we use the concept of mediation in a relatively imprecise way in our analysis of practitioner interactions with ethics without fully exploring the semiotic dimensions that are implied by the engagement of practitioners with particular design artifacts or disciplinary codes of ethics, we anticipate that future work might sharpen this language further, making it a more useful tool for evaluating the design complexity of these interactions, and the system-level mediators that shape immediate design decisions, and the momentum of these decisions over time."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 193.18040466308594,
        "y1": 212.7519073486328,
        "y2": 219.17803955078125
      },
      "text": "Activity Theory and Mediation"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.31999969482422,
        "x2": 295.5872802734375,
        "y1": 538.071533203125,
        "y2": 712.3289794921875
      },
      "text": "In this study, we sought to identify and describe the ethical principles and related values that UX practitioners relied upon “on the ground.” To achieve this goal, we collected data through an on-site observational study and follow-up interviewswith UX designers working in an industry context. We approached this study as case study research as it aided us in building deep insights about the complex phenomena we observed and analyzed in each organizational context [15, 44, 52]. We used a multiple case study approach [52], with each participant–organization pair serving as the case unit, viewing each case study holistically. The primary goal of case study research such as this is not generalizability, although the rich detail obtained through each case can be expected to lead to insights or hypotheses that may guide future research."
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8907470703125,
        "y1": 95.73056030273438,
        "y2": 186.301025390625
      },
      "text": "To support the generation of information-rich cases, we conducted an observational study with three expert UX practitioners in a range of different work contexts. All research activities were approved by our institutional IRB, and all direct and indirect participants in our observations were consented. Each participant is referred to by a pseudonym, and elements of the work context are anonymized to protect the participants and their organization."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 148.04795837402344,
        "y1": 523.5858154296875,
        "y2": 530.011962890625
      },
      "text": "3 OUR APPROACH"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.8908081054688,
        "y1": 217.27456665039062,
        "y2": 427.3970031738281
      },
      "text": "The details of the participants at the focus of each case study are presented in Table 1. We identified multiple participants through a snowball sample [40] beginning from our personal and professional networks. In identifying and qualifying participants, we used a purposeful sampling approach [40] to identify a range of cases from different geographic locations, industries, organization types, role in the industry, and educational backgrounds. Three diverse cases were chosen based on multiple case study best practices [52] and the resource limitations of the researchers. Participants that were not chosen for this case sample were enrolled in an related expert interview study. The participants in the three cases range in experience from six to eleven years, and currently working in a range of industry types spanning enterprise, agency (in house), and agency (remote). All participants brought different sets of work and educational experiences, and each played a different role in their team, ranging from consultant to manager to partner."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 372.34307861328125,
        "y1": 202.7888946533203,
        "y2": 209.21502685546875
      },
      "text": "Participants"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.8931274414062,
        "y1": 458.3705749511719,
        "y2": 489.1659851074219
      },
      "text": "The data for building the case studies was collected through observations and follow-up interviews with the three participants at the center of each case study."
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8980712890625,
        "y1": 502.2065734863281,
        "y2": 712.3289794921875
      },
      "text": "Observations. Each participant was observed in their natural setting at their work spaces by two researchers. We consented the target participant, employer and any indirect participants prior to the start of data collection for all these research activities as approved by our institutional IRB. Each participant was observed for 7-10 hours across two or three different sessions. This number of hours increased the likelihood that we would be able to collect varied experiences and activities in the workplace based on work from prior studies of in situ design activity (e.g., [21]), while also helping to mitigate any validity risks of observing the participant (i.e., Hawthorne Effect). During each observation, handwritten field notes were produced by two researchers, constituting the primary data collection method. Prior to engaging in the observations, each researcher was trained through at least two scaffolding observations, increasing the ability of the researcher to reliably capture complex work practices, speech acts, and"
    }, {
      "page": 2,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 178 Page 3"
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.74102783203125,
        "y1": 251.15756225585938,
        "y2": 341.7279968261719
      },
      "text": "paralinguistics, as identified in [9]. The handwritten notes consisted of site maps, time stamps, interactions between individuals surrounding the participants, specific speech acts by individuals regarding design decisions, and researcher notes/memos. After each observation was completed, the field notes were collaboratively converted into digital narratives to combine the notes and observations of both the researchers to constitute a “thick” record [9]."
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.7413635253906,
        "y1": 355.76055908203125,
        "y2": 661.5239868164062
      },
      "text": "Follow-up Interviews. After the final observation, researchers conducted a 60-90 min follow-up interview with the participant. This interview was intended to clarify researcher notes from the observations and broadly document the perceptions of the participants regarding the role of ethics and values in their design work. These debrief interviews focused on stimulated recall of projects and primary decisions, including follow-up questions regarding the rationale for these decisions, prior experiences that guided these decisions, and other relevant actors or environmental cues that appeared to be salient in the observation. After the conclusion of these observation-focused questions, we also engaged the participant in a discussion of “dark patterns” and other ethical considerations in UX, which included solicitation of questions regarding user/stakeholder balance, and whether the participant had been asked to make design decisions that made them uncomfortable. We concluded with an open question asking how they assessed the ethical implications of their design decisions, with no definition of ethics or other conceptual framing provided. We did not provide a definition of ethics, values, or other framing concepts to our participants before the observations or during the interview debrief. These interviews were audio recorded with the consent of the participants. The recordings were transcribed and cleaned, and were used in conjunction with the thick record to facilitate data analysis."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 388.6524963378906,
        "y1": 443.8848571777344,
        "y2": 450.3110046386719
      },
      "text": "Data Collection"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.73675537109375,
        "y1": 693.4895629882812,
        "y2": 712.3289794921875
      },
      "text": "The thick records and interview transcripts of each participant were analyzed to form conceptually similar chunks"
    }, {
      "page": 3,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8983764648438,
        "y1": 251.15756225585938,
        "y2": 568.8770141601562
      },
      "text": "of events and activities. Patterns of similar activities were noted both in the process of performing observations, as well as in post-hoc analysis by multiple researchers. These chunks represented different observed themes regarding the practices at the workplace of each participant, including: concept brainstorming, stand-up meetings, client discussions, review/critique sessions, and so on. Once the themes were identified, all chunks were first analyzed individually to understand the actors involved, the decision making processes the actors engaged with, areas of tension in beliefs versus actions and any in-context discussion or later reflection in the interview. Once the main activity-related themes were identified, three main themes emerged through a bottom-up thematic analysis [5] that helped us to describe the richness within and across cases in relation to ethical awareness and decision making: 1) individual practices of the participant related/unrelated to their work environments; 2) organizational practices or policies which were evident throughout the team; and 3) the individual and specific examples that guided us to understand their ethical awareness and practices. While writing the case studies, we used an interpretive approach [40] to describe ethical concerns on the participant’s own terms, using their own words wherever possible. The depth of each case varied, based on the variety of work practices observed, the articulation of participants, and variation in the number and type of indirect participants."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 115.63835144042969,
        "y1": 679.0038452148438,
        "y2": 685.4299926757812
      },
      "text": "Data Analysis"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.89111328125,
        "y1": 609.8025512695312,
        "y2": 712.3289794921875
      },
      "text": "We present each participant’s observation synthesis as an individual case. For each participant, we provide a rich description of their background, their relation with their company, organizational structure(s), and clients, and overall themes of practice from an ethical standpoint. Our analysis, present in each case and elaborated in the discussion, presented a common mediator-driven position of the designer at the core of the ethical complexities that take place between individual practices, organizational practices and applied ethics."
    }, {
      "page": 3,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 178 Page 4"
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 375.62078857421875,
        "y1": 595.3168334960938,
        "y2": 601.7429809570312
      },
      "text": "4 RESULTS"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.74310302734375,
        "y1": 110.67459106445312,
        "y2": 380.572998046875
      },
      "text": "John works at an established agency as a remote consultant, and is pursuing his PhD. He currently works remotely with his agency team and primarily coordinates these activities through online management and communication tools such as e-mail, Slack, and internal-management platforms that are specific to each client. He has worked for six years in various fields such as graphic design, architecture, interaction design, and business strategy, and has an interdisciplinary background, with formal education in engineering and architecture. He refers to himself as a trans-disciplinary entrepreneur, researcher, and strategist. Although John is working remotely, he has conversations over chat applications and project-tracking platforms to keep things up-to-date and fulfill the role of being a business strategist and interaction designer. Clients at his agency range from funded SaaS startups to multi-billion dollar foundations and Fortune 500 companies. The agency generally works with technology-driven projects, ranging from websites to mobile applications to IoT implementation. He often handles multiple projects at the same time, and as we had the opportunity to observe him, he frequently worked alone in a coworking space, joining in regular conversations with his colleagues through online tools."
    }, {
      "page": 4,
      "region": {
        "x1": 52.672000885009766,
        "x2": 295.7410888671875,
        "y1": 394.60955810546875,
        "y2": 712.3289794921875
      },
      "text": "Externalizing ethical decision making. John’s perspective of application of ethics and values is highly externalized and distant from his own role, as became evident in his interview and day-to-day activities. He expressed that his agency “hired consultants . . . that help us make sure that we’re doing things ethically,” allowing him to distance his personal ethical responsibility. In many instances in our observations with John, he also overlapped ethical and legal considerations, with seemingly more focus on saving the agency from legal issues than engaging in human values on their own merits. While we were able to see this overlap throughout his design activities, in the follow-up interview, he provided more detail on a specific set of design decisions: “That [feature is] violating HIPAA. Violating some legal framework, or it just emotionally, so doesn’t sit well with me.” This bifurcation of ethics and legality also appeared when he identified and activated specific feature lists given by the clients for the designers to address. While checking the required feature list for a school management tool, John mentioned that security and privacy of student information is “twenty-five percent of what we do” to ensure that the situation is “legally protected,” but that the main focus was on the contract with the organization and the money that they were willing to pay. This also came through in John’s relationship with usercentered design principles. He regularly discussed situations with his colleagues where a client might profit by extracting value from a user, deciding that if he concentrated only on"
    }, {
      "page": 4,
      "region": {
        "x1": 317.5870056152344,
        "x2": 558.21435546875,
        "y1": 95.73056030273438,
        "y2": 138.48101806640625
      },
      "text": "developing a better experience for the user, that the client was not necessarily going to benefit. John’s commitment was to do his “client justice,” and ensure that they received the value that they were paying for."
    }, {
      "page": 4,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.311767578125,
        "y1": 143.55154418945312,
        "y2": 281.9429931640625
      },
      "text": "Overall, he is focused more on the legal issues around the business of the product, mentioning that his role as a designer is to serve his clients. This allegiance to client needs makes him particularly sensitive to the kinds of projects that he took on, with concern towards projects that take advantage of minorities or economically disadvantaged groups, or issues of racial injustice in relation to project outcomes. Thus, even while there was often a tense, yet externalized relationship, between value sensitivity and legality, John uses his business strategist role to position his organization as an “advocacy platform” to turn down projects that do not meet certain ethical criteria."
    }, {
      "page": 4,
      "region": {
        "x1": 316.8290100097656,
        "x2": 559.8978881835938,
        "y1": 298.96856689453125,
        "y2": 580.822021484375
      },
      "text": "Designing within the resources offered. John explains his organizational structure and relationships with clients in the following way: “they are billed as duration in price. So you get us for a certain amount of time at a certain price. We do all we can within that price and once we use that up we’re done.” This contractual approach to project work forces him to design only within the resources that were allowed, and to regularly trim ethical considerations as out of scope. He mentions that the agency has historically had no problems identifying clients that need support, but also notes the limits of their relationship: “Our time is yours. But it’s limited.” He recognizes the need for design processes to be iterative, but forms a boundary with the available resources of time and money. In this way, his organization constrains the design situation such that their clients hire them to validate their own preexisting ideas, and not to give their own judgment and alternative solutions. This validation is done using “user research,” which his team uses as an argumentation tool to convince clients to push forward towards a specific solution. Even when engaging in this research, John’s goals are primarily to understand objective issues or concerns, rather than the emotional aspects of the end users. In this way, John’s user research methodology can be characterized as “user-led” rather than “user-centric.”"
    }, {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8980102539062,
        "y1": 597.8475341796875,
        "y2": 712.3289794921875
      },
      "text": "Treating business goals as a design boundary. One of the projects we observed John working on was a chat messaging service. John, along with his team, was hired to support chat functionality on a larger website, where the chat interface was used to identify and hire candidates. In the process of working with this functionality, they discovered that the company could track all the user’s activities after logging in, including interception of content that is typed even before the submit button is clicked. This potential for a privacy breach was not disclosed by the company, and"
    }, {
      "page": 4,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 178 Page 5"
    }, {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.7410583496094,
        "y1": 95.73056030273438,
        "y2": 222.1669921875
      },
      "text": "once he realized this was the case, John expressed discomfort and frustration about this situation, noting that it fell into a “gray territory” in his mind. However, due to the contractual nature of his work and the defined boundaries that this presented in his mind, John mentioned that they would not contracted to help them support that part of the design of the service, and thus would not involve themselves in solving or further understanding this privacy issue. This example clearly illustrates the boundaries that John and his organization formed in regard to their design activities and potential ethical considerations."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 212.56838989257812,
        "y1": 96.18885803222656,
        "y2": 102.614990234375
      },
      "text": "John: Designing Within “Numbers”"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.73681640625,
        "y1": 254.13656616210938,
        "y2": 524.0350341796875
      },
      "text": "James works for an agency that creates solutions to client projects, primarily specializing in website applications. He has worked in the field of UX design for about eleven years, with more than three years at his current organization. Currently, he leads a design team of more than six UX designers with a range of skillsets in user research, interaction design, and graphic design. James has an educational background in UX design with a Masters degree in HCI. Although James is not directly involved in designing of solutions due to his management role, he is well positioned to bring design and business discussions together. He is well aware of the design practices of young designers and takes it as his responsibility to help them understand the impact of their design solutions by having conversations with them in their stand-up meetings. James treats his agency role as one of partnership— they are partners in the products they create, and this partnership is made possible by contributing to the client’s vision and strategy. James expressed discomfort in taking on projects from client who seek to dictate a certain amount of design work in a certain amount of time, believing instead that his agency is paid to add value on top of what the client’s initial goal might be. Ultimately, James believes that they are being hired for their professional judgment."
    }, {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.7420959472656,
        "y1": 538.071533203125,
        "y2": 712.3289794921875
      },
      "text": "Regularly refreshing knowledge to inform practice. James uses a number of ways to update his knowledge about ethical practices and human values involved in the design process. He believes that updating his store of knowledge outside the design practice strengthens and helps him better evaluate his ethical behavior. He reads books based in the science of design—coming from biology, psychology, and other fields— to more fully understand human behavior. He believes that a major source of value awareness can stem from a deeper understanding of science, including knowledge of how the brain works, the near- and long-term impact of interactions, and the long-term implications of activities. He mentioned that he reads Medium blogs and scholarly articles to access grounded information and identify potentially negative impacts or issues with products, allowing him to more fully"
    }, {
      "page": 5,
      "region": {
        "x1": 317.95452880859375,
        "x2": 559.8980102539062,
        "y1": 95.73056030273438,
        "y2": 210.21197509765625
      },
      "text": "identify the role of values in his judgments. This regular refreshing of knowledge gives him contextual information about the application of values from other products, and helps him in performing a self-reflection of client projects/ discussions, engaging in the personal experience of using digital products and understanding the potential impact of app features on user behavior. This regular updating of his knowledge store helps him form and articulate ethical judgments for critique or developing design concepts, and these judgments frequently emerged in our observation sessions."
    }, {
      "page": 5,
      "region": {
        "x1": 316.8289794921875,
        "x2": 560.369140625,
        "y1": 221.25955200195312,
        "y2": 682.4409790039062
      },
      "text": "Building others’ ethical character. James corrects and critiques the design thinking of his team of “young designers” as he reflects on his experience starting as a designer with a lack of knowledge about “critical design principles.” He believes doing actual design requires teaches a designer about the nature of their own judgments. This was mirrored in multiple conversations and brainstorming sessions, where he communicated to designers the agency practices of not using “fear based persuasion” and choosing not to be involved in client projects that deal with “smoking campaigns” or “political things.” He encourages his team to give importance to user research, and provides tips to the researchers in the team to build questionnaires that locate the aspirations of users rather than just their needs. In this way, James values not only the technical qualities of his designers, but also the development of an ethical perspective that is personal, yet in resonance with the agency’s goals. As the design lead in his agency, he also expresses his responsibility to develop practices at an organizational level to improve applied ethics on his project teams. James’s team focuses every Wednesday morning stand-up meeting on the discussion of current trends about graphic design solutions, interactions, and experiences. This activity of collecting trends from blogs or forums is practiced to critique different designs, probing to understand how and why they were implemented and what story the design has to tell about the brand. The team calls this activity “landscaping” or “deconstructing approach to brands.” This critical approach is highly individual, drawing on each designer’s unique perspective, with the acknowledgment that ”analyzing [the trends] keeps our judgments and taste high.” This critique and reflection encourages each designer to keep up-to-date on visual and interactive trends, allowing them to take inspiration from these materials and develop their own aesthetic sense that is “timeless, trendy, but not fashionable.” In James’ retelling, this allows the agency to create artifacts that are “sustainable,” allowing the designers to “develop an aesthetic as an agency that’s recognizable,” while also providing “value to the clients” by allowing them to avoid re-branding on a yearly basis."
    }, {
      "page": 5,
      "region": {
        "x1": 317.6059875488281,
        "x2": 559.3060302734375,
        "y1": 694.68017578125,
        "y2": 712.3289794921875
      },
      "text": "Knowing the limits of taking advantage through your designs. Across the three observations, we followed interactions with"
    }, {
      "page": 5,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 178 Page 6"
    }, {
      "page": 6,
      "region": {
        "x1": 52.672000885009766,
        "x2": 295.7427978515625,
        "y1": 95.73056030273438,
        "y2": 640.5980224609375
      },
      "text": "a specific client—a medium sized start up that develops a tool for marketers to track and plan long- and short-term goals. This tool allowed users to enter and track due dates, work in progress, and upcoming milestones for a campaign. The client was focused on raising the conversion rate, upselling users from the freemium product to a paid subscription. In one of the meetings, the CEO of the company stated his goal as: “We want to push people to specific actions—we know they will like and want to use while they are in the demo—and then after they are familiar with and excited about the potential of the functionality, we introduce that the functionality is a premium.” The plan was to understand the specific functionality to be made premium based on research findings after a one month trial. The stakeholder’s initial goal was to “[Try] to get more people into the project using growth hacking techniques by intercepting their attention.” To accomplish this business strategy, the stakeholder was explicit in mentioning how they wanted to constrain the users’ choice by showing the advantages of their tool and making them pay later. To achieve this goal, the team brainstormed numerous ideas such as creating a “community,” communicating trustworthiness through template sharing, providing read-only URLs, template “liking” to encourage “showing off,” and downloading or printing projects to PDF. As the team brainstormed these concepts on a surface level, they identified two kinds of users—observers and members—to understand the potential pricing structures. James first described the stakeholder’s goal of constraining user choice and brought it to its logical end, stating: “Some functionality—make it a pain! Like calendar? Syncing?.” He then described this business model as unsustainable and “dangerous” to the users, questioning why a user would pay $40 just to be an observer. Based on this discussion, he decided to have a “pricing meeting” with the clients, as he believed that a service should not be priced so “aggressively.” This example provides insight into how James was comfortable in “taking something away from somebody” in terms of functionality, but not in a way “that’s going to cost an arm and a leg to somebody.” This balance of user and shareholder needs involved an ethical judgment on the part of James and the agency, where the goal may be to “increas[e] your net revenue,” but that it must be done for the right reasons. James’ interactions demonstrates the limits and reflection on their concern for the users, and the necessity to discuss these situations with the stakeholder to develop better design outcomes that would be sustainable."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0558166503906,
        "y1": 239.6508331298828,
        "y2": 246.07696533203125
      },
      "text": "James: Being Constantly “Aware” of Things Out There"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.7337646484375,
        "y1": 669.5785522460938,
        "y2": 712.3289794921875
      },
      "text": "Martha is an user experience designer in a enterprise B2B company which works on network solutions. She has nine years of experience in industry as front-end developer, interaction designer, and UX designer. She has worked primarily"
    }, {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8980102539062,
        "y1": 95.73056030273438,
        "y2": 269.98797607421875
      },
      "text": "as a front-end designer and developer, and has a diverse range of experience in all stages of the web development lifecycle. Her educational background includes broad interdisciplinary studies in computer science andmedia studies with a primary emphasis on human-computer interaction, UX, user interface design, graphic design, and web design/development. She has previous experience in agency work, where she was involved in designing, wireframing, prototyping, andmarketing. These experiences have helped her build both design and programming competence. Martha works with a team of six designers that each have different roles in producing design outcomes. These roles include user researchers, designers that address organizational vision, and marketing management. The organization provides project management tools and security systems to their clients."
    }, {
      "page": 6,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.89794921875,
        "y1": 281.03558349609375,
        "y2": 562.8890380859375
      },
      "text": "Applying consistent values. Martha’s work practices did not reveal a substantial focus on ethics and values, but the followup interview provided additional detail regarding her ethical awareness, and the impact of this awareness on her practice. Given her range of work and formal educational experiences, she relates to the design process primarily from practice as opposed to theory. Her experiences have helped her to develop a sense of components of a design process and how each component effects her design decisions, with a particular focus on user research and user testing. She relies on the findings of these two phases to iterate and design for performance, with the primary goal of making work flows simpler. Because of the focus of her team’s work, organizational practices and goals constrain her values to usability, with no felt ability to address potential social impacts of her design work. The iterative, usability-focused process helps her to feel control over her design process, in contrast with her previous agency experience, where work practices were less structured. She engages in improving her engagement with usability issues by reading white papers or academic papers, which she believes has a substantial influence on her design decisions. Notably, Martha’s values can be related primarily to organizational goals of simplicity and usability, with little focus on values that are personally held."
    }, {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.304931640625,
        "y1": 575.128173828125,
        "y2": 712.3289794921875
      },
      "text": "Adopting repetitive work patterns to accomplish deliverables. Organizational practices have a big influence on Martha’s role in the design process. Martha’s team follows a repetitive pattern of work practices to develop design outcomes, and these practices are primarily driven by Product Lifecycle Managers (PLMs) who prescribe a set of features which are derived from cost benefit analysis. Thus, from the beginning, the team is constrained to introduce features into the product that result in successful, usable work flows, and a simpler user interface. The PLM’s objective is to enhance the product by adding more features, while the UX team’s objective is to simplify user interface workflows."
    }, {
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 178 Page 7"
    }, {
      "page": 7,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.7423400878906,
        "y1": 95.73056030273438,
        "y2": 341.718994140625
      },
      "text": "Martha’s team is involved in an iterative process of designing and testing before each design reaches development. In each project, the team produces a set of deliverables, including workflow diagrams, personas, competitive analysis, journey maps, and low-fidelity and high-fidelity mockups. The team seeks to integrate findings from researchers who test and identify qualitative insights to the designers that create iterative improvements on existing designs. The resulting work pattern is indicative of a highly engineeringdriven community whose main goal to provide “secured” network systems, with a focus on engaging with the value of security to provide services that are simpler to use. The resulting workflows are relatively linear, and the primary measure of success is the user accomplishing the end goal though the workflow. Without direct involvemtn in the requirements process, one of the organizational practices of the UX team is to evangelize UX within engineering to loop every stakeholder into the design process, involving them in early whiteboarding sessions that ensure that the right requirements are designed into the product later in the project lifecycle."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 192.84165954589844,
        "y1": 655.0928344726562,
        "y2": 661.5189819335938
      },
      "text": "Martha: Sticking to the “Grids”"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 53.429779052734375,
        "x2": 295.7414245605469,
        "y1": 367.7105712890625,
        "y2": 625.6539916992188
      },
      "text": "team engage in two kinds of application work, with similarly constrained design situations. In the first project, the goal was to create a design that would not overload the UI, while allowing the user to configure their network. The goal of the team was to directly apply interaction principles to make the UI simpler to understand, allowing users to more easily engage with the network service functionality. In this workflow, no values except for usability and efficiency were able to be considered, given the constraints provided in the initial requirements. In the second project, the teamworked to align engineering and design outcomes through the introduction of a UI framework library. This move towards consistency represented a new practice, conducted in weekly sprints, to build a consistent UI library for all features among all of the company’s products. The developers created a UI framework library to accommodate all the features in their products which are used by the designers to create their mockups, while the designers suggested the required features to add to the library to simplify and make their UI usable and understandable. These interactions were similarly constrained, with outcomes that were not immediately clear as being engaged with values."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.53045654296875,
        "y1": 355.7555847167969,
        "y2": 362.6400146484375
      },
      "text": "Designing for usability and consistency. WeobservedMartha’s"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 53.45000076293945,
        "x2": 295.7337341308594,
        "y1": 657.62353515625,
        "y2": 712.3289794921875
      },
      "text": "Across these three cases, we have identified the multiple situational qualities that the designers we observed had to address when engaging in ethical practice. The diversity of these experiences demonstrate the multiple roles that designers might take on in relation to ethical considerations, and"
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.89892578125,
        "y1": 95.73056030273438,
        "y2": 222.1669921875
      },
      "text": "the situational factors underscore the ways in which ethical considerations might be suppressed or strengthened through organizational, personal, or other codified commitments. In this discussion, we wish to call attention to some of these mediating factors in greater detail. First, we will document the knowledge and practices evident in the cases. Second, we describe ethical mediators that appeared to impact the ability of designers to engage in ethically-focused decision making. And finally, we will describe how these mediators may lead to an increased understanding of the design complexity inherent in professional work practices."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 128.84927368164062,
        "y1": 643.1378784179688,
        "y2": 649.5640258789062
      },
      "text": "5 DISCUSSION"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.89794921875,
        "y1": 275.0585632324219,
        "y2": 712.3289794921875
      },
      "text": "To distill the findings across these three cases, we have identified three primary sets of knowledge and practices that relate to the designers’ work (Figure 1). The individual’s practices (A) describe the personal experiences and commitments that are unique to the designer, and the ways in which the awareness of one’s practices in a reflective and reflexive manner might be brought to bear on a design situation. The organizational practices (B) describe the structure and purpose of the organization where design activity is taking place, and the ways in which these structures shape the substance and outcomes of design processes. Finally, applied ethics (C) describe the knowledge that is built through formal education or participation in professional societies, and the ways in which this knowledge might indicate ethically-correct behavior or responsibility. In the three cases, we see a diverse range of perspectives indicated through these sets of knowledge and practices. In the first case, John had a personal interest in the social impact of design and the needs of users (A) which was constrained by the contractual functioning of his job within the agency (B); this relationship was further complicated by values from user-centered design (C) that contradicted or supported John’s personal practices. In the second case, James had a clear sense of how his ethical commitments mapped across the development of his own design character (A) and the mission of the company he helped to manage (B); these commitments were regularly refreshed and shaped by academic studies in biology, neuroscience, and psychology that provided external perspectives on ethics (C) that related to his personal behaviors. In the third case, Martha’s personal practices drew broadly from UX, programming and design (A), yet these practices and experiences were constrained by the B2B focus and the primary goal of improving security within the organization (B); in this case, the goal of security and usability provided a set of desirable indicators for success (C), but was primarily oriented towards organizational rather than personal practices."
    }, {
      "page": 7,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 178 Page 8"
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 431.9317932128906,
        "y1": 260.5728759765625,
        "y2": 266.9990234375
      },
      "text": "Practices and Knowledge"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7374572753906,
        "y1": 370.6995849609375,
        "y2": 712.3289794921875
      },
      "text": "Based on the proposal of multiple practices and knowledge that constrain or extend ethical awareness in design activity from the last subsection, we also propose a set of directional ethical mediators that characterize these relationships. While not all of these mediators are present in the cases, this framework provides a means of analyzing potential and actual relationships that inform and shape ethically-informed action. The cases of James and John provide two perspectives on the power of mediation. Whereas James was constrained by organizational practices (B->A)—thereby suppressing his own goals as a user-centered, social-justice-aware, designer— John was directed by his inner sense of character and ethics, which was then used to extend and inform the creation of an organizational structure that resonated with his individual practices (A->B). A similar contrast in cases is also clear from a comparison of these two cases from individual practices to applied ethics. James’ regular effort to learn from other disciplines and infuse these lessons into his design practices (C->A) strengthened and broadened his ethical foundations, allowing him to articulate clear beliefs about issues such as technology addiction. However, John seemed to promote a disconnect or disjuncture between his ethical framing and individual practices (A|C). He allowed his business strategist role and designer role to work independently, using his work practices to inscribe the distinction between these roles. This resulted in situations where his practices were out of sync with user-centered design principles, even though they resonated strongly with his business strategy goals. Ultimately,"
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.3086547851562,
        "y1": 95.73056030273438,
        "y2": 222.1669921875
      },
      "text": "this fragmentation was shaped and perpetuated through the organizational practices of his agency. Martha’s case shows yet another perspective of ethical mediation, where organizational practices almost completely subsumed any individual practices or alternate systems of applied ethics. While Martha clearly had experience from multiple sources that had the potential to alter her individual practices (C->A), the limitations of her individual practices as mediated by the organizational practices allowed her to only strengthen the performance of values relating to security, usability, and simplicity (A->C)."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 133.73117065429688,
        "y1": 356.2138366699219,
        "y2": 362.6399841308594
      },
      "text": "Ethical Mediators"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8980712890625,
        "y1": 263.1035461425781,
        "y2": 401.4939880371094
      },
      "text": "In these cases, we have described a high level of ethical complexity, mediated by personal and organizational factors, as well as knowledge sources that describe systems or philosophies of ethics or values. In building on Stolterman’s [46] notion of design complexity, we seek to describe the an ethical design complexity that designers engage in when activating their personal and organizational values in their design work. By ethical design complexity, we refer to the complex and choreographed arrangements of ethical considerations that are continuously mediated by the designer through the lens of their organization, individual practices, and ethical frameworks."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 490.45452880859375,
        "y1": 248.6178741455078,
        "y2": 255.04400634765625
      },
      "text": "Describing Ethical Design Complexity"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.8990478515625,
        "y1": 442.4305725097656,
        "y2": 712.3289794921875
      },
      "text": "While existing frameworks such as VSD provide an area of entrance into the consideration of ethics, we contend that embedding more ethically-aware practices in UX design requires attending to the complex mediating relationships that shape ethical engagement. Rather than proposing a monolithic method for designers to engage with ethics and values across the design lifecycle, we use this practice-led framing to explore the situational and ethical design complexity of these practices, including the ways in which ethical awareness might be short-circuited or extended through individual and organizational practices. Future work should engage more fully in developing an ecological model of ethical engagement, including a flow of competence between organizational and personal practices that might result in lasting and sustainable change. Similar to the flow of methodological and design competence that Gray et al. [23] modeled in relation to UX practice, we contend that attending not only to the ethical practices but also the personal and organizational factors that cause these practices to have resonance is vital. Future studies should engage at both the individual and organizational level to model and describe these mediating relationships, and how these relationships might productively shift over time."
    }, {
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 178 Page 9"
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 505.3689880371094,
        "y1": 427.94482421875,
        "y2": 434.3709716796875
      },
      "text": "6 IMPLICATIONS AND FUTUREWORK"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7411193847656,
        "y1": 110.67459106445312,
        "y2": 225.156005859375
      },
      "text": "In this paper, we have described three diverse cases of UX practice that expand our knowledge of situated ethical decision making. Based on the experiences of these practitioners, and the felt ethical complexity of their individual and organizational practices, we have proposed a set of ethical mediators that constrain, shape, or expand the possibilities for ethically-centered practice. These mediating relationships provide a foundation for future work on better supporting ethics in the workplace, and providing methods that engage with the felt ethical complexity of UX designers’ practice."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 135.48463439941406,
        "y1": 96.18885803222656,
        "y2": 102.614990234375
      },
      "text": "7 CONCLUSION"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 53.499000549316406,
        "x2": 294.05816650390625,
        "y1": 254.13656616210938,
        "y2": 332.75201416015625
      },
      "text": "The authors would like to thank undergraduate researchers Rhea Manocha, Jason Brier, Abilene Perez, and graduate researcher Christopher R.Watkins for their assistance in data collection and early analysis. The authors would also like to thank the anonymous referees for their valuable comments and helpful suggestions. This work is funded in part by the National Science Foundation under Grant No. 1657310."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 161.5478515625,
        "y1": 239.65089416503906,
        "y2": 246.0770263671875
      },
      "text": "ACKNOWLEDGMENTS"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 57.50400161743164,
        "x2": 294.0440368652344,
        "y1": 361.11773681640625,
        "y2": 366.625
      },
      "text": "[1] Anders Albrechtslund. 2007. Ethics and technology design. Ethics and"
    }, {
      "page": 9,
      "region": {
        "x1": 53.797996520996094,
        "x2": 295.2744445800781,
        "y1": 371.08074951171875,
        "y2": 705.35498046875
      },
      "text": "information technology 9, 1 (March 2007), 63–72. https://doi.org/10. 1007/s10676-006-9129-8 [2] Julian Baggini and Peter S Fosl. 2007. The ethics toolkit: a compendium of ethical concepts and methods. Blackwell Pub. https://market.android. com/details?id=book-ikvXAAAAMAAJ [3] Olav W Bertelsen and Susanne Bødker. 2003. Activity Theory. In HCI Models, Theories, and Frameworks. Elsevier, 291–324. [4] Alan Borning and Michael Muller. 2012. Next steps for value sensitive design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1125–1134. https://doi.org/10.1145/2207676. 2208560 [5] Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (Jan. 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa [6] Harry Brignull. 2011. Dark Patterns: Deception vs. Honesty in UI Design. Interaction Design, Usability 338 (Nov. 2011), 338. https://alistapart.com/article/dark-patterns-deception-vs. -honesty-in-ui-design [7] Amy Bruckman. 2014. Research Ethics and HCI. In Ways of Knowing in HCI, Judith S Olson andWendy A Kellogg (Eds.). Springer New York, New York, NY, 449–468. https://doi.org/10.1007/978-1-4939-0378-8_ 18 [8] Ryan C Campbell, Ken Yasuhara, and Denise Wilson. 2012. Care ethics in engineering education: Undergraduate student perceptions of responsibility. In Frontiers in Education Conference (FIE). [9] Phil F Carspecken. 1996. Critical ethnography in educational research: A theoretical and practical guide. Routledge, New York. [10] Anthony Faiola. 2007. The Design Enterprise: Rethinking the HCI Education Paradigm. Design Issues 23, 3 (July 2007), 30–45. https: //doi.org/10.1162/desi.2007.23.3.30 [11] Daniel Fallman. 2003. Design-oriented human-computer interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 225–232. https://doi.org/10.1145/ 642611.642652"
    }, {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.5447387695312,
        "y1": 97.10771942138672,
        "y2": 710.3359985351562
      },
      "text": "[12] Madison Fansher, Shruthi Sai Chivukula, and Colin M Gray. 2018. #darkpatterns: UX Practitioner Conversations About Ethical Design. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, New York, USA, LBW082. https://doi.org/10.1145/3170427.3188553 [13] Alain Findeli. 2001. Rethinking Design Education for the 21st Century: Theoretical, Methodological, and Ethical Discussion. Design Issues 17, 1 (Jan. 2001), 5–17. https://doi.org/10.1162/07479360152103796 [14] Mary Flanagan and Helen Nissenbaum. 2014. Values at Play in Digital Games. MIT Press, Cambridge, MA. https://market.android.com/ details?id=book-iIYRBAAAQBAJ [15] Bent Flyvbjerg. 2006. Five misunderstandings about case-study research. Qualitative inquiry 12, 2 (2006), 219–245. [16] Batya Friedman, Peter Kahn, and Alan Borning. 2002. Value sensitive design: Theory and methods. University of Washington technical report (2002), 02–12. [17] Batya Friedman and Peter H Kahn Jr. 2003. Human values, ethics, and design. In The human-computer interaction handbook, Julie A Jacko and Andrew Sears (Eds.). Lawrence Erlbaum Associates, Mahwah, NJ, 1177–1201. [18] Ken Friedman. 2012. Models of Design: Envisioning a Future Design Education. Visible Language 46, 1/2 (2012), 132–153. [19] Elizabeth Goodman, Erik Stolterman, and Ron Wakkary. 2011. Understanding Interaction Design Practices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’11). ACM, New York, NY, USA, 1061–1070. https://doi.org/10.1145/1978942.1979100 [20] Colin M Gray and Elizabeth Boling. 2016. Inscribing ethics and values in designs for learning: a problematic. Educational technology research and development 64, 5 (Oct. 2016), 969–1001. https://doi.org/10.1007/ s11423-016-9478-x [21] Colin M Gray, Cesur Dagli, Muruvvet Demiral-Uzan, Funda Ergulec, Verily Tan, Abdullah A Altuwaijri, Khendum Gyabak, Megan Hilligoss, Remzi Kizilboga, Kei Tomita, and Elizabeth Boling. 2015. Judgment and Instructional Design: How ID Practitioners Work In Practice. Performance Improvement Quarterly 28, 3 (Oct. 2015), 25–49. https://doi.org/10.1002/piq.21198 [22] Colin M Gray, Erik Stolterman, and Martin A Siegel. 2014. Reprioritizing the relationship between HCI research and practice: bubble-up and trickle-down effects. In Proceedings of the 2014 conference on Designing interactive systems (DIS ’14). ACM, New York, New York, USA, 725–734. https://doi.org/10.1145/2598510.2598595 [23] Colin M Gray, Austin L Toombs, and Shad Gross. 2015. Flow of Competence in UX Design Practice. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15). ACM, New York, NY, USA, 3285–3294. https://doi.org/10.1145/ 2702123.2702579 [24] Steve Harrison, Phoebe Sengers, and Deborah Tatar. 2011. Making epistemological trouble: Third-paradigm HCI as successor science. Interacting with Computers 23, 5 (Sept. 2011), 385–392. [25] Victor Kaptelinin and Bonnie A Nardi. 2012. Activity Theory in HCI - Fundamentals and Reflections. Activity Theory in HCI 5, 1 (2012), 1–105. [26] Jes A Koepfler, Luke Stark, Paul Dourish, Phoebe Sengers, and Katie Shilton. 2014. Values & design in HCI education. In CHI’14 Extended Abstracts on Human Factors in Computing Systems. 127–130. [27] Yubo Kou and Bonnie A Nardi. 2018. Complex Mediation in the Formation of Political Opinions. CHI (2018), 1–15. [28] Kari Kuutti. 2009. HCI and design: uncomfortable bedfellows? In (Re)searching the Digital Bauhaus, Binder, Löwgren, and Malmborg (Eds.). Springer, London, 43–60. [29] Kari Kuutti and Liam J Bannon. 2014. The turn to practice in HCI: Towards a research agenda. In CHI. Oulun Yliopisto, Oulu, Finland,"
    }, {
      "page": 9,
      "region": {
        "x1": 54.0,
        "x2": 558.001953125,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 178 Page 10"
    }, {
      "page": 10,
      "region": {
        "x1": 53.798004150390625,
        "x2": 295.26580810546875,
        "y1": 97.10771942138672,
        "y2": 112.5780029296875
      },
      "text": "ACM Press, New York, New York, USA, 3543–3552. [30] Christopher A Le Dantec, Erika Shehan Poole, and Susan P Wyche."
    }, {
      "page": 10,
      "region": {
        "x1": 53.797996520996094,
        "x2": 295.3888854980469,
        "y1": 117.03270721435547,
        "y2": 491.1579895019531
      },
      "text": "2009. Values as lived experience: evolving value sensitive design in support of value discovery. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM Press, New York, New York, USA, 1141–1150. https://doi.org/10.1145/1518701.1518875 [31] Hong Lin. 2007. The ethics of instructional technology: issues and coping strategies experienced by professional technologists in design and training situations in higher education. Educational Technology Research and Development 55, 5 (Feb. 2007), 411–437. [32] Peter Lloyd. 2009. Ethical Imagination and Design. InAbout: Designing: Analysing Design Meetings, Janet McDonnell and Peter Lloyd (Eds.). CRC Press, Boca Raton, FL, 85–99. [33] Victor Margolin. 1991. Design studies and the education of designers. Pedagogia Del Disseny 6 (1991). [34] Cosmin Munteanu, Heather Molyneaux, Wendy Moncur, Mario Romero, Susan O’Donnell, and John Vines. 2015. Situational Ethics: Re-thinking Approaches to Formal Ethics Requirements for HumanComputer Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15. ACM Press, New York, New York, USA, 105–114. https://doi.org/10.1145/2702123. 2702481 [35] Daisy Mwanza and Olav W Bertelsen. 2003. Methods for Applying Activity Theory to HCI Design. INTERACT (2003). [36] Bonnie A Nardi. 1996. Context and Consciousness: Activity theory and human-computer interaction. Cambridge. [37] Harold G Nelson and Erik Stolterman. 2012. The design way: Intentional change in an unpredictable world (2nd ed.). MIT Press, Cambridge, MA. [38] Marina Pantazidou and Indira Nair. 1999. Ethic of care: guiding principles for engineering teaching & practice. 88, 2 (1999), 205–212. [39] Victor J Papanek. 1972. Design for the real world; human ecology and social change. Pantheon Books, New York, NY. [40] Michael Quinn Patton. 2014. Qualitative research and evaluation methods: Integrating theory and practice (4th ed.). London, UK, Sage. [41] Katie Shilton. 2013. Values Levers: Building Ethics into Design. Science, technology & human values 38, 3 (May 2013), 374–397. https://doi.org/ 10.1177/0162243912436985 [42] Katie Shilton. 2018. Engaging Values Despite Neutrality: Challenges and Approaches to Values Reflection during the Design of Internet"
    }, {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.4254150390625,
        "y1": 97.10771942138672,
        "y2": 162.3909912109375
      },
      "text": "Infrastructure. Science, technology & human values 43, 2 (March 2018), 247–269. https://doi.org/10.1177/0162243917714869 [43] Katie Shilton. 2018. Values and Ethics in Human-Computer Interaction. Foundations and Trends in Human-Computer Interaction 12, 2 (2018), 107–171. [44] Robert E Stake. 2008. Qualitative case studies. (2008). [45] Marc Steen. 2015. Upon opening the black box and finding it full:"
    }, {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.54541015625,
        "y1": 166.84674072265625,
        "y2": 489.2770080566406
      },
      "text": "Exploring the ethics in design practices. Science, Technology, & Human Values 40, 3 (2015), 389–420. [46] Erik Stolterman. 2008. The nature of design practice and implications for interaction design research. International Journal of Design 2, 1 (2008), 55–65. [47] Mary E Sunderland, J Ahn, C Carson, andW Kastenberg. 2013. Making Ethics Explicit: Relocating Ethics to the Core of Engineering Education. In American society for engineering education annual conference proceedings, Atlanta, Georgia, June. 23–26. [48] Austin L Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. In CHI ’15. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15). ACM Press, New York, NY, USA, 2093–2102. https://doi.org/10.1145/2702123.2702522 [49] Aimee van Wynsberghe and Scott Robbins. 2014. Ethicist as designer: a pragmatic approach to ethics in the lab. Sci Eng Ethics 20, 4 (Dec. 2014), 947–961. [50] Peter-Paul Verbeek. 2006. Materializing Morality: Design Ethics and Technological Mediation. In Science, Technology & Human Values. Vol. 31. 361–380. https://doi.org/10.1177/0162243905285847 [51] JennyWaycott, Cosmin Munteanu, Hilary Davis, Anja Thieme, Wendy Moncur, Roisin McNaney, John Vines, and Stacy Branham. 2016. Ethical Encounters in Human-Computer Interaction. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’16. ACM Press, New York, New York, USA, 3387–3394. https://doi.org/10.1145/2851581.2856498 [52] Robert K Yin. 2009. Case study research: Design and methods (applied social research methods). London and Singapore: Sage (2009). [53] Xiao Zhang and Ron Wakkary. 2014. Understanding the role of designers’ personal experiences in interaction design practice. In Proceedings of the 2014 conference on Designing interactive systems - DIS ’14. ACM Press, New York, New York, USA, 895–904. https: //doi.org/10.1145/2598510.2598556"
    }, {
      "page": 10,
      "region": {
        "x1": 54.0,
        "x2": 558.001953125,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 178 Page 11"
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 116.56490325927734,
        "y1": 347.24786376953125,
        "y2": 353.67401123046875
      },
      "text": "REFERENCES"
    }
  }]
}