{"authors": "Alix Goguey; Ranjan Deepak; Simon Sahoo; Jennifer Robinson; Matt Pearson;  Jones", "pub_date": "", "title": "Pulp Friction: Exploring the Finger Pad Periphery for Subtle Haptic Feedback", "abstract": "Current haptic feedback techniques on handheld devices are applied to the finger pad or the palm of the user. These state-of-the-art approaches are coarse-grained and tend to be intrusive, rather than subtle. In contrast, we present a new feedback technique that applies stimuli around the periphery of the finger pulp, demonstrating how this can provide rich, nuanced haptic information. We use a reconfigurable haptic device employing a ferromagnetic marble for back-of-the device handheld use, which, for the first time, probes, without instrumenting the user, the periphery of the distal phalanx with localised stimulation. We present the design-space afforded by this new technique and evaluate the human-factors of finger-peripheral touch interaction in a controlled userstudy. We report results with marbles of different diameters, speeds and a combination of poking, lateral vibration and patterns; present the resulting design guidelines for fingerperiphery haptic feedback; and, illustrate its potential with use case scenarios.• Human-centered computing → Human computer interaction (HCI).", "sections": [{"heading": "INTRODUCTION", "text": "Haptic feedback is widely available in commercial handheld devices including smartphones and game-controllers. Typically, this feedback has been used to provide the user with either a touch input confirmation during a finger-press or to provide a tactile notification to draw the attention of the user to an alert or message. In current commercial devices, the haptic stimulation for touch confirmation is applied on the finger pad, i.e. the underside of the pulp at the end of the finger. For tactile notification, the user receives the haptic stimulation in their hand if they are holding the device, or to the body or leg if the device is in the coat or trousers pocket. Currently, the stimulation is generated using small vibration motors that are programmed to provide vibrotactile feedback. The granularity of both these forms of feedback is relatively coarse. To provide more subtle and finer-grained haptic outputs, researchers have considered a range of fingerpad based displays [2,12,28]; and grasp oriented outputs on mobile devices through dynamic haptic systems at the edge of the mobile devices by changing their physical shape [8,19].\nIn order to afford a wider range of possible tactile elements while accommodating the limited physical space available on mobiles, researchers have recently proposed the notion of using reconfigurable tactile elements [29]. These can emerge from a hidden reservoir when needed, move to the finger to provide haptic feedback, and then return to a hidden state [26,29]. In this work, inspired by reconfigurable approach, we have developed a tactile element for back-of-device pleasant and useful interactions as illustrated in the following scenario:\nEve is messaging on her smartphone sitting in a train while holding it in one hand and inputting text with her thumb. While she is immersed in the unfolding text conversation, a small metal ball emerges from its dock on back of her phone. It moves towards the upper-third of her index finger, and slowly and gently rolls along from one side of her finger, over the tip, to the other side to subtly notify her of how much of her journey remains. In addition, the marble lightly pokes the side of her finger to signify discrete locations at frequently used stops and rubs her finger pulp when her final stop is approaching. This example then demonstrates the palette of possibilities with the proposed approach using the extended area provided by the finger pulp periphery with the ability to provide locomotive, discrete poking and rubbing sensations. The periphery of the finger pad is mostly concentrated with type-2 mechanoreceptors. While less sensitive than the finger pad itself, it has the ability to discriminate between light touches, skin stretches and tapping [11,31]. In this paper, we leverage it as a continuous surface to apply localized spatio-temporal haptic stimulation and explore the extent to which feedback on it can be perceived by users in a controlled laboratory experiment. Our goal is to rigorously scope the possible stimulation dimensions for usable perceptions while the finger pad is touching a surface. To do this we have built a motion controlled marble-based device and explore different factors such as the localization, marble size and motion speed. We present the results of the empirical user study, design guidelines to shape future deployments and illustrate the use of this new system through interaction and application scenarios.\nPrevious work, such as [16] which conveyed bumps under a finger, showed evidence that non-wearable device fingertip haptic system could benefit user interaction. In this paper, we explore a wider output space not yet identified or evaluated. However, before tackling the technical challenge set by shape change interfaces (e.g. [4]), we first seek to determine the range and limitation of possibilities (in a similar fashion to other work such as [27]). Our approach to free the finger from any effector opens up the possibility of expansive, yet targeted, feedback on a larger surface, compared to requiring the user to wear a device which imposes a permanent sensation on a finger and onto a constrained area.\nThe main contributions of this paper are:\n• Exploring, for the first time, the use of the periphery of the finger pad for haptic feedback, • A new technique using a motion controlled marble for haptic feedback, • A controlled human-factor study informed by a designspace specification, • Guidelines to create a peripheral finger pad haptic feedback system, illustrated by use-cases.", "n_publication_ref": 13, "n_figure_ref": 0}, {"heading": "RELATED WORK", "text": "In the most contempoary handheld devices, the entire device vibrates to provide tactile feedback. This stimulus is coarse, and is generated by a small eccentric rotating mass vibration motor or a linear resonant actuator (as used in the Apple Taptic Engine) [5]. Poupyrev et al. developed a piezoelectric bending actuator (Touch Engine) for a similar effect [23]. In spite of being coarse, such tactile feedback has been shown to provide many useful applications. Complex vibration patterns were presented in Ambient Touch for intelligent touch notification, touch monitoring and tactile feedback during gesture control, for instance [22]. Vibrotactile feedback has also been shown to complement other output modalities, as in their combination with GUI elements [21]. In this case, as with others of this class, the user's palm of the device holding hand also receives the stimuli as opposed to a highly localized feedback.", "n_publication_ref": 4, "n_figure_ref": 0}, {"heading": "Localized tactile feedback", "text": "Instead of vibrating the entire device, tactile stimuli can be generated on the device's surface. In the electrovibration technique, then, tactile feedback is given through the capacitive coupling with the finger pad when the user slides the finger on the dielectric surface with a conductive under layer [2,24]. Meanwhile, in the electrocutaneous stimulation technique, a mild DC current pulse is passed through the finger pad to create tactile sensation when the user touches the conductive surface [12]. In [28] an electric spark with mild AC current pulses is used to stimulate a tactile sensation when the finger is hovering over the conductive surface. All of these techniques use transparent surfaces and are particularly useful for touch interaction for a front of screen task, e.g. , for touch confirmation on content notification. In the case where the user is performing a task (e.g. typing on the keyboard and receiving haptic confirmations) it might be confusing and intrusive if additional haptic notifications (such as the ones in our scenario) are presented via the same medium. To overcome this, we, like others are considering unobtrusive haptic feedback using the periphery, i.e. , edge or back of the device.", "n_publication_ref": 4, "n_figure_ref": 0}, {"heading": "Peripheral haptic devices", "text": "The electrovibration and electrocutaneous techniques mentioned above can be implemented at the periphery of a handheld device and it would not require a transparent surface on touchscreen based devices. Khurelbaatar et al. used the electrocutaneous tactile stimulation at the back of the device, for instance, to avoid giving tactile feedback to the entire palm [14]. The finger at the back of device receives the feedback instead of the finger touching the screen. Thus, there could be two channels -front and back -of tactile communication using two fingers. Recently, Jang et al. reported a tactile display at the edge of mobile devices using small piezoelectric actuators to provide haptic force feedback for both information input and output [8]. It created a rich haptic interaction experience on the side of the device. The user interacts with multiple fingers while holding the device in the same hand. There are many other implementations on the edges of devices to stimulate different haptic perceptions. Nakagawa et al. reported a shape memory alloy based device for information input as well as variable stiffness based haptic feedback [19]; and, Luk et al. explored feedback through lateral skin-stretching on the finger pad using piezoelectric actuators [17]. These devices are attractive because they do not instrument the user, however, the grip is modified and the user is required to learn the new haptic interaction mode.", "n_publication_ref": 4, "n_figure_ref": 0}, {"heading": "Wearable haptic devices for the finger", "text": "A number of wearable devices have been developed to provide haptic feedback around the finger, especially the index finger's proximal phalanx. Gupta et al. reported a ring that clenches the finger using a shape memory alloy actuator [6]. Je et al. and Pece et al. presented TactoRing, PokeRing and MagTics to skin-drag and poke around the proximal phalanx using a motorized tactor and electromagnetically actuated pins respectively [9,10,20]. Je et al. studied user's ability to recognize distinct points around the finger and designed spatio-temporal patterns for haptic feedback [9,10]. Minamizawa et al. built and studied a two-ring haptic system that provides kinesthetic feedback to the arm and tactile feedback on top of a finger [18]. Culbertson et al. presented WAVES a pair of voicecoil actuators embedded in a fingersleeve 3D guidance cues on the sides of the intermediate phalanx [3].\nKim et al. report on the HapCube which provides normal and tangential pseudo force feedback using asymmetric vibration on an enclosed finger [15]. Midair, e.g. , virtual and augmented reality applications could benefit from this approach. Karnik et al. explored the speed and direction as the tactile communication channels in the probing finger pad with a sliding corrugated surfaces giving shear force feedback [13].\nThe Eone Bradley tactile watch gives time with reconfigurable tactile elements [1]. It uses two magnetic ball bearings in two grooves, one on top and one on the side to display the time. Two sub-surface magnetic stages motorized by the mechanical actuation system of the watch control the motion of the ball bearings. The users locate the ball bearings visually or tactually to know the time. The ball bearings are constrained to the grooves and the users feel them as \"bumps\" or as a sliding ball under their finger pads.\nShiftIO by Strasnick et al. is another closely related work [29]. It presented permanent disk magnets around the edge of a mobile device as the reconfigurable tactile elements. The locomotion of the magnets was controlled using thin flexible coils and switchable permanent magnets. The tactile elements could output information visually and tactually. In addition, it can sense touch input which allows the tactile element to be used as physical controls such as a button. It gives the haptic notifications as a \"bump\" to the user's hand as they grip the device.\nIn this paper, we detail a haptic device related to the tactile watch; however, the ball bearing is not constrained to a groove. Furthermore, unlike shiftIO and the tactile watch, the tactile element is not designed to feel like a \"bump\". That is, we move ball bearings of different sizes in different patterns on a flat surface. We stimulate the periphery of the finger pulp with these patterns to convey a range of tactile stimuli.\nIn all of the previous literature, the haptic feedback in handheld devices is focussed on the finger pad or the palm. Haptic stimulation applied to the periphery of the finger pulp has not been reported. We believe that our technique could offer two main advantages. The first advantage is that it offers an additional peripheral channel for tactile feedback near the finger pad. The second is the ergonomic advantage where the users could receive multiple notifications without changing their grip while holding the device.", "n_publication_ref": 12, "n_figure_ref": 0}, {"heading": "DESIGN SPACE", "text": "The motivation of our work is to explore and identify the possible dimensions than could be leveraged to convey information through the peripheral finger pad. This initial survey would help us motivate guidelines for designers and researchers to implement a reliable notification system with greater throughput than the common binary vibration based system. One motivation to use the periphery of the finger pad is to propose a system that is not in conflict with current and state-of-the-art haptic feedbacks.\nIn practice, such a system could be implemented using different technologies (e.g. liquid metal drops [26], pneumatic buttons [7]). We propose a technology which can be easily replicated using rapid prototyping. It employs a ferromagnetic marble whose motion is controlled via a computer that drives a magnetic stage. The technology is not used to create a new haptic feedback device. It is used to demonstrate the concept of peripheral finger pad haptic feedback and evaluate it in a user study. We argue that it has good properties for an initial study: it offers high control of different factors which are presented next, and does not require to take any precaution.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Dimensions", "text": "The dimensions that can be leveraged are closely related to the motion and physical factors of the marble. Below, we describe the principal dimensions that we considered.\nAngle. The 1D surface formed by the periphery of the finger pad is bent around the finger, which could be approximated to an arc of an ellipse. Contacting the marble on that surface brings an idea of localization that can be translated in directional motion. Different angles could be leveraged to convey Sharpness. When contacting the finger pad, the sharpness of the contact depends on the current motion of the marble. The contact can be static if the marble is steadily pushing into the finger pulp. It can be dynamic if the marble is rapidly rolling bidirectionally along the finger pulp. These contact characteristics could be used as different style of contact: such as marble poking or marble vibrating (e.g. see figure 2b).\nPattern. The previous dimension describes localized contact. On the other end of the spectrum, we find continuous contact. Continuous contact describe a motion along that 1D surface with the marble continuously in contact with the periphery of the finger pad. In this mode, different motion patterns could be leveraged (e.g. see the bottom arrow of figure 2-a).\nSpeed. A continuous motion on a surface implies a speed at which the marble is moving. Speed is therefore a dimension of motion patterns that could be used to increase the throughput (e.g. see figure 2-c).\nSize. Finally, a marble is a physical spherical object that has intrinsic physical dimensions. The most obvious one is its size. Varying its diameter and therefore its size, is another dimension that could be leveraged (e.g. see figure 2-d).\nOthers. Other dimensions such as the type of material of the marble, or its surface roughness, stiffness, adhesion and temperature etc. could be tested in order to increase the throughput of the system. However, we chose the above five dimensions in order to keep subsequent human factor experiment feasible within a reasonable amount of time.", "n_publication_ref": 0, "n_figure_ref": 4}, {"heading": "HARDWARE", "text": "In order to stimulate peripheral haptic feedback, we built a prototype based on 4 mini DVD drive motors, metallic rods, neodymium magnets and ball bearings (see figure 3). The device controls the 2D position of a ball bearing within a 5cm-side square area. The motors were placed on each side of the square area and connected to an Arduino. Each opposite pair was bound to a perpendicular metallic rod and controlled the position of the rod along the side. A 3D printed platform was created to slide along the rods sitting at the intersection point. Neodymium magnets were glued atop of the platform. The whole device was enclosed in a laser cut box. A ferromagnetic ball bearing is placed on the box cover, with the magnets below it under the box cover. Due to the strong magnetic attraction, moving the platform rolled the ball bearing on the box cover. To control the position of the ball, we developed a C++ application with the Qt framework that communicated via serial port of the computer with the Arduino.", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "Prototype evaluation", "text": "We evaluated the prototype in the back-of-device operation mode as it will be deployed for the user study. A marble with 7 mm diameter was chosen which was the common size for most participants. The motion of the marble was captured 1080×1920 high definition at 250 frames per second using a Sony RX10 III camera. Each frame of the movies was converted to a grey scale image and the motion was tracked using the imfindcircles function in Matlab. The distance was calibrated using the dimensions of the enclosure. We implemented two speed modes, slow and fast, based on a pilot study to test binary detection with the users. Figure 4 (a) shows the measured motion of the marble in both speed modes along one axis of the stage using two of the four linear actuators. The speed values were measured to be 10.8 mm/s and 21.4 mm/s in slow and fast modes. The noise amplified by five times and offset of 5 mm is shown in Figure 4 (a). We observed the 1/f noise below 10 Hz in the noise spectrum. There was also a small peak in the noise spectrum around 6 Hz. The standard deviation of the noise was 0.26 mm. Both the speed and vibration are generated by the stage. Similar speed and vibration were measured with marbles of different sizes.\nWe observed similar performance when the marble motion was controlled along the other axis of the stage using the other two linear actuators. The general motion of the marble is controlled by triggering the two axes alternatively. This created minor oscillations in the marble motion. We evaluated the prototype in various cross axis motions. A clockwise and counterclockwise motion pattern used on the user's finger is shown in Figure 4  hysteresis and intermittent oscillation at the higher speed mode.", "n_publication_ref": 0, "n_figure_ref": 3}, {"heading": "EXPERIMENT", "text": "We conducted a controlled experiment, targeted at assessing what peripheral haptic feedback mechanisms can be leveraged to create passive notification.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Method, procedures and tasks", "text": "In this experiment, we asked 16 participants (40.8 mean age, 11.5 std dev, all right-handed, 6 females, only one computer scientist, recruited at the local university campus) to characterize various haptic stimuli. Our prototype was placed upside down (i.e. ball bearings facing down and hidden from the participant's sight) on a stand in front of the participants.\nParticipants were asked to place their elbow on an arm rest (to avoid the gorilla arm effect) and grab the device with the index finger at the bottom and thumb on top similar to holding their smart phone (see figure 6). We asked them to slightly adjust the positioning of the prototype so that the index finger would be placed at a known position and orientation with respect to frame of reference of the prototype. The participant could see neither the motion nor the size of the ball bearing. The goal is to evaluate participants' ability to recognize various factors composing haptic stimuli located on the peripheral parts of their fingertip pulp. In addition, we also gathered qualitative data to describe how the stimuli were perceived.\nAfter explaining the procedure to the participant, the experimenter asked the participant to place their index finger on the surface of the experimental device. The device embedded a 3D printed guide that helped placing the finger at a known orientation (e.g. perpendicular to the edge) and a tiny hole that gave a reference point when placing the pad of the finger. Those two features were added to ensure a consistent placement of the finger across the experiment. The experimenter then used a digital caliper to measure the dimensions of the finger while placed and slightly squeezed on the surface of the device. The measurements were: the width, depth and elevation of the finger. These measurements were used to adapt the stimuli to the different finger morphologies. Once the measurements were taken, the experimenter played different stimuli to the participants to ensure the measurements accuracy. In practice, this tailoring could be done by measuring the fully pressed finger print size using a touch sensor.\nThe experiment was composed of two parts, each focusing on a particular type of stimuli. The first part aimed at assessing participants' ability to recognize localized contact points. We used a ball bearing with a diameter corresponding to 65% of the elevation of the finger 1 (rounded to the closest integer in millimeters). This part was composed of 20 stimuli varying 2 factors. The first factor was the Angle between the axis of the finger and the general direction of the motion centered in the middle of the first phalanx, which describes the location at which the ball bearing was touching the finger. Angle varied from −90 °to 90 °with a 20 °increment (10 different angles in total). The second factor was Type which describes 2 different types of sharpness: Poke where the ball bearing performed a single contact with the finger lasting 100ms; and Vibration where the ball bearing performed a vibration composed of 5 localized back and forth roll in contact with the finger. The poking force depended on the skin stiffness of the users. However the prototype could exert a maximum 0.1N force. Similarly, the stage vibrated by 3mm but the actual vibration in contact with the skin depended on the skin friction of the users.\nAfter each stimuli and using a custom made application (see figure 6), we asked participants to place markers on a virtual finger in order to record: the location and the surface covered on which they felt the stimuli. We also asked them to rate on a 5-points Likert scale How strong was the stimulus (from very weak to very strong) and How comfortable was the stimulus (from very uncomfortable to very comfortable).\nThe second part aimed at assessing participants' ability to recognize patterns. This part was composed of 20 stimuli varying 3 factors. The first factor was the Pattern which describes the motion followed by the ball bearing along the finger. The different Patterns were (figure 5): rolling from the left part of the pulp to the right part of the pulp in a Clockwise motion, its Counter-Clockwise counter-part, rolling up and down on the Left or Right part of the pulp, and rolling left and right on the Top part of the pulp. The second factor was Speed which describes the speed at which the ball bearing was rolling on the surface. It has 2 different values 2 : Slow (11mm.s −1 ) and Fast (21mm.s −1 ). The third 1 65% of the elevation corresponds approximately to the height at which the finger is the widest. 2 We chose the speeds in function of our device mechanical constraints, but also to ensure that the marbles would not fall due to sudden accelerations.  factor was Size which describes the size of the ball bearing. We chose two different sizes of ball bearing diameter corresponding to 40% and 90% the elevation of the finger 3 (rounded to the closest integer in millimeters).\nAfter each stimuli and using the same custom made application (see figure 6), we asked participants to select the pattern they recognized from a list, identify the size of the ball bearing using a visual comparison between a virtual representation of the ball bearing and an at-scale virtual representation of each participant's finger, and identify the speed of the ball bearing from a list of 2 items (both speeds were demonstrated to the participants during the initial explanations). We also asked them to rate on a 5-points Likert scale How strong the stimuli was (from very weak to very strong) and How comfortable the stimuli was (from very uncomfortable to very comfortable).\nThroughout the experiment, a webcam pointed at the surface of the device was streaming the positioning of the finger to the experimenter who could, if needed, ask the participant to reposition their finger if they had shifted it. In both parts, Factor Definition Angle Angle between the axis of the finger and the general direction of the motion centered in the middle of the first phalanx. GuessedAngle Angle recognized by the participants.\nType Type of stimuli: Poke or Vibration. Poke+Vibration is the aggregation of both. Surface Surface on the periphery of the finger pad on which participant felt the stimuli. Pattern Motion followed by the ball bearing along the finger:\nClockwise, Counter-Clockwise, Left, Right or Top. Speed Speed at which the ball bearing was rolling: Slow or Fast. Size Diameter of the ball bearing: Small or Large. ErrorSize Absolute difference in mm between the recognized diameter and the actual one. Strength Perceived strength of the stimuli. Comfort Perceived comfort of the stimuli. when a trial was completed, the experiment setup automatically progressed to the next stimuli and the experimenter systematically removed the ball bearing used before placing the next one (even if the same was used several time in row) to avoid giving up cues on the size between 2 successive trials. Participants had noise canceling headphones and were played a white noise sound to cover the noise made by our hardware. On average each trial took 30 seconds to complete. The experiment ended after a brief debriefing session. In total, the experiment lasted approximately 40 minutes.\nHalf of the participants started with the first part of the experiment and the other half with the second part. Within each part, participants were presented the different stimuli in a pseudo-random order. The experimental design was: 10 Angles × 2 Types + 2 Sizes × 2 Speeds × 5 Patterns = 40 stimuli per participant.", "n_publication_ref": 1, "n_figure_ref": 4}, {"heading": "RESULTS", "text": "This section reports statistical analysis testing of the different dimensions aforementioned. We discuss the results and the feasibility of leveraging these different dimensions for a peripheral finger pad haptic feedback system in the next section. We summarise all the tested factors in table 1.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Angle", "text": "Our goal in this analysis was to identify the number of different angles we can reliably recognize. To analyze the main effects, we conducted standard within-subjects RM-ANOVA tests on the measured variable GuessedAngle. We used the ezANOVA package in the ez R environment. When significant effects were found, we carried out post-hoc analyses using Tukey tests. The mean GuessedAngle for all Angles are summarized in figure 7.\nFor Type Poke+Vibration (i.e. aggregation of all Poke and Vibration trials), Poke and Vibration, we ran three separated tests and found a significant main effect of Angle (F 9,15 = 159.7 and p < 0.001; F 9,15 = 75.3 and p < 0.001; F 9,15 = 83.1 and p < 0.001). We conducted post-hoc analysis to identify the Angles that could be statistically discriminated for all Type. When significantly different, all p < 0.04. Figure 8 summarizes the different clusters found.", "n_publication_ref": 0, "n_figure_ref": 2}, {"heading": "Touch resolution", "text": "Our goal in this analysis was to identify possible differences of touch resolution depending on the Angle of contact. We used RM-ANOVA and Tukey tests on the measured variable Surface (i.e. surface on the periphery of the finger pad on which they felt the stimuli).\nFor Type Poke+Vibration and Vibration, we found a significant main effect of Angle (F 9,15 = 2.8 and p < 0.005; F 9,15 = 2.9 and p < 0.004). We conducted post-hoc analysis to identify the Angles that could be statistically discriminated. For Poke+Vibration, the Angle 70 °was significantly different from −30 °and 30 °(all p < 0.04). For Vibration, the Angle 70 °was significantly different from 30 °(p < 0.04). There was no significant main effect of Angle for Poke (F = 0.9 and p = 0.49). Figure 9 ", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "Poke+Vibration Poke Vibration", "text": "-90°- 70°- 50°- 30°- 10°-10°- 30°- 50°- 70°- 90°-90°- 70°- 50°- 30°- 10°-10°- 30°- 50°- 70°- 90°- 90°- 70°- 50°- 30°- 10°-10°- 30°- 50°- 70°- 90°F\nigure 8: Angle discrimination for the combination and each Type of sharpness (Poke and Vibration). Red arc represent groups of angles that cannot be differentiated. For instance, an arc spanning from −90 °to −50 °means that −90 °, −70 °and −50 °cannot be differentiated. Indented red arcs show the beginning of a new zone that can be discriminated.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Size", "text": "Our goal in this analysis was to identify how far apart ball diameters should be to reliably differentiate them. We used RM-ANOVA on the measured variable ErrorSize (i.e. the absolute difference in mm between the recognized diameter and the actual one). The mean ErrorSize for all Patterns are summarized in figure 10.\nFor ErrorSize, we found no significant main effect of Pattern (F 4,15 = 0.5 and p = 0.76). The average ErrorSize is 2.1mm (SD 1.4mm).", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "Speed", "text": "Our goal in this analysis was to identify if we would reliably differentiate two different speeds. We used RM-ANOVA on the measured variable SpeedRecognition (i.e. 1 if the right speed was recognized, 0 otherwise).\nFor SpeedRecognition, we found no significant main effect of Pattern (F 4,15 = 0.2 and p = 0.94). The average SpeedRecognition is 0.33mm (SD 0.5mm).    ", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Strength", "text": "Our goal in this analysis was to explore the perceived strength of the different stimuli. To analyze the main effects, we conducted standard Kruskal-Wallis H-test tests on the measured variable Strength. We used the scipy stats library in the Python environment. When significant effects were found, we carried out post-hoc analyses using T-test tests. The distributions of the perceived Strength for all Type, ball Sizes and Patterns are summarized in figure 11. We found a significant main effect of Type (Kru = 39.1 and p < 0.001). We conducted post-hoc analysis to identify the Types that could be statistically discriminated: all pairs between Poke (m = 2.5, SD = 1.1), Vibration (m = 3.3, SD = 1.1) and Pattern (m = 2.9, SD = 1.1) were significantly different (all p < 0.001).\nWe found a significant main effect of ball Size (Kru = 67.0 and p < 0.001). The respective mean and standard deviation were: Small (m = 2.4, SD = 1.0) and Big (m = 3.4, SD = 1.0).\nWe found no significant main effect of the different Patterns (Kru = 6.4 and p = 0.17), nor significant main effect of Angles for the different Types Poke+Vibration, Poke and Vibration (all Kru < 15.5 and all p > 0.07). ", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "Comfort", "text": "Our goal in this analysis was to explore the perceived comfort of the different stimuli. We used Kruskal-Wallis H-test and T-test tests on the measured variable Comfort. The distributions of the perceived Comfort for all Type, ball Sizes and Patterns are summarized in figure 12. We found a significant main effect of ball Size (Kru = 8.4 and p < 0.02). The respective mean and standard deviation were: Small (m = 3.1, SD = 0.9) and Big (m = 3.4, SD = 0.8).\nWe found no significant main effect of Type (Kru = 4.4 and p = 0.11), nor significant main effect of the different Patterns (Kru = 2.7 and p = 0.62), nor significant main effect of Angles for the different Types Poke+Vibration, Poke and Vibration (all Kru < 5.5 and all p > 0.78).", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "Interview", "text": "During the interview, we asked participants how confident they were when reporting the guessed angle, the surface covered and the pattern. 13 of them said that they felt \"pretty\" or \"very\" confident in general. However one participant said \"I was pretty confident. Sometime I was not quite sure but I double thought it and I got it\". Out of the 13, three stated that recognizing the surface covered was somehow more challenging. Another one said \"I was confident with the [angle] but it was harder with the weak touches\". The three participants that were not so confident said: \"It was quite challenging in general, I sort of remember what it was like. Strangely enough when I look toward my finger, even though hidden, I would be more accurate\"; \"I was pretty confident but not that much in the end because starting to have numbness in the finger after a while. \"; and \"I think I did pretty good for the patterns. For the [angle] it felt as if it was always on the tip of my finger\".\nTwo of our participants had overhanging fingernails (3mm and 1.5mm). We asked them a specific question on the difference of sensation between the nail part and the skin. The first one said \"It was the same kind of sensation between the nail and the skin\". The second one said \"Sensation on the nail were the same as on the skin\".\nWhile choosing the set of patterns, we narrowed down the selection to the presented five in order to keep the experiment under a reasonable time limit. However, we ideally wanted to test one way pattern on each side on the tip of the finger, suspecting that participants would be able to tell the difference. We therefore asked them if they would have been able to differentiate those one way patterns. 15 of them were \"definitely sure\" or \"pretty confident\" they would have been able to do so. The last participant told us that he used the 2-way motion to confirm the side and disambiguate between the side and circular patterns, and therefore \"don't know if [he] would have been able to\". ", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "DISCUSSION", "text": "With the Pulp Friction study we aimed at exploring the use of the finger pad periphery for haptic feedback. Using the periphery of the finger has the advantage of expanding the realm of haptic feedback as it is not concurrent with existing feedback which are applied to finger pad or palm. We argue that one could still use the phone vibration mode alongside our marble multiplying the possibilities. Our objective was to layout the different dimensions that could be leveraged for a new haptic notification system, as well as proceeding in an initial test of these different dimensions. We compile our findings into a set of initial guidelines. Angle and sharpness. Figure 8 shows the distinct zones of the GuessedAngle variable that the participants perceived for poke, vibration and combined poke and vibration modes. For reliable haptic feedback, the designers could choose non-consecutive zones. For example, -90 °to -70 °, -30 °to -10 °, 10 °to 30 °and 50 °to 90 °for vibration could be selected. When using a discrete poking stimuli, up to five different angles, e.g. -90 °, -30 °, 0 °, 30 °and 90 °can be chosen spread around the finger. This number drops to four, e.g. -90 °, -30 °, 30 °and 90 °when using a discrete vibrating stimuli. This result correlates the fact that vibration feels more spread than poking. Looking at the analysis of the Surface variable, we are not able to characterize the haptic resolution of the periphery. However when looking at the figure 9, especially the vibration data, one could hypothesize that away from the finger tip, haptic resolution is less.\nMore studies should be carried out to either infirm or confirm this hypothesis.\nPatterns. According to the analysis of the Pattern recognition alongside participants comments, designers can accurately rely on our five proposed patterns as well as orientation versions of the Left, Right and Top Patterns. When observing the participants, we noticed that the lack of attention after a certain number of trials, as well as a confusion due to their mental representation of the Clockwise and Counter-Clockwise Patterns can partly explain not achieving a 100% recognition score. If we assume that certain participants were confused between Clockwise and Counter-Clockwise, the recognition rate for both increased to 98.4%, and the overall rate to 95.9%.\nSize. The average ErrorSize found was 2.1mm with a standard deviation of 1.4mm. Designers can therefore consider that users are able to differentiate sizes that are more than 5mm of diameter apart.\nSpeed. Our findings on Speed did not show any abilities in differentiating our 2 speeds. Our speeds revealed to be too close, but further testing needs to be done. We hypothesis that speeds more than 10mm.s −1 apart could be differentiated.\nStrength. Our analysis showed that there are differences in strength of the stimuli felt by the participants. Designers could therefore use Vibration for stronger stimuli rather than Poke. They could also use bigger marbles to convey a stronger stimuli.\nComfort. In terms of comfort, our analysis did not show any evidence supporting differences of comfort between stimuli (apart for the Size). Therefore, designers should only consider using Small marbles if necessary (e.g. conveying critical application states).\nAlthough this should be taken carefully as we only had two participants with long fingernails, we expected fingernails to affect the ability to sense the stimuli. However it did not seem to be the case.", "n_publication_ref": 0, "n_figure_ref": 2}, {"heading": "Use case scenarios", "text": "We envision the use of the finger pad periphery as a new haptic notification system. In the following, we present several use cases in which such a system could be used. All of these use cases were also mentioned by our participants during the debriefing.\nDiscrete notifications. With current implementations, devices deliver notification from different applications at the same level. Whether a smartphone receives a notification for an email, a text message or a news application, the whole device vibrates. In order to disambiguate the stimuli, users are required to pull their phone out of their pocket and visually check the type of the notification. Using our haptic notification system, when feeling a vibration, users can discretely filter notifications by simply sensing the marble from their pocket. Using strong magnets and small marbles such in-pocket notification could be implemented. One participant referred to it as an alternative to phone notifications which would convey more information discretely and without looking.\nEye-free compass. When discovering a new city, applications such as Google map are often used to navigate from current location to a point of interests (e.g. conference centre, train station, etc.). After having set the destination, users are required to switch their focus from their surroundings to their phone in order to orientate themselves. In order to keep their visual focus on their surroundings, our haptic notification system could act as a compass. While keeping their phone in their pockets, the marble could vibrate left, front or right to indicate which way to go at a crossing. Again strong magnets and small marbles could be used for this in-pocket implementation. One participant particularly stressed that such a system would be eye-free and in your pocket, keeping the user aware and preventing phone-snatching. Another participant even envisioned this compass system useful for navigating in games with open-worlds.\nAccessibility features. Most of the accessibility features implemented in commercial devices use visual modifications that could potentially reduce the available screen real estate (e.g. increasing the font size, use of a magnifier, etc.). Similarly, using the peripheral haptic channel could help conveying information or awareness on the current state of the device to visually impaired users. However it would not consume screen space. For instance, a gentle left roll on the finger could indicate a spelling mistake in the current message and a right roll could indicate that the message cannot be sent because of network issues.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Limitations and future work", "text": "In this paper, we started tackling the design space enabled by the peripheral haptic channel. Although we tested several dimensions, keeping our user study under a reasonable amount of time imposed some constraints. Our study helped identifying which dimensions are suitable candidates to leverage. However, further studies focusing on only one dimension are needed to fully characterize the design space. Furthermore, dimensions such as the type of material composing the marble, the surface roughness, the surface stiffness, adhesion and temperature still needs to be tested. Our current guidelines are therefore meant to be iteratively refined.\nIn the study, the marble movement was tweaked for each participants based on their morphology and the imposed position of the finger. Our setup was tailored for a single user and could not be dynamically updated. However, one could imagine the use of a touch sensor to track the finger position, orientation and morphology using a system such as AnglePose [25] to dynamically adapt the stimuli.\nOn a similar note, the hardware we used required the marbles to be manually put the surface by the experimenter. In order for such a system to be viable, the hardware could be improved to include a docking mechanism at the edge of the device that would store marbles of different sizes. Going even further, since we rely on the use of magnets, one could envision to expand the area of operation reachable by the marbles to other faces of the device. The footprint of the current mechanism could be reduced and integrated into a mobile device by using smaller stepper motors and deploying them at the edges away from the hand grip. This would allow storing the marble at the edge of a device. A different drive mechanism with a matrix of planar electromagnetic coils could reduce the profile further [29].\nOur current prototype imposes several limitations to convey subtle notifications. The four linear actuators create vibrations which are transmitted through the enclosure. A vibrotactile sensation is felt on the user's finger pad and the palm while moving the marble in different patterns. The sensation was constant during uniform velocity. However, certain tactile cues could be discerned if the velocity is changed rapidly. However, the pilot testings indicated that this sensation was weak and did not affect the sensation at the finger periphery. The vibration could be further reduced by mounting the actuators with adequate damping. The linear actuators also created audible noise. The participants used a headphone with white noise audio during the study. In a practical implementation of the technique, a silent operation of the marble is desired.\nThe current prototype was built to evaluate the haptic feedback technique. It imposes several limitations which need to be addressed before it could be deployed on a handheld device. One requirement is to hold the existing devices with minimally altering our grip. The size of the prototype could be reduced using smaller and thinner actuators. Individual mini motors could consume between 0.3-2.7 W power. Smooth trajectories for the patterns and efficient transmission of motion from the motors to the magnetic stage is required for low-power operation. In this way compact driver circuits could be developed due to low heat generation. Subtle input using the marble could also be implemented by placing a 2-axis magnetic sensor with flexible wiring on top of the disc magnets [30].", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "CONCLUSION", "text": "We presented Pulp Friction, a new haptic feedback modality that uses localized stimulation at the periphery of the finger pad. We proposed a technology using a motion controlled marble to demonstrate and explore the usability of Pulp Friction. Our empirical experiment indicated that users would be able to perceive localized haptic feedback in up to five peripheral zones on the finger pulp for poking and vibration; discriminate between poking and vibration; and, at least five different locomotive patterns around their finger. We provide design space description and design guidelines to leverage peripheral haptic channel, and use case examples for future implementation of Pulp Friction.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "ACKNOWLEDGMENT", "text": "This work was supported by the Engineering and Physical Sciences Research Council award number EP/N013948/1.", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "Tesla-Touch: Electrovibration for Touch Surfaces", "journal": "", "year": "2010", "authors": "Olivier Bau; Ivan Poupyrev; Ali Israr; Chris Harrison"}, {"title": "Annual ACM Symposium on User Interface Software and Technology (UIST '10)", "journal": "ACM", "year": "", "authors": ""}, {"title": "WAVES: A Wearable Asymmetric Vibration Excitation System for Presenting Three-Dimensional Translation and Rotation Cues", "journal": "ACM", "year": "2017", "authors": "Heather Culbertson; Julie M Walker; Michael Raitor; Allison M Okamura"}, {"title": "Evaluating the Effectiveness of Physical Shape-change for In-pocket Mobile Device Notifications", "journal": "ACM", "year": "2014", "authors": "Panteleimon Dimitriadis; Jason Alexander"}, {"title": "Active Click: Tactile Feedback for Touch Panels", "journal": "ACM", "year": "2001", "authors": "Masaaki Fukumoto; Toshiaki Sugimura"}, {"title": "HapticClench: Investigating Squeeze Sensations Using Memory Alloys", "journal": "ACM", "year": "2017", "authors": "Aakar Gupta; Antony Albert ; Raj Irudayaraj; Ravin Balakrishnan"}, {"title": "Providing Dynamically Changeable Physical Buttons on a Visual Display", "journal": "", "year": "2009", "authors": "Chris Harrison; Scott E Hudson"}, {"title": "", "journal": "ACM", "year": "", "authors": ""}, {"title": "Haptic Edge Display for Mobile Tactile Interaction", "journal": "ACM", "year": "2016", "authors": "Sungjune Jang; Lawrence H Kim; Kesler Tanner; Hiroshi Ishii; Sean Follmer"}, {"title": "PokeRing: Notifications by Poking Around the Finger", "journal": "ACM", "year": "2018", "authors": "Seungwoo Je; Minkyeong Lee; Yoonji Kim; Liwei Chan; Xing-Dong Yang; Andrea Bianchi"}, {"title": "tactoRing: A Skin-Drag Discrete Display", "journal": "", "year": "2017", "authors": "Seungwoo Je; Brendan Rooney; Liwei Chan; Andrea Bianchi"}, {"title": "", "journal": "ACM", "year": "", "authors": ""}, {"title": "Coding and use of tactile signals from the fingertips in object manipulation tasks", "journal": "Nature Reviews Neuroscience", "year": "2009-04", "authors": "S Johansson Roland;  Flanagan"}, {"title": "Skeletouch: Transparent Electro-tactile Display for Mobile Surfaces", "journal": "ACM", "year": "2012", "authors": "Hiroyuki Kajimoto"}, {"title": "FingerSlide: Investigating Passive Haptic Sliding As A Tacton Channel", "journal": "IEEE", "year": "2018", "authors": "Jason Mark Abhijit Anil Karnik; Kian Alexander; Hong Jian Meng Yap; Pavels Wong;  Dembo"}, {"title": "Tactile Presentation to the Back of a Smartphone with Simultaneous Screen Operation", "journal": "ACM", "year": "2016", "authors": "Sugarragchaa Khurelbaatar; Yuriko Nakai; Ryuta Okazaki; Vibol Yem; Hiroyuki Kajimoto"}, {"title": "HapCube: A Wearable Tactile Device to Provide Tangential and Normal Pseudo-Force Feedback on a Fingertip", "journal": "", "year": "2018", "authors": "Hwan Kim; Hyeonbeom Yi; Hyein Lee; Woohun Lee"}, {"title": "", "journal": "ACM", "year": "", "authors": ""}, {"title": "LIME: LIquid MEtal Interfaces for Non-Rigid Interaction", "journal": "ACM", "year": "2016", "authors": "Qiuyu Lu; Chengpeng Mao; Liyuan Wang; Haipeng Mi"}, {"title": "A Role for Haptics in Mobile Interaction: Initial Design Using a Handheld Tactile Display Prototype", "journal": "ACM", "year": "2006", "authors": "Joseph Luk; Jerome Pasquero; Shannon Little; Karon Maclean; Vincent Levesque; Vincent Hayward"}, {"title": "Simplified design of haptic display by extending one-point kinesthetic feedback to multipoint tactile feedback", "journal": "IEEE Haptics Symposium", "year": "2010", "authors": "K Minamizawa; D Prattichizzo; S Tachi"}, {"title": "MimicTile: A Variable Stiffness Deformable User Interface for Mobile Devices", "journal": "ACM", "year": "2012", "authors": "Yusuke Nakagawa; Akiya Kamimura; Yoichiro Kawaguchi"}, {"title": "MagTics: Flexible and Thin Form Factor Magnetic Actuators for Dynamic and Wearable Haptic Feedback", "journal": "ACM", "year": "2017", "authors": "Fabrizio Pece; Juan Jose Zarate; Velko Vechev; Nadine Besse; Olexandr Gudozhnik; Herbert Shea; Otmar Hilliges"}, {"title": "Tactile Interfaces for Small Touch Screens", "journal": "ACM", "year": "2003", "authors": "Ivan Poupyrev; Shigeaki Maruyama"}, {"title": "Ambient Touch: Designing Tactile Interfaces for Handheld Devices", "journal": "ACM", "year": "2002", "authors": "Ivan Poupyrev; Shigeaki Maruyama"}, {"title": "TouchEngine: A Tactile Display for Handheld Devices", "journal": "", "year": "2002", "authors": "Ivan Poupyrev; Jun Rekimoto; Shigeaki Maruyama"}, {"title": "Extended Abstracts on Human Factors in Computing Systems (CHI EA '02)", "journal": "ACM", "year": "", "authors": ""}, {"title": "Electrotactile Touch Surface by Using Transparent Graphene", "journal": "", "year": "2012", "authors": "Z Radivojevic; P Beecher; C Bower; S Haque; P Andrew; T Hasan; F Bonaccorso; A C Ferrari; B Henson"}, {"title": "Virtual Reality International Conference (VRIC '12)", "journal": "ACM", "year": "", "authors": ""}, {"title": "AnglePose: Robust, Precise Capacitive Touch Tracking via 3D Orientation Estimation", "journal": "ACM", "year": "2011", "authors": "Simon Rogers; John Williamson; Craig Stewart; Roderick Murray-Smith"}, {"title": "Tangible Drops: A Visio-Tactile Display Using Actuated Liquid-Metal Droplets", "journal": "ACM", "year": "2018", "authors": "Timothy Deepak Ranjan Sahoo; Yutaka Neate; Jennifer Tokuda; Simon Pearson; Sriram Robinson; Matt Subramanian;  Jones"}, {"title": "Tangible Drops: A Visio-Tactile Display Using Actuated Liquid-Metal Droplets", "journal": "ACM", "year": "2018", "authors": "Timothy Deepak Ranjan Sahoo; Yutaka Neate; Jennifer Tokuda; Simon Pearson; Sriram Robinson; Matt Subramanian;  Jones"}, {"title": "Sparkle: Hover Feedback with Touchable Electric Arcs", "journal": "ACM", "year": "2017", "authors": "Daniel Spelmezan; Sriram Deepak Ranjan Sahoo;  Subramanian"}, {"title": "shiftIO: Reconfigurable Tactile Elements for Dynamic Affordances and Mobile Interaction", "journal": "ACM", "year": "2017", "authors": "Evan Strasnick; Jackie Yang; Kesler Tanner; Alex Olwal; Sean Follmer"}, {"title": "MobiLimb: Augmenting Mobile Devices with a Robotic Limb", "journal": "ACM", "year": "2018", "authors": "Marc Teyssier; Gilles Bailly; Catherine Pelachaud; Eric Lecolinet"}, {"title": "Properties of cutaneous mechanoreceptors in the human hand related to touch sensation", "journal": "Human neurobiology", "year": "1984", "authors": "B Ake; Roland S Vallbo;  Johansson"}], "figures": [{"figure_label": "1", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 1 :1Figure 1: Pulp Friction based haptic notification at the back of a device from a route planner application.", "figure_data": ""}, {"figure_label": "2", "figure_type": "", "figure_id": "fig_1", "figure_caption": "Figure 2 :2Figure 2: The stimuli dimensions of Pulp Friction illustrated at the back of a phone. (a) Marbles coming to poke the finger from different angles The left marble is rolling beside the finger describing a pattern. (b) Marbles poking and vibrating beside the finger resulting in different sharpness of stimuli. (c) Marbles rolling beside the finger at different speeds. (d) Marbles of different sizes contacting the finger periphery.", "figure_data": ""}, {"figure_label": "3", "figure_type": "", "figure_id": "fig_2", "figure_caption": "Figure 3 :3Figure 3: The prototype with its internal mechanism is shown. In our experiments, it was flipped and fixed upside down with the marble below the device.", "figure_data": ""}, {"figure_label": "4", "figure_type": "", "figure_id": "fig_3", "figure_caption": "Figure 4 :4Figure 4: (a) Measured position and noise (amplified and offset) of the marble in slow (blue) and fast (black) motion mode. (b) Example of clockwise (black) and counterclockwise (blue) motion in both fast (left) and slow (right) mode.", "figure_data": ""}, {"figure_label": "5", "figure_type": "", "figure_id": "fig_4", "figure_caption": "Figure 5 :5Figure 5: Different Patterns used in the experiment. Fingers are seen from the pulp side. Each arrow schematically represents motion described by the marble.", "figure_data": ""}, {"figure_label": "6", "figure_type": "", "figure_id": "fig_5", "figure_caption": "Figure 6 :6Figure 6: User study setup. In the background, application used by the user to describe their perception of the stimuli.", "figure_data": ""}, {"figure_label": "", "figure_type": "", "figure_id": "fig_6", "figure_caption": "Figure 10 summarizes the recognition rates of the different Patterns. The overall recognition rate is 92.4%. 8 participants achieved a 100% recognition rate and 5 participants committed 2 or less errors.", "figure_data": ""}, {"figure_label": "7", "figure_type": "", "figure_id": "fig_7", "figure_caption": "Figure 7 :7Figure 7: Mean GuessedAngle and standard deviation for each stimuli Angle. The results can be visualized for the combination and each Type of sharpness (Poke and Vibration). The red line represents the ideal case where GuessedAngle and Angle are equal.", "figure_data": ""}, {"figure_label": "9", "figure_type": "", "figure_id": "fig_8", "figure_caption": "Figure 9 :9Figure 9: Mean recognized Surface and standard deviation for each stimuli Angle. The results can be visualized for each Type of sharpness (Poke and Vibration).", "figure_data": ""}, {"figure_label": "", "figure_type": "", "figure_id": "fig_9", "figure_caption": "91%", "figure_data": ""}, {"figure_label": "10", "figure_type": "", "figure_id": "fig_10", "figure_caption": "Figure 10 :10Figure 10: Confusion matrix and mean SpeedRecognition and standard deviation for the different Patterns.", "figure_data": ""}, {"figure_label": "11", "figure_type": "", "figure_id": "fig_11", "figure_caption": "Figure 11 :11Figure 11: Mean (in gray) and quartiles of the Strength variable in function of the Patterns, Roll and each Type of sharpness (Poke and Vibration) and the two Sizes.", "figure_data": ""}, {"figure_label": "12", "figure_type": "", "figure_id": "fig_12", "figure_caption": "Figure 12 :12Figure 12: Mean (in gray) and quartiles of the Comfort variable in function of the Patterns, Roll and each Type of sharpness (Poke and Vibration) and the two Sizes.", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Summary of the tested factors.", "figure_data": ""}], "doi": "10.1145/3290605.3300871"}